<?xml version="1.0"?>
<CastXML format="1.2.1">

  <Function id="_477" name="mbsinit" returns="_515" context="_1" location="f19:193" file="f19" line="193" inline="1" mangled="?mbsinit@@YAHPEBU_Mbstatet@@@Z">
    <Argument name="_P" type="_658" location="f19:194" file="f19" line="194"/>
  </Function>
  <Function id="_478" name="wmemchr" returns="_539" context="_1" location="f19:200" file="f19" line="200" inline="1" mangled="?wmemchr@@YAPEA_WPEB_W_W_K@Z">
    <Argument name="_S" type="_517" location="f19:201" file="f19" line="201"/>
    <Argument name="_C" type="_540" location="f19:202" file="f19" line="202"/>
    <Argument name="_N" type="_7" location="f19:203" file="f19" line="203"/>
  </Function>
  <Function id="_479" name="wmemcmp" returns="_515" context="_1" location="f19:213" file="f19" line="213" inline="1" mangled="?wmemcmp@@YAHPEB_W0_K@Z">
    <Argument name="_S1" type="_517" location="f19:214" file="f19" line="214"/>
    <Argument name="_S2" type="_517" location="f19:215" file="f19" line="215"/>
    <Argument name="_N" type="_7" location="f19:216" file="f19" line="216"/>
  </Function>
  <Function id="_480" name="wmemcpy" returns="_539" context="_1" location="f19:229" file="f19" line="229" inline="1" mangled="?wmemcpy@@YAPEA_WPEA_WPEB_W_K@Z">
    <Argument name="_S1" type="_539" location="f19:230" file="f19" line="230"/>
    <Argument name="_S2" type="_517" location="f19:231" file="f19" line="231"/>
    <Argument name="_N" type="_7" location="f19:232" file="f19" line="232"/>
  </Function>
  <Function id="_481" name="wmemmove" returns="_539" context="_1" location="f19:240" file="f19" line="240" inline="1" mangled="?wmemmove@@YAPEA_WPEA_WPEB_W_K@Z">
    <Argument name="_S1" type="_539" location="f19:241" file="f19" line="241"/>
    <Argument name="_S2" type="_517" location="f19:242" file="f19" line="242"/>
    <Argument name="_N" type="_7" location="f19:243" file="f19" line="243"/>
  </Function>
  <Function id="_482" name="wmemset" returns="_539" context="_1" location="f19:252" file="f19" line="252" inline="1" mangled="?wmemset@@YAPEA_WPEA_W_W_K@Z">
    <Argument name="_S" type="_539" location="f19:253" file="f19" line="253"/>
    <Argument name="_C" type="_540" location="f19:254" file="f19" line="254"/>
    <Argument name="_N" type="_7" location="f19:255" file="f19" line="255"/>
  </Function>
  <Typedef id="_483" name="int8_t" type="_659" context="_1" location="f20:18" file="f20" line="18"/>
  <Typedef id="_484" name="int16_t" type="_660" context="_1" location="f20:19" file="f20" line="19"/>
  <Typedef id="_485" name="int32_t" type="_515" context="_1" location="f20:20" file="f20" line="20"/>
  <Typedef id="_486" name="int64_t" type="_520" context="_1" location="f20:21" file="f20" line="21"/>
  <Typedef id="_487" name="uint8_t" type="_661" context="_1" location="f20:22" file="f20" line="22"/>
  <Typedef id="_488" name="uint16_t" type="_518" context="_1" location="f20:23" file="f20" line="23"/>
  <Typedef id="_489" name="uint32_t" type="_514" context="_1" location="f20:24" file="f20" line="24"/>
  <Typedef id="_490" name="uint64_t" type="_512" context="_1" location="f20:25" file="f20" line="25"/>
  <Typedef id="_491" name="int_least8_t" type="_659" context="_1" location="f20:27" file="f20" line="27"/>
  <Typedef id="_492" name="int_least16_t" type="_660" context="_1" location="f20:28" file="f20" line="28"/>
  <Typedef id="_493" name="int_least32_t" type="_515" context="_1" location="f20:29" file="f20" line="29"/>
  <Typedef id="_494" name="int_least64_t" type="_520" context="_1" location="f20:30" file="f20" line="30"/>
  <Typedef id="_495" name="uint_least8_t" type="_661" context="_1" location="f20:31" file="f20" line="31"/>
  <Typedef id="_496" name="uint_least16_t" type="_518" context="_1" location="f20:32" file="f20" line="32"/>
  <Typedef id="_497" name="uint_least32_t" type="_514" context="_1" location="f20:33" file="f20" line="33"/>
  <Typedef id="_498" name="uint_least64_t" type="_512" context="_1" location="f20:34" file="f20" line="34"/>
  <Typedef id="_499" name="int_fast8_t" type="_659" context="_1" location="f20:36" file="f20" line="36"/>
  <Typedef id="_500" name="int_fast16_t" type="_515" context="_1" location="f20:37" file="f20" line="37"/>
  <Typedef id="_501" name="int_fast32_t" type="_515" context="_1" location="f20:38" file="f20" line="38"/>
  <Typedef id="_502" name="int_fast64_t" type="_520" context="_1" location="f20:39" file="f20" line="39"/>
  <Typedef id="_503" name="uint_fast8_t" type="_661" context="_1" location="f20:40" file="f20" line="40"/>
  <Typedef id="_504" name="uint_fast16_t" type="_514" context="_1" location="f20:41" file="f20" line="41"/>
  <Typedef id="_505" name="uint_fast32_t" type="_514" context="_1" location="f20:42" file="f20" line="42"/>
  <Typedef id="_506" name="uint_fast64_t" type="_512" context="_1" location="f20:43" file="f20" line="43"/>
  <Typedef id="_507" name="intmax_t" type="_520" context="_1" location="f20:45" file="f20" line="45"/>
  <Typedef id="_508" name="uintmax_t" type="_512" context="_1" location="f20:46" file="f20" line="46"/>
  <FundamentalType id="_509" name="__int128" size="128" align="128"/>
  <FundamentalType id="_510" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_511" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_662 _663 _664 _665" size="256" align="64"/>
  <FundamentalType id="_512" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_513" type="_666" size="64" align="64"/>
  <FundamentalType id="_514" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_515" name="int" size="32" align="32"/>
  <CvQualifiedType id="_515c" type="_515" const="1"/>
  <FundamentalType id="_516" name="void" size="0" align="8"/>
  <PointerType id="_517" type="_540c" size="64" align="64"/>
  <CvQualifiedType id="_517c" type="_517" const="1"/>
  <FundamentalType id="_518" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_519" name="long int" size="32" align="32"/>
  <FundamentalType id="_520" name="long long int" size="64" align="64"/>
  <Field id="_521" name="_locale_pctype" type="_543" context="_27" access="public" location="f3:612" file="f3" line="612" offset="0"/>
  <Field id="_522" name="_locale_mb_cur_max" type="_515" context="_27" access="public" location="f3:613" file="f3" line="613" offset="64"/>
  <Field id="_523" name="_locale_lc_codepage" type="_514" context="_27" access="public" location="f3:614" file="f3" line="614" offset="96"/>
  <ElaboratedType id="_524" type="_27"/>
  <Field id="_525" name="locinfo" type="_667" context="_29" access="public" location="f3:619" file="f3" line="619" offset="0"/>
  <Field id="_526" name="mbcinfo" type="_668" context="_29" access="public" location="f3:620" file="f3" line="620" offset="64"/>
  <ElaboratedType id="_527" type="_29"/>
  <PointerType id="_528" type="_30" size="64" align="64"/>
  <Field id="_529" name="_Wchar" type="_535" context="_32" access="public" location="f3:627" file="f3" line="627" offset="0"/>
  <Field id="_530" name="_Byte" type="_518" context="_32" access="public" location="f3:628" file="f3" line="628" offset="32"/>
  <Field id="_531" name="_State" type="_518" context="_32" access="public" location="f3:628" file="f3" line="628" offset="48"/>
  <ElaboratedType id="_532" type="_32"/>
  <PointerType id="_533" type="_515" size="64" align="64"/>
  <PointerType id="_534" type="_535" size="64" align="64"/>
  <FundamentalType id="_535" name="long unsigned int" size="32" align="32"/>
  <PointerType id="_536" type="_516" size="64" align="64"/>
  <CvQualifiedType id="_536c" type="_536" const="1"/>
  <PointerType id="_537" type="_516c" size="64" align="64"/>
  <CvQualifiedType id="_516c" type="_516" const="1"/>
  <CvQualifiedType id="_537c" type="_537" const="1"/>
  <PointerType id="_538" type="_666c" size="64" align="64"/>
  <CvQualifiedType id="_538c" type="_538" const="1"/>
  <PointerType id="_539" type="_540" size="64" align="64"/>
  <CvQualifiedType id="_539c" type="_539" const="1"/>
  <FundamentalType id="_540" name="wchar_t" size="16" align="16"/>
  <CvQualifiedType id="_540c" type="_540" const="1"/>
  <PointerType id="_541" type="_512" size="64" align="64"/>
  <PointerType id="_542" type="_7" size="64" align="64"/>
  <PointerType id="_543" type="_518c" size="64" align="64"/>
  <CvQualifiedType id="_518c" type="_518" const="1"/>
  <PointerType id="_544" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <Field id="_545" name="attrib" type="_514" context="_138" access="public" location="f11:37" file="f11" line="37" offset="0"/>
  <Field id="_546" name="time_create" type="_25" context="_138" access="public" location="f11:38" file="f11" line="38" offset="32"/>
  <Field id="_547" name="time_access" type="_25" context="_138" access="public" location="f11:39" file="f11" line="39" offset="64"/>
  <Field id="_548" name="time_write" type="_25" context="_138" access="public" location="f11:40" file="f11" line="40" offset="96"/>
  <Field id="_549" name="size" type="_137" context="_138" access="public" location="f11:41" file="f11" line="41" offset="128"/>
  <Field id="_550" name="name" type="_669" context="_138" access="public" location="f11:42" file="f11" line="42" offset="160"/>
  <Field id="_551" name="attrib" type="_514" context="_139" access="public" location="f11:47" file="f11" line="47" offset="0"/>
  <Field id="_552" name="time_create" type="_25" context="_139" access="public" location="f11:48" file="f11" line="48" offset="32"/>
  <Field id="_553" name="time_access" type="_25" context="_139" access="public" location="f11:49" file="f11" line="49" offset="64"/>
  <Field id="_554" name="time_write" type="_25" context="_139" access="public" location="f11:50" file="f11" line="50" offset="96"/>
  <Field id="_555" name="size" type="_520" context="_139" access="public" location="f11:51" file="f11" line="51" offset="128"/>
  <Field id="_556" name="name" type="_669" context="_139" access="public" location="f11:52" file="f11" line="52" offset="192"/>
  <Field id="_557" name="attrib" type="_514" context="_140" access="public" location="f11:57" file="f11" line="57" offset="0"/>
  <Field id="_558" name="time_create" type="_26" context="_140" access="public" location="f11:58" file="f11" line="58" offset="64"/>
  <Field id="_559" name="time_access" type="_26" context="_140" access="public" location="f11:59" file="f11" line="59" offset="128"/>
  <Field id="_560" name="time_write" type="_26" context="_140" access="public" location="f11:60" file="f11" line="60" offset="192"/>
  <Field id="_561" name="size" type="_137" context="_140" access="public" location="f11:61" file="f11" line="61" offset="256"/>
  <Field id="_562" name="name" type="_669" context="_140" access="public" location="f11:62" file="f11" line="62" offset="288"/>
  <Field id="_563" name="attrib" type="_514" context="_141" access="public" location="f11:67" file="f11" line="67" offset="0"/>
  <Field id="_564" name="time_create" type="_26" context="_141" access="public" location="f11:68" file="f11" line="68" offset="64"/>
  <Field id="_565" name="time_access" type="_26" context="_141" access="public" location="f11:69" file="f11" line="69" offset="128"/>
  <Field id="_566" name="time_write" type="_26" context="_141" access="public" location="f11:70" file="f11" line="70" offset="192"/>
  <Field id="_567" name="size" type="_520" context="_141" access="public" location="f11:71" file="f11" line="71" offset="256"/>
  <Field id="_568" name="name" type="_669" context="_141" access="public" location="f11:72" file="f11" line="72" offset="320"/>
  <PointerType id="_569" type="_670" size="64" align="64"/>
  <PointerType id="_570" type="_671" size="64" align="64"/>
  <PointerType id="_571" type="_672" size="64" align="64"/>
  <PointerType id="_572" type="_673" size="64" align="64"/>
  <PointerType id="_573" type="_517c" size="64" align="64"/>
  <Field id="_574" name="_Placeholder" type="_536" context="_179" access="public" location="f13:30" file="f13" line="30" offset="0"/>
  <ElaboratedType id="_575" type="_179"/>
  <PointerType id="_576" type="_180" size="64" align="64"/>
  <CvQualifiedType id="_576c" type="_576" const="1"/>
  <PointerType id="_577" type="_576" size="64" align="64"/>
  <FundamentalType id="_578" name="double" size="64" align="64"/>
  <PointerType id="_579" type="_539" size="64" align="64"/>
  <FundamentalType id="_580" name="long double" size="64" align="64"/>
  <FundamentalType id="_581" name="float" size="32" align="32"/>
  <Field id="_582" name="tm_sec" type="_515" context="_421" access="public" location="f16:28" file="f16" line="28" offset="0"/>
  <Field id="_583" name="tm_min" type="_515" context="_421" access="public" location="f16:29" file="f16" line="29" offset="32"/>
  <Field id="_584" name="tm_hour" type="_515" context="_421" access="public" location="f16:30" file="f16" line="30" offset="64"/>
  <Field id="_585" name="tm_mday" type="_515" context="_421" access="public" location="f16:31" file="f16" line="31" offset="96"/>
  <Field id="_586" name="tm_mon" type="_515" context="_421" access="public" location="f16:32" file="f16" line="32" offset="128"/>
  <Field id="_587" name="tm_year" type="_515" context="_421" access="public" location="f16:33" file="f16" line="33" offset="160"/>
  <Field id="_588" name="tm_wday" type="_515" context="_421" access="public" location="f16:34" file="f16" line="34" offset="192"/>
  <Field id="_589" name="tm_yday" type="_515" context="_421" access="public" location="f16:35" file="f16" line="35" offset="224"/>
  <Field id="_590" name="tm_isdst" type="_515" context="_421" access="public" location="f16:36" file="f16" line="36" offset="256"/>
  <PointerType id="_591" type="_674c" size="64" align="64"/>
  <PointerType id="_592" type="_25c" size="64" align="64"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <PointerType id="_593" type="_26c" size="64" align="64"/>
  <CvQualifiedType id="_26c" type="_26" const="1"/>
  <PointerType id="_594" type="_35c" size="64" align="64"/>
  <CvQualifiedType id="_35c" type="_35" const="1"/>
  <CvQualifiedType id="_594c" type="_594" const="1"/>
  <Field id="_595" name="st_dev" type="_438" context="_442" access="public" location="f18:26" file="f18" line="26" offset="0"/>
  <Field id="_596" name="st_ino" type="_436" context="_442" access="public" location="f18:27" file="f18" line="27" offset="32"/>
  <Field id="_597" name="st_mode" type="_518" context="_442" access="public" location="f18:28" file="f18" line="28" offset="48"/>
  <Field id="_598" name="st_nlink" type="_660" context="_442" access="public" location="f18:29" file="f18" line="29" offset="64"/>
  <Field id="_599" name="st_uid" type="_660" context="_442" access="public" location="f18:30" file="f18" line="30" offset="80"/>
  <Field id="_600" name="st_gid" type="_660" context="_442" access="public" location="f18:31" file="f18" line="31" offset="96"/>
  <Field id="_601" name="st_rdev" type="_438" context="_442" access="public" location="f18:32" file="f18" line="32" offset="128"/>
  <Field id="_602" name="st_size" type="_440" context="_442" access="public" location="f18:33" file="f18" line="33" offset="160"/>
  <Field id="_603" name="st_atime" type="_25" context="_442" access="public" location="f18:34" file="f18" line="34" offset="192"/>
  <Field id="_604" name="st_mtime" type="_25" context="_442" access="public" location="f18:35" file="f18" line="35" offset="224"/>
  <Field id="_605" name="st_ctime" type="_25" context="_442" access="public" location="f18:36" file="f18" line="36" offset="256"/>
  <Field id="_606" name="st_dev" type="_438" context="_443" access="public" location="f18:41" file="f18" line="41" offset="0"/>
  <Field id="_607" name="st_ino" type="_436" context="_443" access="public" location="f18:42" file="f18" line="42" offset="32"/>
  <Field id="_608" name="st_mode" type="_518" context="_443" access="public" location="f18:43" file="f18" line="43" offset="48"/>
  <Field id="_609" name="st_nlink" type="_660" context="_443" access="public" location="f18:44" file="f18" line="44" offset="64"/>
  <Field id="_610" name="st_uid" type="_660" context="_443" access="public" location="f18:45" file="f18" line="45" offset="80"/>
  <Field id="_611" name="st_gid" type="_660" context="_443" access="public" location="f18:46" file="f18" line="46" offset="96"/>
  <Field id="_612" name="st_rdev" type="_438" context="_443" access="public" location="f18:47" file="f18" line="47" offset="128"/>
  <Field id="_613" name="st_size" type="_520" context="_443" access="public" location="f18:48" file="f18" line="48" offset="192"/>
  <Field id="_614" name="st_atime" type="_25" context="_443" access="public" location="f18:49" file="f18" line="49" offset="256"/>
  <Field id="_615" name="st_mtime" type="_25" context="_443" access="public" location="f18:50" file="f18" line="50" offset="288"/>
  <Field id="_616" name="st_ctime" type="_25" context="_443" access="public" location="f18:51" file="f18" line="51" offset="320"/>
  <Field id="_617" name="st_dev" type="_438" context="_444" access="public" location="f18:56" file="f18" line="56" offset="0"/>
  <Field id="_618" name="st_ino" type="_436" context="_444" access="public" location="f18:57" file="f18" line="57" offset="32"/>
  <Field id="_619" name="st_mode" type="_518" context="_444" access="public" location="f18:58" file="f18" line="58" offset="48"/>
  <Field id="_620" name="st_nlink" type="_660" context="_444" access="public" location="f18:59" file="f18" line="59" offset="64"/>
  <Field id="_621" name="st_uid" type="_660" context="_444" access="public" location="f18:60" file="f18" line="60" offset="80"/>
  <Field id="_622" name="st_gid" type="_660" context="_444" access="public" location="f18:61" file="f18" line="61" offset="96"/>
  <Field id="_623" name="st_rdev" type="_438" context="_444" access="public" location="f18:62" file="f18" line="62" offset="128"/>
  <Field id="_624" name="st_size" type="_440" context="_444" access="public" location="f18:63" file="f18" line="63" offset="160"/>
  <Field id="_625" name="st_atime" type="_26" context="_444" access="public" location="f18:64" file="f18" line="64" offset="192"/>
  <Field id="_626" name="st_mtime" type="_26" context="_444" access="public" location="f18:65" file="f18" line="65" offset="256"/>
  <Field id="_627" name="st_ctime" type="_26" context="_444" access="public" location="f18:66" file="f18" line="66" offset="320"/>
  <Field id="_628" name="st_dev" type="_438" context="_445" access="public" location="f18:71" file="f18" line="71" offset="0"/>
  <Field id="_629" name="st_ino" type="_436" context="_445" access="public" location="f18:72" file="f18" line="72" offset="32"/>
  <Field id="_630" name="st_mode" type="_518" context="_445" access="public" location="f18:73" file="f18" line="73" offset="48"/>
  <Field id="_631" name="st_nlink" type="_660" context="_445" access="public" location="f18:74" file="f18" line="74" offset="64"/>
  <Field id="_632" name="st_uid" type="_660" context="_445" access="public" location="f18:75" file="f18" line="75" offset="80"/>
  <Field id="_633" name="st_gid" type="_660" context="_445" access="public" location="f18:76" file="f18" line="76" offset="96"/>
  <Field id="_634" name="st_rdev" type="_438" context="_445" access="public" location="f18:77" file="f18" line="77" offset="128"/>
  <Field id="_635" name="st_size" type="_520" context="_445" access="public" location="f18:78" file="f18" line="78" offset="192"/>
  <Field id="_636" name="st_atime" type="_26" context="_445" access="public" location="f18:79" file="f18" line="79" offset="256"/>
  <Field id="_637" name="st_mtime" type="_26" context="_445" access="public" location="f18:80" file="f18" line="80" offset="320"/>
  <Field id="_638" name="st_ctime" type="_26" context="_445" access="public" location="f18:81" file="f18" line="81" offset="384"/>
  <Field id="_639" name="st_dev" type="_438" context="_446" access="public" location="f18:89" file="f18" line="89" offset="0"/>
  <Field id="_640" name="st_ino" type="_436" context="_446" access="public" location="f18:90" file="f18" line="90" offset="32"/>
  <Field id="_641" name="st_mode" type="_518" context="_446" access="public" location="f18:91" file="f18" line="91" offset="48"/>
  <Field id="_642" name="st_nlink" type="_660" context="_446" access="public" location="f18:92" file="f18" line="92" offset="64"/>
  <Field id="_643" name="st_uid" type="_660" context="_446" access="public" location="f18:93" file="f18" line="93" offset="80"/>
  <Field id="_644" name="st_gid" type="_660" context="_446" access="public" location="f18:94" file="f18" line="94" offset="96"/>
  <Field id="_645" name="st_rdev" type="_438" context="_446" access="public" location="f18:95" file="f18" line="95" offset="128"/>
  <Field id="_646" name="st_size" type="_440" context="_446" access="public" location="f18:96" file="f18" line="96" offset="160"/>
  <Field id="_647" name="st_atime" type="_35" context="_446" access="public" location="f18:97" file="f18" line="97" offset="192"/>
  <Field id="_648" name="st_mtime" type="_35" context="_446" access="public" location="f18:98" file="f18" line="98" offset="256"/>
  <Field id="_649" name="st_ctime" type="_35" context="_446" access="public" location="f18:99" file="f18" line="99" offset="320"/>
  <PointerType id="_650" type="_675" size="64" align="64"/>
  <PointerType id="_651" type="_676" size="64" align="64"/>
  <PointerType id="_652" type="_677" size="64" align="64"/>
  <PointerType id="_653" type="_678" size="64" align="64"/>
  <PointerType id="_654" type="_679" size="64" align="64"/>
  <CvQualifiedType id="_654c" type="_654" const="1"/>
  <PointerType id="_655" type="_34" size="64" align="64"/>
  <PointerType id="_656" type="_538" size="64" align="64"/>
  <PointerType id="_657" type="_517" size="64" align="64"/>
  <PointerType id="_658" type="_34c" size="64" align="64"/>
  <CvQualifiedType id="_34c" type="_34" const="1"/>
  <FundamentalType id="_659" name="signed char" size="8" align="8"/>
  <FundamentalType id="_660" name="short int" size="16" align="16"/>
  <FundamentalType id="_661" name="unsigned char" size="8" align="8"/>
  <Field id="_662" name="isa" type="_680" context="_511" access="public" offset="0"/>
  <Field id="_663" name="flags" type="_515" context="_511" access="public" offset="64"/>
  <Field id="_664" name="str" type="_538" context="_511" access="public" offset="128"/>
  <Field id="_665" name="length" type="_519" context="_511" access="public" offset="192"/>
  <CvQualifiedType id="_666c" type="_666" const="1"/>
  <PointerType id="_667" type="_681" size="64" align="64"/>
  <PointerType id="_668" type="_682" size="64" align="64"/>
  <ArrayType id="_669" min="0" max="259" type="_540"/>
  <CvQualifiedType id="_674c" type="_674" const="1"/>
  <PointerType id="_680" type="_515c" size="64" align="64"/>
  <FundamentalType id="_666" name="char" size="8" align="8"/>
  <ElaboratedType id="_670" type="_138"/>
  <ElaboratedType id="_671" type="_139"/>
  <ElaboratedType id="_672" type="_140"/>
  <ElaboratedType id="_673" type="_141"/>
  <ElaboratedType id="_674" type="_421"/>
  <ElaboratedType id="_675" type="_442"/>
  <ElaboratedType id="_676" type="_443"/>
  <ElaboratedType id="_677" type="_444"/>
  <ElaboratedType id="_678" type="_445"/>
  <ElaboratedType id="_679" type="_446"/>
  <ElaboratedType id="_681" type="_683"/>
  <ElaboratedType id="_682" type="_684"/>
  <Struct id="_683" name="__crt_locale_data" context="_1" location="f3:619" file="f3" line="619" incomplete="1"/>
  <Struct id="_684" name="__crt_multibyte_data" context="_1" location="f3:620" file="f3" line="620" incomplete="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\vadefs.h"/>
  <File id="f2" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\vcruntime.h"/>
  <File id="f3" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt.h"/>
  <File id="f4" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\errno.h"/>
  <File id="f5" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\vcruntime_string.h"/>
  <File id="f6" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_memcpy_s.h"/>
  <File id="f7" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_stdio_config.h"/>
  <File id="f8" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wconio.h"/>
  <File id="f9" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wctype.h"/>
  <File id="f10" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wdirect.h"/>
  <File id="f11" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wio.h"/>
  <File id="f12" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wprocess.h"/>
  <File id="f13" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wstdio.h"/>
  <File id="f14" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wstdlib.h"/>
  <File id="f15" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wstring.h"/>
  <File id="f16" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\corecrt_wtime.h"/>
  <File id="f17" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\sys/types.h"/>
  <File id="f18" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\sys/stat.h"/>
  <File id="f19" name="C:/Program Files (x86)/Windows Kits/10/include/10.0.22000.0/ucrt\wchar.h"/>
  <File id="f20" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\stdint.h"/>
</CastXML>
