<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_23" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_24" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_25" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_26" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_27" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_27" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_10" name="MyInt" type="_28" context="_1" location="f1:8" file="f1" line="8"/>
  <Typedef id="_11" name="MyULong" type="_29" context="_1" location="f1:9" file="f1" line="9"/>
  <Typedef id="_12" name="FloatPtr" type="_30" context="_1" location="f1:10" file="f1" line="10"/>
  <Struct id="_13" name="" context="_1" location="f1:12" file="f1" line="12" members="_31 _32" size="64" align="32"/>
  <Typedef id="_14" name="Point" type="_33" context="_1" location="f1:15" file="f1" line="15"/>
  <Typedef id="_15" name="PointPtr" type="_34" context="_1" location="f1:17" file="f1" line="17"/>
  <Typedef id="_16" name="Points" type="_35" context="_1" location="f1:18" file="f1" line="18"/>
  <Enumeration id="_17" name="SimpleEnum" type="_28" context="_1" location="f1:27" file="f1" line="27" size="32" align="32">
    <EnumValue name="One" init="1"/>
    <EnumValue name="Two" init="2"/>
  </Enumeration>
  <Enumeration id="_18" name="ScopedEnum" type="_28" context="_1" location="f1:32" file="f1" line="32" scoped="1" size="32" align="32">
    <EnumValue name="Alpha" init="0"/>
    <EnumValue name="Beta" init="1"/>
  </Enumeration>
  <Union id="_19" name="MixedUnion" context="_1" location="f1:37" file="f1" line="37" members="_36 _37 _38 _39 _40 _41" size="64" align="32"/>
  <Namespace id="_20" name="Outer" context="_1" members="_42"/>
  <Namespace id="_21" context="_1" members="_43"/>
  <Struct id="_22" name="BitfieldStruct" context="_1" location="f1:60" file="f1" line="60" members="_44 _45 _46 _47" size="32" align="32"/>
  <FundamentalType id="_23" name="__int128" size="128" align="128"/>
  <FundamentalType id="_24" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_25" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_48 _49 _50 _51" size="256" align="64"/>
  <FundamentalType id="_26" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_27" type="_52" size="64" align="64"/>
  <FundamentalType id="_28" name="int" size="32" align="32"/>
  <FundamentalType id="_29" name="long unsigned int" size="32" align="32"/>
  <PointerType id="_30" type="_53" size="64" align="64"/>
  <Field id="_31" name="x" type="_28" context="_13" access="public" location="f1:13" file="f1" line="13" offset="0"/>
  <Field id="_32" name="y" type="_28" context="_13" access="public" location="f1:14" file="f1" line="14" offset="32"/>
  <ElaboratedType id="_33" type="_13"/>
  <PointerType id="_34" type="_14" size="64" align="64"/>
  <ArrayType id="_35" min="0" max="4" type="_14"/>
  <Field id="_36" name="i" type="_28" context="_19" access="public" location="f1:38" file="f1" line="38" offset="0"/>
  <Field id="_37" name="f" type="_53" context="_19" access="public" location="f1:39" file="f1" line="39" offset="0"/>
  <Struct id="_38" context="_19" access="public" location="f1:40" file="f1" line="40" members="_54 _55" size="64" align="32"/>
  <Field id="_39" name="" type="_38" context="_19" access="public" location="f1:40" file="f1" line="40" offset="0"/>
  <Unimplemented id="_40" kind="IndirectField"/>
  <Unimplemented id="_41" kind="IndirectField"/>
  <Namespace id="_42" name="Inner" context="_20" members="_56"/>
  <Struct id="_43" name="AnonNamespace" context="_21" location="f1:55" file="f1" line="55" members="_57" size="64" align="64"/>
  <Field id="_44" name="a" type="_58" bits="3" context="_22" access="public" location="f1:61" file="f1" line="61" offset="0"/>
  <Field id="_45" name="b" type="_28" bits="5" context="_22" access="public" location="f1:62" file="f1" line="62" offset="3"/>
  <Field id="_46" name="" type="_58" bits="2" context="_22" access="public" location="f1:63" file="f1" line="63" offset="8"/>
  <Field id="_47" name="c" type="_58" bits="8" context="_22" access="public" location="f1:64" file="f1" line="64" offset="10"/>
  <Field id="_48" name="isa" type="_59" context="_25" access="public" offset="0"/>
  <Field id="_49" name="flags" type="_28" context="_25" access="public" offset="64"/>
  <Field id="_50" name="str" type="_60" context="_25" access="public" offset="128"/>
  <Field id="_51" name="length" type="_61" context="_25" access="public" offset="192"/>
  <FundamentalType id="_53" name="float" size="32" align="32"/>
  <Field id="_54" name="ch" type="_52" context="_38" access="public" location="f1:41" file="f1" line="41" offset="0"/>
  <FundamentalType id="_52" name="char" size="8" align="8"/>
  <Field id="_55" name="sub" type="_28" context="_38" access="public" location="f1:42" file="f1" line="42" offset="32"/>
  <Struct id="_56" name="Namespaced" context="_42" location="f1:48" file="f1" line="48" members="_62" size="32" align="32"/>
  <Field id="_57" name="hidden" type="_63" context="_43" access="public" location="f1:56" file="f1" line="56" offset="0"/>
  <FundamentalType id="_58" name="unsigned int" size="32" align="32"/>
  <PointerType id="_59" type="_28c" size="64" align="64"/>
  <CvQualifiedType id="_28c" type="_28" const="1"/>
  <PointerType id="_60" type="_52c" size="64" align="64"/>
  <CvQualifiedType id="_52c" type="_52" const="1"/>
  <FundamentalType id="_61" name="long int" size="32" align="32"/>
  <Field id="_62" name="inside" type="_28" context="_56" access="public" location="f1:49" file="f1" line="49" offset="0"/>
  <FundamentalType id="_63" name="double" size="64" align="64"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\complicated.h"/>
</CastXML>
