<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_50" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_51" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_52" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_53" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_54" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_54" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_10" name="uintptr_t" type="_55" context="_1" location="f1:63" file="f1" line="63"/>
  <Typedef id="_11" name="va_list" type="_54" context="_1" location="f1:72" file="f1" line="72"/>
  <Typedef id="_12" name="ptrdiff_t" type="_56" context="_1" location="f2:198" file="f2" line="198"/>
  <Typedef id="_13" name="intptr_t" type="_56" context="_1" location="f2:199" file="f2" line="199"/>
  <Function id="_14" name="_rotl" returns="_55" context="_1" location="f2:209" file="f2" line="209" extern="1" artificial="1" mangled="?_rotl@@9">
    <Argument type="_55"/>
    <Argument type="_56"/>
  </Function>
  <Function id="_15" name="__security_init_cookie" returns="_57" context="_1" location="f2:377" file="f2" line="377" mangled="?__security_init_cookie@@YAXXZ"/>
  <Function id="_16" name="__security_check_cookie" returns="_57" context="_1" location="f2:386" file="f2" line="386" mangled="?__security_check_cookie@@YAXI@Z">
    <Argument name="_StackCookie" type="_10" location="f2:386" file="f2" line="386"/>
  </Function>
  <Function id="_17" name="__report_gsfailure" returns="_57" context="_1" location="f2:387" file="f2" line="387" mangled="?__report_gsfailure@@YAXI@Z">
    <Argument name="_StackCookie" type="_10" location="f2:387" file="f2" line="387"/>
  </Function>
  <Variable id="_18" name="__security_cookie" type="_10" context="_1" location="f2:391" file="f2" line="391" extern="1" mangled="?__security_cookie@@3IA"/>
  <Typedef id="_19" name="int8_t" type="_58" context="_1" location="f3:18" file="f3" line="18"/>
  <Typedef id="_20" name="int16_t" type="_59" context="_1" location="f3:19" file="f3" line="19"/>
  <Typedef id="_21" name="int32_t" type="_56" context="_1" location="f3:20" file="f3" line="20"/>
  <Typedef id="_22" name="int64_t" type="_60" context="_1" location="f3:21" file="f3" line="21"/>
  <Typedef id="_23" name="uint8_t" type="_61" context="_1" location="f3:22" file="f3" line="22"/>
  <Typedef id="_24" name="uint16_t" type="_62" context="_1" location="f3:23" file="f3" line="23"/>
  <Typedef id="_25" name="uint32_t" type="_55" context="_1" location="f3:24" file="f3" line="24"/>
  <Typedef id="_26" name="uint64_t" type="_53" context="_1" location="f3:25" file="f3" line="25"/>
  <Typedef id="_27" name="int_least8_t" type="_58" context="_1" location="f3:27" file="f3" line="27"/>
  <Typedef id="_28" name="int_least16_t" type="_59" context="_1" location="f3:28" file="f3" line="28"/>
  <Typedef id="_29" name="int_least32_t" type="_56" context="_1" location="f3:29" file="f3" line="29"/>
  <Typedef id="_30" name="int_least64_t" type="_60" context="_1" location="f3:30" file="f3" line="30"/>
  <Typedef id="_31" name="uint_least8_t" type="_61" context="_1" location="f3:31" file="f3" line="31"/>
  <Typedef id="_32" name="uint_least16_t" type="_62" context="_1" location="f3:32" file="f3" line="32"/>
  <Typedef id="_33" name="uint_least32_t" type="_55" context="_1" location="f3:33" file="f3" line="33"/>
  <Typedef id="_34" name="uint_least64_t" type="_53" context="_1" location="f3:34" file="f3" line="34"/>
  <Typedef id="_35" name="int_fast8_t" type="_58" context="_1" location="f3:36" file="f3" line="36"/>
  <Typedef id="_36" name="int_fast16_t" type="_56" context="_1" location="f3:37" file="f3" line="37"/>
  <Typedef id="_37" name="int_fast32_t" type="_56" context="_1" location="f3:38" file="f3" line="38"/>
  <Typedef id="_38" name="int_fast64_t" type="_60" context="_1" location="f3:39" file="f3" line="39"/>
  <Typedef id="_39" name="uint_fast8_t" type="_61" context="_1" location="f3:40" file="f3" line="40"/>
  <Typedef id="_40" name="uint_fast16_t" type="_55" context="_1" location="f3:41" file="f3" line="41"/>
  <Typedef id="_41" name="uint_fast32_t" type="_55" context="_1" location="f3:42" file="f3" line="42"/>
  <Typedef id="_42" name="uint_fast64_t" type="_53" context="_1" location="f3:43" file="f3" line="43"/>
  <Typedef id="_43" name="intmax_t" type="_60" context="_1" location="f3:45" file="f3" line="45"/>
  <Typedef id="_44" name="uintmax_t" type="_53" context="_1" location="f3:46" file="f3" line="46"/>
  <Namespace id="_45" name="std" context="_1" members="_10 _13 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _63"/>
  <Struct id="_46" name="A" context="_1" location="f4:4" file="f4" line="4" members="_64 _65 _66 _67 _68 _69 _70 _71" size="256" align="64"/>
  <Struct id="_47" name="B" context="_1" location="f4:15" file="f4" line="15" members="_72 _73 _74 _75 _76 _77 _78 _79" size="256" align="64"/>
  <Struct id="_48" name="C" context="_1" location="f4:26" file="f4" line="26" members="_80 _81" size="512" align="64"/>
  <Struct id="_49" name="D" context="_1" location="f4:31" file="f4" line="31" members="_82 _83" size="480" align="16"/>
  <FundamentalType id="_50" name="__int128" size="128" align="128"/>
  <FundamentalType id="_51" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_52" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_84 _85 _86 _87" size="256" align="64"/>
  <FundamentalType id="_53" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_54" type="_88" size="64" align="64"/>
  <FundamentalType id="_55" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_56" name="int" size="32" align="32"/>
  <FundamentalType id="_57" name="void" size="0" align="8"/>
  <FundamentalType id="_58" name="signed char" size="8" align="8"/>
  <FundamentalType id="_59" name="short int" size="16" align="16"/>
  <FundamentalType id="_60" name="long long int" size="64" align="64"/>
  <FundamentalType id="_61" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_62" name="short unsigned int" size="16" align="16"/>
  <Namespace id="_63" name="tr1" context="_45" members="_10 _13 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44"/>
  <Field id="_64" name="a1" type="_19" context="_46" access="public" location="f4:5" file="f4" line="5" offset="0"/>
  <Field id="_65" name="a2" type="_20" context="_46" access="public" location="f4:6" file="f4" line="6" offset="16"/>
  <Field id="_66" name="a3" type="_21" context="_46" access="public" location="f4:7" file="f4" line="7" offset="32"/>
  <Field id="_67" name="a4" type="_22" context="_46" access="public" location="f4:8" file="f4" line="8" offset="64"/>
  <Field id="_68" name="a5" type="_23" context="_46" access="public" location="f4:9" file="f4" line="9" offset="128"/>
  <Field id="_69" name="a6" type="_24" context="_46" access="public" location="f4:10" file="f4" line="10" offset="144"/>
  <Field id="_70" name="a7" type="_25" context="_46" access="public" location="f4:11" file="f4" line="11" offset="160"/>
  <Field id="_71" name="a8" type="_26" context="_46" access="public" location="f4:12" file="f4" line="12" offset="192"/>
  <Field id="_72" name="b1" type="_19" context="_47" access="public" location="f4:16" file="f4" line="16" offset="0"/>
  <Field id="_73" name="b2" type="_20" context="_47" access="public" location="f4:17" file="f4" line="17" offset="16"/>
  <Field id="_74" name="b3" type="_21" context="_47" access="public" location="f4:18" file="f4" line="18" offset="32"/>
  <Field id="_75" name="b4" type="_22" context="_47" access="public" location="f4:19" file="f4" line="19" offset="64"/>
  <Field id="_76" name="b5" type="_23" context="_47" access="public" location="f4:20" file="f4" line="20" offset="128"/>
  <Field id="_77" name="b6" type="_24" context="_47" access="public" location="f4:21" file="f4" line="21" offset="144"/>
  <Field id="_78" name="b7" type="_25" context="_47" access="public" location="f4:22" file="f4" line="22" offset="160"/>
  <Field id="_79" name="b8" type="_26" context="_47" access="public" location="f4:23" file="f4" line="23" offset="192"/>
  <Field id="_80" name="arr1" type="_89" context="_48" access="public" location="f4:27" file="f4" line="27" offset="0"/>
  <Field id="_81" name="arr2" type="_90" context="_48" access="public" location="f4:28" file="f4" line="28" offset="128"/>
  <Field id="_82" name="d1" type="_91" context="_49" access="public" location="f4:32" file="f4" line="32" offset="0"/>
  <Field id="_83" name="d2" type="_92" context="_49" access="public" location="f4:33" file="f4" line="33" offset="480"/>
  <Field id="_84" name="isa" type="_93" context="_52" access="public" offset="0"/>
  <Field id="_85" name="flags" type="_56" context="_52" access="public" offset="64"/>
  <Field id="_86" name="str" type="_94" context="_52" access="public" offset="128"/>
  <Field id="_87" name="length" type="_95" context="_52" access="public" offset="192"/>
  <ArrayType id="_89" min="0" max="3" type="_21"/>
  <ArrayType id="_90" min="0" max="1" type="_96"/>
  <ArrayType id="_91" min="0" max="4" type="_97"/>
  <ArrayType id="_92" min="0" max="-1" type="_19"/>
  <PointerType id="_93" type="_56c" size="64" align="64"/>
  <CvQualifiedType id="_56c" type="_56" const="1"/>
  <PointerType id="_94" type="_88c" size="64" align="64"/>
  <CvQualifiedType id="_88c" type="_88" const="1"/>
  <FundamentalType id="_95" name="long int" size="32" align="32"/>
  <ArrayType id="_96" min="0" max="2" type="_26"/>
  <ArrayType id="_97" min="0" max="5" type="_24"/>
  <FundamentalType id="_88" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\vadefs.h"/>
  <File id="f2" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\vcruntime.h"/>
  <File id="f3" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\stdint.h"/>
  <File id="f4" name="\\VBoxSvr\vbox\castxml\headers\fixed_width.h"/>
</CastXML>
