<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="A" context="_1" location="f1:1" file="f1" line="1" members="_18 _19 _20 _21 _22 _23" size="64" align="32"/>
  <Struct id="_11" name="B" context="_1" location="f1:7" file="f1" line="7" members="_24 _25 _26 _27 _28 _29" size="128" align="64"/>
  <Class id="_12" name="C" context="_1" location="f1:13" file="f1" line="13" members="_30 _31 _32 _33 _34 _35 _36" size="48" align="16"/>
  <FundamentalType id="_13" name="__int128" size="128" align="128"/>
  <FundamentalType id="_14" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_15" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_37 _38 _39 _40" size="256" align="64"/>
  <FundamentalType id="_16" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_17" type="_41" size="64" align="64"/>
  <Field id="_18" name="i" type="_42" context="_10" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_19" name="f" type="_43" context="_10" access="public" location="f1:4" file="f1" line="4" offset="32"/>
  <Constructor id="_20" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_21" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_44" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_22" name="=" returns="_45" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="??4A@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_44" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_23" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_24" name="i" type="_41" context="_11" access="public" location="f1:9" file="f1" line="9" offset="0"/>
  <Field id="_25" name="d" type="_46" context="_11" access="public" location="f1:10" file="f1" line="10" offset="64"/>
  <Constructor id="_26" name="B" context="_11" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1"/>
  <Constructor id="_27" name="B" context="_11" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1">
    <Argument type="_47" location="f1:7" file="f1" line="7"/>
  </Constructor>
  <OperatorMethod id="_28" name="=" returns="_48" context="_11" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1" mangled="??4B@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_47" location="f1:7" file="f1" line="7"/>
  </OperatorMethod>
  <Destructor id="_29" name="B" context="_11" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1"/>
  <Field id="_30" name="i" type="_41" context="_12" access="private" location="f1:15" file="f1" line="15" offset="0"/>
  <Field id="_31" name="us" type="_49" context="_12" access="private" location="f1:16" file="f1" line="16" offset="16"/>
  <Field id="_32" name="s" type="_50" context="_12" access="private" location="f1:17" file="f1" line="17" offset="32"/>
  <Constructor id="_33" name="C" context="_12" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <Constructor id="_34" name="C" context="_12" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1">
    <Argument type="_51" location="f1:13" file="f1" line="13"/>
  </Constructor>
  <OperatorMethod id="_35" name="=" returns="_52" context="_12" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1" mangled="??4C@@QEAAAEAV0@AEBV0@@Z">
    <Argument type="_51" location="f1:13" file="f1" line="13"/>
  </OperatorMethod>
  <Destructor id="_36" name="C" context="_12" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <Field id="_37" name="isa" type="_53" context="_15" access="public" offset="0"/>
  <Field id="_38" name="flags" type="_42" context="_15" access="public" offset="64"/>
  <Field id="_39" name="str" type="_54" context="_15" access="public" offset="128"/>
  <Field id="_40" name="length" type="_55" context="_15" access="public" offset="192"/>
  <FundamentalType id="_41" name="char" size="8" align="8"/>
  <FundamentalType id="_42" name="int" size="32" align="32"/>
  <FundamentalType id="_43" name="float" size="32" align="32"/>
  <ReferenceType id="_44" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_45" type="_10" size="64" align="64"/>
  <FundamentalType id="_46" name="double" size="64" align="64"/>
  <ReferenceType id="_47" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_48" type="_11" size="64" align="64"/>
  <FundamentalType id="_49" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_50" name="short int" size="16" align="16"/>
  <ReferenceType id="_51" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_52" type="_12" size="64" align="64"/>
  <PointerType id="_53" type="_42c" size="64" align="64"/>
  <CvQualifiedType id="_42c" type="_42" const="1"/>
  <PointerType id="_54" type="_41c" size="64" align="64"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <FundamentalType id="_55" name="long int" size="32" align="32"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\basics.h"/>
</CastXML>
