<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_52" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_53" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_54" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_55" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_56" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_56" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_10" name="uintptr_t" type="_55" context="_1" location="f1:61" file="f1" line="61"/>
  <Typedef id="_11" name="va_list" type="_56" context="_1" location="f1:72" file="f1" line="72"/>
  <Function id="_12" name="__va_start" returns="_57" context="_1" location="f1:155" file="f1" line="155" extern="1" artificial="1" mangled="?__va_start@@9">
    <Argument type="_58"/>
    <Ellipsis/>
  </Function>
  <Typedef id="_13" name="ptrdiff_t" type="_59" context="_1" location="f2:194" file="f2" line="194"/>
  <Typedef id="_14" name="intptr_t" type="_59" context="_1" location="f2:195" file="f2" line="195"/>
  <Typedef id="_15" name="__vcrt_bool" type="_60" context="_1" location="f2:203" file="f2" line="203"/>
  <Function id="_16" name="__security_init_cookie" returns="_57" context="_1" location="f2:377" file="f2" line="377" mangled="?__security_init_cookie@@9"/>
  <Function id="_17" name="__security_check_cookie" returns="_57" context="_1" location="f2:386" file="f2" line="386" mangled="?__security_check_cookie@@9">
    <Argument name="_StackCookie" type="_10" location="f2:386" file="f2" line="386"/>
  </Function>
  <Function id="_18" name="__report_gsfailure" returns="_57" context="_1" location="f2:387" file="f2" line="387" mangled="?__report_gsfailure@@9">
    <Argument name="_StackCookie" type="_10" location="f2:387" file="f2" line="387"/>
  </Function>
  <Variable id="_19" name="__security_cookie" type="_10" context="_1" location="f2:391" file="f2" line="391" extern="1" mangled="?__security_cookie@@3_KA"/>
  <Typedef id="_20" name="int8_t" type="_61" context="_1" location="f3:18" file="f3" line="18"/>
  <Typedef id="_21" name="int16_t" type="_62" context="_1" location="f3:19" file="f3" line="19"/>
  <Typedef id="_22" name="int32_t" type="_63" context="_1" location="f3:20" file="f3" line="20"/>
  <Typedef id="_23" name="int64_t" type="_59" context="_1" location="f3:21" file="f3" line="21"/>
  <Typedef id="_24" name="uint8_t" type="_64" context="_1" location="f3:22" file="f3" line="22"/>
  <Typedef id="_25" name="uint16_t" type="_65" context="_1" location="f3:23" file="f3" line="23"/>
  <Typedef id="_26" name="uint32_t" type="_66" context="_1" location="f3:24" file="f3" line="24"/>
  <Typedef id="_27" name="uint64_t" type="_55" context="_1" location="f3:25" file="f3" line="25"/>
  <Typedef id="_28" name="int_least8_t" type="_61" context="_1" location="f3:27" file="f3" line="27"/>
  <Typedef id="_29" name="int_least16_t" type="_62" context="_1" location="f3:28" file="f3" line="28"/>
  <Typedef id="_30" name="int_least32_t" type="_63" context="_1" location="f3:29" file="f3" line="29"/>
  <Typedef id="_31" name="int_least64_t" type="_59" context="_1" location="f3:30" file="f3" line="30"/>
  <Typedef id="_32" name="uint_least8_t" type="_64" context="_1" location="f3:31" file="f3" line="31"/>
  <Typedef id="_33" name="uint_least16_t" type="_65" context="_1" location="f3:32" file="f3" line="32"/>
  <Typedef id="_34" name="uint_least32_t" type="_66" context="_1" location="f3:33" file="f3" line="33"/>
  <Typedef id="_35" name="uint_least64_t" type="_55" context="_1" location="f3:34" file="f3" line="34"/>
  <Typedef id="_36" name="int_fast8_t" type="_61" context="_1" location="f3:36" file="f3" line="36"/>
  <Typedef id="_37" name="int_fast16_t" type="_63" context="_1" location="f3:37" file="f3" line="37"/>
  <Typedef id="_38" name="int_fast32_t" type="_63" context="_1" location="f3:38" file="f3" line="38"/>
  <Typedef id="_39" name="int_fast64_t" type="_59" context="_1" location="f3:39" file="f3" line="39"/>
  <Typedef id="_40" name="uint_fast8_t" type="_64" context="_1" location="f3:40" file="f3" line="40"/>
  <Typedef id="_41" name="uint_fast16_t" type="_66" context="_1" location="f3:41" file="f3" line="41"/>
  <Typedef id="_42" name="uint_fast32_t" type="_66" context="_1" location="f3:42" file="f3" line="42"/>
  <Typedef id="_43" name="uint_fast64_t" type="_55" context="_1" location="f3:43" file="f3" line="43"/>
  <Typedef id="_44" name="intmax_t" type="_59" context="_1" location="f3:45" file="f3" line="45"/>
  <Typedef id="_45" name="uintmax_t" type="_55" context="_1" location="f3:46" file="f3" line="46"/>
  <Namespace id="_46" name="std" context="_1" members="_10 _14 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _67"/>
  <Struct id="_47" name="A" context="_1" location="f4:4" file="f4" line="4" members="_68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79" size="256" align="64"/>
  <Struct id="_48" name="B" context="_1" location="f4:15" file="f4" line="15" members="_80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91" size="256" align="64"/>
  <Struct id="_49" name="C" context="_1" location="f4:26" file="f4" line="26" members="_92 _93 _94 _95 _96 _97" size="512" align="64"/>
  <Struct id="_50" name="D" context="_1" location="f4:31" file="f4" line="31" members="_98 _99 _100 _101 _102 _103" size="480" align="16"/>
  <Function id="_51" name="__builtin_memcpy" returns="_104" context="_1" location="f4:26" file="f4" line="26" extern="1" artificial="1" mangled="?__builtin_memcpy@@9">
    <Argument type="_104"/>
    <Argument type="_105"/>
    <Argument type="_55"/>
  </Function>
  <FundamentalType id="_52" name="__int128" size="128" align="128"/>
  <FundamentalType id="_53" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_54" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_106 _107 _108 _109" size="256" align="64"/>
  <FundamentalType id="_55" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_56" type="_110" size="64" align="64"/>
  <FundamentalType id="_57" name="void" size="0" align="8"/>
  <PointerType id="_58" type="_56" size="64" align="64"/>
  <FundamentalType id="_59" name="long long int" size="64" align="64"/>
  <FundamentalType id="_60" name="bool" size="8" align="8"/>
  <FundamentalType id="_61" name="signed char" size="8" align="8"/>
  <FundamentalType id="_62" name="short int" size="16" align="16"/>
  <FundamentalType id="_63" name="int" size="32" align="32"/>
  <FundamentalType id="_64" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_65" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_66" name="unsigned int" size="32" align="32"/>
  <Namespace id="_67" name="tr1" context="_46" members="_10 _14 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45"/>
  <Field id="_68" name="a1" type="_20" context="_47" access="public" location="f4:5" file="f4" line="5" offset="0"/>
  <Field id="_69" name="a2" type="_21" context="_47" access="public" location="f4:6" file="f4" line="6" offset="16"/>
  <Field id="_70" name="a3" type="_22" context="_47" access="public" location="f4:7" file="f4" line="7" offset="32"/>
  <Field id="_71" name="a4" type="_23" context="_47" access="public" location="f4:8" file="f4" line="8" offset="64"/>
  <Field id="_72" name="a5" type="_24" context="_47" access="public" location="f4:9" file="f4" line="9" offset="128"/>
  <Field id="_73" name="a6" type="_25" context="_47" access="public" location="f4:10" file="f4" line="10" offset="144"/>
  <Field id="_74" name="a7" type="_26" context="_47" access="public" location="f4:11" file="f4" line="11" offset="160"/>
  <Field id="_75" name="a8" type="_27" context="_47" access="public" location="f4:12" file="f4" line="12" offset="192"/>
  <Constructor id="_76" name="A" context="_47" access="public" location="f4:4" file="f4" line="4" inline="1" artificial="1"/>
  <Constructor id="_77" name="A" context="_47" access="public" location="f4:4" file="f4" line="4" inline="1" artificial="1">
    <Argument type="_111" location="f4:4" file="f4" line="4"/>
  </Constructor>
  <OperatorMethod id="_78" name="=" returns="_112" context="_47" access="public" location="f4:4" file="f4" line="4" inline="1" artificial="1" mangled="??4A@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_111" location="f4:4" file="f4" line="4"/>
  </OperatorMethod>
  <Destructor id="_79" name="A" context="_47" access="public" location="f4:4" file="f4" line="4" inline="1" artificial="1"/>
  <Field id="_80" name="b1" type="_20" context="_48" access="public" location="f4:16" file="f4" line="16" offset="0"/>
  <Field id="_81" name="b2" type="_21" context="_48" access="public" location="f4:17" file="f4" line="17" offset="16"/>
  <Field id="_82" name="b3" type="_22" context="_48" access="public" location="f4:18" file="f4" line="18" offset="32"/>
  <Field id="_83" name="b4" type="_23" context="_48" access="public" location="f4:19" file="f4" line="19" offset="64"/>
  <Field id="_84" name="b5" type="_24" context="_48" access="public" location="f4:20" file="f4" line="20" offset="128"/>
  <Field id="_85" name="b6" type="_25" context="_48" access="public" location="f4:21" file="f4" line="21" offset="144"/>
  <Field id="_86" name="b7" type="_26" context="_48" access="public" location="f4:22" file="f4" line="22" offset="160"/>
  <Field id="_87" name="b8" type="_27" context="_48" access="public" location="f4:23" file="f4" line="23" offset="192"/>
  <Constructor id="_88" name="B" context="_48" access="public" location="f4:15" file="f4" line="15" inline="1" artificial="1"/>
  <Constructor id="_89" name="B" context="_48" access="public" location="f4:15" file="f4" line="15" inline="1" artificial="1">
    <Argument type="_113" location="f4:15" file="f4" line="15"/>
  </Constructor>
  <OperatorMethod id="_90" name="=" returns="_114" context="_48" access="public" location="f4:15" file="f4" line="15" inline="1" artificial="1" mangled="??4B@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_113" location="f4:15" file="f4" line="15"/>
  </OperatorMethod>
  <Destructor id="_91" name="B" context="_48" access="public" location="f4:15" file="f4" line="15" inline="1" artificial="1"/>
  <Field id="_92" name="arr1" type="_115" context="_49" access="public" location="f4:27" file="f4" line="27" offset="0"/>
  <Field id="_93" name="arr2" type="_116" context="_49" access="public" location="f4:28" file="f4" line="28" offset="128"/>
  <Constructor id="_94" name="C" context="_49" access="public" location="f4:26" file="f4" line="26" inline="1" artificial="1"/>
  <Constructor id="_95" name="C" context="_49" access="public" location="f4:26" file="f4" line="26" inline="1" artificial="1">
    <Argument type="_117" location="f4:26" file="f4" line="26"/>
  </Constructor>
  <OperatorMethod id="_96" name="=" returns="_118" context="_49" access="public" location="f4:26" file="f4" line="26" inline="1" artificial="1" mangled="??4C@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_117" location="f4:26" file="f4" line="26"/>
  </OperatorMethod>
  <Destructor id="_97" name="C" context="_49" access="public" location="f4:26" file="f4" line="26" inline="1" artificial="1"/>
  <Field id="_98" name="d1" type="_119" context="_50" access="public" location="f4:32" file="f4" line="32" offset="0"/>
  <Field id="_99" name="d2" type="_120" context="_50" access="public" location="f4:33" file="f4" line="33" offset="480"/>
  <Constructor id="_100" name="D" context="_50" access="public" location="f4:31" file="f4" line="31" inline="1" artificial="1"/>
  <Constructor id="_101" name="D" context="_50" access="public" location="f4:31" file="f4" line="31" inline="1" artificial="1">
    <Argument type="_121" location="f4:31" file="f4" line="31"/>
  </Constructor>
  <OperatorMethod id="_102" name="=" returns="_122" context="_50" access="public" location="f4:31" file="f4" line="31" inline="1" artificial="1" mangled="??4D@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_121" location="f4:31" file="f4" line="31"/>
  </OperatorMethod>
  <Destructor id="_103" name="D" context="_50" access="public" location="f4:31" file="f4" line="31" inline="1" artificial="1"/>
  <PointerType id="_104" type="_57" size="64" align="64"/>
  <PointerType id="_105" type="_57c" size="64" align="64"/>
  <CvQualifiedType id="_57c" type="_57" const="1"/>
  <Field id="_106" name="isa" type="_123" context="_54" access="public" offset="0"/>
  <Field id="_107" name="flags" type="_63" context="_54" access="public" offset="64"/>
  <Field id="_108" name="str" type="_124" context="_54" access="public" offset="128"/>
  <Field id="_109" name="length" type="_125" context="_54" access="public" offset="192"/>
  <ReferenceType id="_111" type="_47c" size="64" align="64"/>
  <CvQualifiedType id="_47c" type="_47" const="1"/>
  <ReferenceType id="_112" type="_47" size="64" align="64"/>
  <ReferenceType id="_113" type="_48c" size="64" align="64"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <ReferenceType id="_114" type="_48" size="64" align="64"/>
  <ArrayType id="_115" min="0" max="3" type="_22"/>
  <ArrayType id="_116" min="0" max="1" type="_126"/>
  <ReferenceType id="_117" type="_49c" size="64" align="64"/>
  <CvQualifiedType id="_49c" type="_49" const="1"/>
  <ReferenceType id="_118" type="_49" size="64" align="64"/>
  <ArrayType id="_119" min="0" max="4" type="_127"/>
  <ArrayType id="_120" min="0" max="-1" type="_20"/>
  <ReferenceType id="_121" type="_50c" size="64" align="64"/>
  <CvQualifiedType id="_50c" type="_50" const="1"/>
  <ReferenceType id="_122" type="_50" size="64" align="64"/>
  <PointerType id="_123" type="_63c" size="64" align="64"/>
  <CvQualifiedType id="_63c" type="_63" const="1"/>
  <PointerType id="_124" type="_110c" size="64" align="64"/>
  <CvQualifiedType id="_110c" type="_110" const="1"/>
  <FundamentalType id="_125" name="long int" size="32" align="32"/>
  <ArrayType id="_126" min="0" max="2" type="_27"/>
  <ArrayType id="_127" min="0" max="5" type="_25"/>
  <FundamentalType id="_110" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\vadefs.h"/>
  <File id="f2" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\vcruntime.h"/>
  <File id="f3" name="C:/Program Files/Microsoft Visual Studio/2022/Community/VC/Tools/MSVC/14.36.32532/include\stdint.h"/>
  <File id="f4" name="\\VBoxSvr\vbox\castxml\headers\fixed_width.h"/>
</CastXML>
