<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10"/>
  <Typedef id="_2" name="__int128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_7" name="C" context="_1" location="f1:1" file="f1" line="1" members="_16 _17 _18 _19 _20" size="32" align="32"/>
  <Class id="_8" name="B" context="_1" location="f1:6" file="f1" line="6" members="_21 _22 _23 _24 _25 _26" size="96" align="32"/>
  <Class id="_9" name="A" context="_1" location="f1:12" file="f1" line="12" members="_27 _28 _29 _30 _31 _32" size="992" align="32"/>
  <Function id="_10" name="__builtin_memcpy" returns="_33" context="_1" location="f1:6" file="f1" line="6" extern="1" artificial="1" mangled="_Z16__builtin_memcpy">
    <Argument type="_33"/>
    <Argument type="_34"/>
    <Argument type="_35"/>
  </Function>
  <FundamentalType id="_11" name="__int128" size="128" align="128"/>
  <FundamentalType id="_12" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_13" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_36 _37 _38 _39" size="256" align="64"/>
  <PointerType id="_14" type="_40" size="64" align="64"/>
  <ArrayType id="_15" min="0" max="0" type="_41"/>
  <Field id="_16" name="c" type="_42" context="_7" access="private" location="f1:3" file="f1" line="3" offset="0"/>
  <Constructor id="_17" name="C" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_18" name="C" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_43" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_19" name="=" returns="_44" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN1CaSERKS_">
    <Argument type="_43" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_20" name="C" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_21" name="b" type="_45" context="_8" access="private" location="f1:8" file="f1" line="8" offset="0"/>
  <Field id="_22" name="c" type="_46" context="_8" access="private" location="f1:9" file="f1" line="9" offset="32"/>
  <Constructor id="_23" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Constructor id="_24" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1">
    <Argument type="_47" location="f1:6" file="f1" line="6"/>
  </Constructor>
  <OperatorMethod id="_25" name="=" returns="_48" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" mangled="_ZN1BaSERKS_">
    <Argument type="_47" location="f1:6" file="f1" line="6"/>
  </OperatorMethod>
  <Destructor id="_26" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Field id="_27" name="a" type="_45" context="_9" access="private" location="f1:14" file="f1" line="14" offset="0"/>
  <Field id="_28" name="b" type="_49" context="_9" access="private" location="f1:15" file="f1" line="15" offset="32"/>
  <Constructor id="_29" name="A" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1"/>
  <Constructor id="_30" name="A" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1">
    <Argument type="_50" location="f1:12" file="f1" line="12"/>
  </Constructor>
  <OperatorMethod id="_31" name="=" returns="_51" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1" mangled="_ZN1AaSERKS_">
    <Argument type="_50" location="f1:12" file="f1" line="12"/>
  </OperatorMethod>
  <Destructor id="_32" name="A" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1"/>
  <PointerType id="_33" type="_52" size="64" align="64"/>
  <PointerType id="_34" type="_52c" size="64" align="64"/>
  <FundamentalType id="_35" name="long unsigned int" size="64" align="64"/>
  <Field id="_36" name="isa" type="_53" context="_13" access="public" offset="0"/>
  <Field id="_37" name="flags" type="_45" context="_13" access="public" offset="64"/>
  <Field id="_38" name="str" type="_54" context="_13" access="public" offset="128"/>
  <Field id="_39" name="length" type="_55" context="_13" access="public" offset="192"/>
  <Struct id="_41" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_56 _57 _58 _59" size="192" align="64"/>
  <FundamentalType id="_42" name="float" size="32" align="32"/>
  <ReferenceType id="_43" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_44" type="_7" size="64" align="64"/>
  <FundamentalType id="_45" name="int" size="32" align="32"/>
  <ArrayType id="_46" min="0" max="1" type="_7"/>
  <ReferenceType id="_47" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_48" type="_8" size="64" align="64"/>
  <ArrayType id="_49" min="0" max="9" type="_8"/>
  <ReferenceType id="_50" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_51" type="_9" size="64" align="64"/>
  <CvQualifiedType id="_52c" type="_52" const="1"/>
  <PointerType id="_53" type="_45c" size="64" align="64"/>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <PointerType id="_54" type="_40c" size="64" align="64"/>
  <CvQualifiedType id="_40c" type="_40" const="1"/>
  <FundamentalType id="_55" name="long int" size="64" align="64"/>
  <Field id="_56" name="gp_offset" type="_60" context="_41" access="public" offset="0"/>
  <Field id="_57" name="fp_offset" type="_60" context="_41" access="public" offset="32"/>
  <Field id="_58" name="overflow_arg_area" type="_33" context="_41" access="public" offset="64"/>
  <Field id="_59" name="reg_save_area" type="_33" context="_41" access="public" offset="128"/>
  <FundamentalType id="_60" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_40" name="char" size="8" align="8"/>
  <FundamentalType id="_52" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/xmlcast/headers/flat_nested.h"/>
</CastXML>
