<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="Holey" context="_1" location="f1:4" file="f1" line="4" members="_18 _19 _20 _21 _22 _23 _24" size="96" align="32"/>
  <Struct id="_11" name="Packed" context="_1" location="f1:11" file="f1" line="11" members="_25 _26 _27 _28 _29 _30 _31" size="128" align="64"/>
  <Struct id="_12" name="MultiHoles" context="_1" location="f1:18" file="f1" line="18" members="_32 _33 _34 _35 _36 _37 _38 _39" size="96" align="32"/>
  <FundamentalType id="_13" name="__int128" size="128" align="128"/>
  <FundamentalType id="_14" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_15" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_40 _41 _42 _43" size="256" align="64"/>
  <FundamentalType id="_16" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_17" type="_44" size="64" align="64"/>
  <Field id="_18" name="a" type="_44" context="_10" access="public" location="f1:5" file="f1" line="5" offset="0"/>
  <Field id="_19" name="b" type="_45" context="_10" access="public" location="f1:6" file="f1" line="6" offset="32"/>
  <Field id="_20" name="c" type="_46" context="_10" access="public" location="f1:7" file="f1" line="7" offset="64"/>
  <Constructor id="_21" name="Holey" context="_10" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Constructor id="_22" name="Holey" context="_10" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1">
    <Argument type="_47" location="f1:4" file="f1" line="4"/>
  </Constructor>
  <OperatorMethod id="_23" name="=" returns="_48" context="_10" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1" mangled="??4Holey@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_47" location="f1:4" file="f1" line="4"/>
  </OperatorMethod>
  <Destructor id="_24" name="Holey" context="_10" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Field id="_25" name="x" type="_45" context="_11" access="public" location="f1:12" file="f1" line="12" offset="0"/>
  <Field id="_26" name="y" type="_49" context="_11" access="public" location="f1:13" file="f1" line="13" offset="32"/>
  <Field id="_27" name="z" type="_50" context="_11" access="public" location="f1:14" file="f1" line="14" offset="64"/>
  <Constructor id="_28" name="Packed" context="_11" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Constructor id="_29" name="Packed" context="_11" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1">
    <Argument type="_51" location="f1:11" file="f1" line="11"/>
  </Constructor>
  <OperatorMethod id="_30" name="=" returns="_52" context="_11" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1" mangled="??4Packed@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_51" location="f1:11" file="f1" line="11"/>
  </OperatorMethod>
  <Destructor id="_31" name="Packed" context="_11" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Field id="_32" name="a" type="_44" context="_12" access="public" location="f1:19" file="f1" line="19" offset="0"/>
  <Field id="_33" name="b" type="_46" context="_12" access="public" location="f1:20" file="f1" line="20" offset="16"/>
  <Field id="_34" name="c" type="_44" context="_12" access="public" location="f1:21" file="f1" line="21" offset="32"/>
  <Field id="_35" name="d" type="_45" context="_12" access="public" location="f1:22" file="f1" line="22" offset="64"/>
  <Constructor id="_36" name="MultiHoles" context="_12" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Constructor id="_37" name="MultiHoles" context="_12" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1">
    <Argument type="_53" location="f1:18" file="f1" line="18"/>
  </Constructor>
  <OperatorMethod id="_38" name="=" returns="_54" context="_12" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1" mangled="??4MultiHoles@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_53" location="f1:18" file="f1" line="18"/>
  </OperatorMethod>
  <Destructor id="_39" name="MultiHoles" context="_12" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Field id="_40" name="isa" type="_55" context="_15" access="public" offset="0"/>
  <Field id="_41" name="flags" type="_45" context="_15" access="public" offset="64"/>
  <Field id="_42" name="str" type="_56" context="_15" access="public" offset="128"/>
  <Field id="_43" name="length" type="_57" context="_15" access="public" offset="192"/>
  <FundamentalType id="_44" name="char" size="8" align="8"/>
  <FundamentalType id="_45" name="int" size="32" align="32"/>
  <FundamentalType id="_46" name="short int" size="16" align="16"/>
  <ReferenceType id="_47" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_48" type="_10" size="64" align="64"/>
  <FundamentalType id="_49" name="float" size="32" align="32"/>
  <FundamentalType id="_50" name="double" size="64" align="64"/>
  <ReferenceType id="_51" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_52" type="_11" size="64" align="64"/>
  <ReferenceType id="_53" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_54" type="_12" size="64" align="64"/>
  <PointerType id="_55" type="_45c" size="64" align="64"/>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <PointerType id="_56" type="_44c" size="64" align="64"/>
  <CvQualifiedType id="_44c" type="_44" const="1"/>
  <FundamentalType id="_57" name="long int" size="32" align="32"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\holes_real.h"/>
</CastXML>
