<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="Holey" context="_1" location="f1:2" file="f1" line="2" members="_17 _18 _19 _20 _21 _22 _23" size="32" align="32"/>
  <Struct id="_11" name="Packed" context="_1" location="f1:8" file="f1" line="8" members="_24 _25 _26 _27 _28 _29" size="32" align="32"/>
  <FundamentalType id="_12" name="__int128" size="128" align="128"/>
  <FundamentalType id="_13" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_14" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_30 _31 _32 _33" size="256" align="64"/>
  <FundamentalType id="_15" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_16" type="_34" size="64" align="64"/>
  <Field id="_17" name="a" type="_35" bits="3" context="_10" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_18" name="b" type="_35" bits="5" context="_10" access="public" location="f1:4" file="f1" line="4" offset="3"/>
  <Field id="_19" name="c" type="_35" bits="1" context="_10" access="public" location="f1:5" file="f1" line="5" offset="8"/>
  <Constructor id="_20" name="Holey" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Constructor id="_21" name="Holey" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1">
    <Argument type="_36" location="f1:2" file="f1" line="2"/>
  </Constructor>
  <OperatorMethod id="_22" name="=" returns="_37" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1" mangled="??4Holey@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_36" location="f1:2" file="f1" line="2"/>
  </OperatorMethod>
  <Destructor id="_23" name="Holey" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Field id="_24" name="x" type="_35" bits="2" context="_11" access="public" location="f1:9" file="f1" line="9" offset="0"/>
  <Field id="_25" name="y" type="_35" bits="6" context="_11" access="public" location="f1:10" file="f1" line="10" offset="2"/>
  <Constructor id="_26" name="Packed" context="_11" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1"/>
  <Constructor id="_27" name="Packed" context="_11" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_38" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <OperatorMethod id="_28" name="=" returns="_39" context="_11" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="??4Packed@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_38" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Destructor id="_29" name="Packed" context="_11" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1"/>
  <Field id="_30" name="isa" type="_40" context="_14" access="public" offset="0"/>
  <Field id="_31" name="flags" type="_41" context="_14" access="public" offset="64"/>
  <Field id="_32" name="str" type="_42" context="_14" access="public" offset="128"/>
  <Field id="_33" name="length" type="_43" context="_14" access="public" offset="192"/>
  <FundamentalType id="_35" name="unsigned int" size="32" align="32"/>
  <ReferenceType id="_36" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_37" type="_10" size="64" align="64"/>
  <ReferenceType id="_38" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_39" type="_11" size="64" align="64"/>
  <PointerType id="_40" type="_41c" size="64" align="64"/>
  <FundamentalType id="_41" name="int" size="32" align="32"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <PointerType id="_42" type="_34c" size="64" align="64"/>
  <CvQualifiedType id="_34c" type="_34" const="1"/>
  <FundamentalType id="_43" name="long int" size="32" align="32"/>
  <FundamentalType id="_34" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\bitfield_holes.h"/>
</CastXML>
