<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_18" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_19" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_19" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="StatusFlags" context="_1" location="f1:2" file="f1" line="2" members="_20 _21 _22 _23 _24 _25 _26" size="32" align="32"/>
  <Struct id="_11" name="ControlRegister" context="_1" location="f1:9" file="f1" line="9" members="_27 _28 _29 _30 _31 _32 _33 _34" size="32" align="32"/>
  <Struct id="_12" name="Packed32" context="_1" location="f1:17" file="f1" line="17" members="_35 _36 _37 _38 _39 _40 _41 _42" size="32" align="32"/>
  <Struct id="_13" name="Nested" context="_1" location="f1:25" file="f1" line="25" members="_43 _44 _45 _46 _47 _48 _49" size="64" align="32"/>
  <Struct id="_14" name="Flat" context="_1" location="f1:34" file="f1" line="34" members="_50 _51 _52 _53 _54 _55 _56 _57 _58 _59" size="64" align="32"/>
  <FundamentalType id="_15" name="__int128" size="128" align="128"/>
  <FundamentalType id="_16" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_17" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_60 _61 _62 _63" size="256" align="64"/>
  <FundamentalType id="_18" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_19" type="_64" size="64" align="64"/>
  <Field id="_20" name="ready" type="_65" bits="1" context="_10" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_21" name="error" type="_65" bits="1" context="_10" access="public" location="f1:4" file="f1" line="4" offset="1"/>
  <Field id="_22" name="reserved" type="_65" bits="6" context="_10" access="public" location="f1:5" file="f1" line="5" offset="2"/>
  <Constructor id="_23" name="StatusFlags" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Constructor id="_24" name="StatusFlags" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1">
    <Argument type="_66" location="f1:2" file="f1" line="2"/>
  </Constructor>
  <OperatorMethod id="_25" name="=" returns="_67" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1" mangled="??4StatusFlags@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_66" location="f1:2" file="f1" line="2"/>
  </OperatorMethod>
  <Destructor id="_26" name="StatusFlags" context="_10" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Field id="_27" name="mode" type="_65" bits="3" context="_11" access="public" location="f1:10" file="f1" line="10" offset="0"/>
  <Field id="_28" name="speed" type="_68" bits="5" context="_11" access="public" location="f1:11" file="f1" line="11" offset="3"/>
  <Field id="_29" name="enable" type="_65" bits="1" context="_11" access="public" location="f1:12" file="f1" line="12" offset="8"/>
  <Field id="_30" name="reserved" type="_65" bits="23" context="_11" access="public" location="f1:13" file="f1" line="13" offset="9"/>
  <Constructor id="_31" name="ControlRegister" context="_11" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Constructor id="_32" name="ControlRegister" context="_11" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1">
    <Argument type="_69" location="f1:9" file="f1" line="9"/>
  </Constructor>
  <OperatorMethod id="_33" name="=" returns="_70" context="_11" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1" mangled="??4ControlRegister@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_69" location="f1:9" file="f1" line="9"/>
  </OperatorMethod>
  <Destructor id="_34" name="ControlRegister" context="_11" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Field id="_35" name="a" type="_65" bits="8" context="_12" access="public" location="f1:18" file="f1" line="18" offset="0"/>
  <Field id="_36" name="b" type="_65" bits="8" context="_12" access="public" location="f1:19" file="f1" line="19" offset="8"/>
  <Field id="_37" name="c" type="_65" bits="8" context="_12" access="public" location="f1:20" file="f1" line="20" offset="16"/>
  <Field id="_38" name="d" type="_65" bits="8" context="_12" access="public" location="f1:21" file="f1" line="21" offset="24"/>
  <Constructor id="_39" name="Packed32" context="_12" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <Constructor id="_40" name="Packed32" context="_12" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1">
    <Argument type="_71" location="f1:17" file="f1" line="17"/>
  </Constructor>
  <OperatorMethod id="_41" name="=" returns="_72" context="_12" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1" mangled="??4Packed32@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_71" location="f1:17" file="f1" line="17"/>
  </OperatorMethod>
  <Destructor id="_42" name="Packed32" context="_12" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <Field id="_43" name="outer" type="_65" bits="4" context="_13" access="public" location="f1:26" file="f1" line="26" offset="0"/>
  <Struct id="_44" name="" context="_13" access="public" location="f1:27" file="f1" line="27" members="_73 _74 _75 _76 _77 _78" size="32" align="32"/>
  <Field id="_45" name="inner" type="_79" context="_13" access="public" location="f1:30" file="f1" line="30" offset="32"/>
  <Constructor id="_46" name="Nested" context="_13" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1"/>
  <Constructor id="_47" name="Nested" context="_13" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1">
    <Argument type="_80" location="f1:25" file="f1" line="25"/>
  </Constructor>
  <OperatorMethod id="_48" name="=" returns="_81" context="_13" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1" mangled="??4Nested@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_80" location="f1:25" file="f1" line="25"/>
  </OperatorMethod>
  <Destructor id="_49" name="Nested" context="_13" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1"/>
  <Field id="_50" name="top" type="_65" bits="4" context="_14" access="public" location="f1:35" file="f1" line="35" offset="0"/>
  <Union id="_51" context="_14" access="public" location="f1:36" file="f1" line="36" members="_82 _83 _84 _85 _86 _87 _88 _89 _90" size="32" align="32"/>
  <Field id="_52" name="" type="_51" context="_14" access="public" location="f1:36" file="f1" line="36" offset="32"/>
  <Unimplemented id="_53" kind="IndirectField"/>
  <Unimplemented id="_54" kind="IndirectField"/>
  <Unimplemented id="_55" kind="IndirectField"/>
  <Constructor id="_56" name="Flat" context="_14" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1"/>
  <Constructor id="_57" name="Flat" context="_14" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1">
    <Argument type="_91" location="f1:34" file="f1" line="34"/>
  </Constructor>
  <OperatorMethod id="_58" name="=" returns="_92" context="_14" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1" mangled="??4Flat@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_91" location="f1:34" file="f1" line="34"/>
  </OperatorMethod>
  <Destructor id="_59" name="Flat" context="_14" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1"/>
  <Field id="_60" name="isa" type="_93" context="_17" access="public" offset="0"/>
  <Field id="_61" name="flags" type="_68" context="_17" access="public" offset="64"/>
  <Field id="_62" name="str" type="_94" context="_17" access="public" offset="128"/>
  <Field id="_63" name="length" type="_95" context="_17" access="public" offset="192"/>
  <FundamentalType id="_65" name="unsigned int" size="32" align="32"/>
  <ReferenceType id="_66" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_67" type="_10" size="64" align="64"/>
  <FundamentalType id="_68" name="int" size="32" align="32"/>
  <ReferenceType id="_69" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_70" type="_11" size="64" align="64"/>
  <ReferenceType id="_71" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_72" type="_12" size="64" align="64"/>
  <Field id="_73" name="inner1" type="_65" bits="2" context="_44" access="public" location="f1:28" file="f1" line="28" offset="0"/>
  <Field id="_74" name="inner2" type="_65" bits="6" context="_44" access="public" location="f1:29" file="f1" line="29" offset="2"/>
  <Constructor id="_75" name="" context="_44" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Constructor id="_76" name="" context="_44" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1">
    <Argument type="_96" location="f1:27" file="f1" line="27"/>
  </Constructor>
  <OperatorMethod id="_77" name="=" returns="_97" context="_44" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1" mangled="??4&lt;unnamed-type-inner&gt;@Nested@@QEAAAEAU01@AEBU01@@Z">
    <Argument type="_96" location="f1:27" file="f1" line="27"/>
  </OperatorMethod>
  <Destructor id="_78" name="" context="_44" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <ElaboratedType id="_79" type="_44"/>
  <ReferenceType id="_80" type="_13c" size="64" align="64"/>
  <CvQualifiedType id="_13c" type="_13" const="1"/>
  <ReferenceType id="_81" type="_13" size="64" align="64"/>
  <Struct id="_82" context="_51" access="public" location="f1:37" file="f1" line="37" members="_98 _99 _100 _101 _102 _103" size="32" align="32"/>
  <Field id="_83" name="" type="_82" context="_51" access="public" location="f1:37" file="f1" line="37" offset="0"/>
  <Unimplemented id="_84" kind="IndirectField"/>
  <Unimplemented id="_85" kind="IndirectField"/>
  <Field id="_86" name="raw" type="_65" bits="8" context="_51" access="public" location="f1:41" file="f1" line="41" offset="0"/>
  <Constructor id="_87" name="" context="_51" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1"/>
  <Constructor id="_88" name="" context="_51" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1">
    <Argument type="_104" location="f1:36" file="f1" line="36"/>
  </Constructor>
  <OperatorMethod id="_89" name="=" returns="_105" context="_51" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1" mangled="??4&lt;unnamed-type-$S1&gt;@Flat@@QEAAAEAT01@AEBT01@@Z">
    <Argument type="_104" location="f1:36" file="f1" line="36"/>
  </OperatorMethod>
  <Destructor id="_90" name="" context="_51" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1"/>
  <ReferenceType id="_91" type="_14c" size="64" align="64"/>
  <CvQualifiedType id="_14c" type="_14" const="1"/>
  <ReferenceType id="_92" type="_14" size="64" align="64"/>
  <PointerType id="_93" type="_68c" size="64" align="64"/>
  <CvQualifiedType id="_68c" type="_68" const="1"/>
  <PointerType id="_94" type="_64c" size="64" align="64"/>
  <CvQualifiedType id="_64c" type="_64" const="1"/>
  <FundamentalType id="_95" name="long int" size="32" align="32"/>
  <ReferenceType id="_96" type="_44c" size="64" align="64"/>
  <CvQualifiedType id="_44c" type="_44" const="1"/>
  <ReferenceType id="_97" type="_44" size="64" align="64"/>
  <Field id="_98" name="u1" type="_65" bits="3" context="_82" access="public" location="f1:38" file="f1" line="38" offset="0"/>
  <Field id="_99" name="u2" type="_65" bits="5" context="_82" access="public" location="f1:39" file="f1" line="39" offset="3"/>
  <Constructor id="_100" name="" context="_82" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1"/>
  <Constructor id="_101" name="" context="_82" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1">
    <Argument type="_106" location="f1:37" file="f1" line="37"/>
  </Constructor>
  <OperatorMethod id="_102" name="=" returns="_107" context="_82" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1" mangled="??4&lt;unnamed-type-$S2&gt;@&lt;unnamed-type-$S1&gt;@Flat@@QEAAAEAU012@AEBU012@@Z">
    <Argument type="_106" location="f1:37" file="f1" line="37"/>
  </OperatorMethod>
  <Destructor id="_103" name="" context="_82" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1"/>
  <ReferenceType id="_104" type="_51c" size="64" align="64"/>
  <CvQualifiedType id="_51c" type="_51" const="1"/>
  <ReferenceType id="_105" type="_51" size="64" align="64"/>
  <ReferenceType id="_106" type="_82c" size="64" align="64"/>
  <CvQualifiedType id="_82c" type="_82" const="1"/>
  <ReferenceType id="_107" type="_82" size="64" align="64"/>
  <FundamentalType id="_64" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\bitfields.h"/>
</CastXML>
