<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_18" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_19" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_20" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_21" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_21" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_10" name="MyInt" type="_22" context="_1" location="f1:3" file="f1" line="3"/>
  <Struct id="_11" name="Unused" context="_1" location="f1:5" file="f1" line="5" members="_23 _24 _25 _26 _27" size="64" align="64"/>
  <Struct id="_12" name="Nested" context="_1" location="f1:9" file="f1" line="9" members="_28 _29 _30 _31 _32" size="32" align="32"/>
  <Struct id="_13" name="Wrapper" context="_1" location="f1:13" file="f1" line="13" members="_33 _34 _35 _36 _37" size="32" align="32"/>
  <Union id="_14" name="Payload" context="_1" location="f1:17" file="f1" line="17" members="_38 _39 _40 _41 _42 _43" size="32" align="32"/>
  <Enumeration id="_15" name="Status" type="_22" context="_1" location="f1:22" file="f1" line="22" size="32" align="32">
    <EnumValue name="OK" init="0"/>
    <EnumValue name="ERROR" init="1"/>
  </Enumeration>
  <Struct id="_16" name="Main" context="_1" location="f1:27" file="f1" line="27" members="_44 _45 _46 _47 _48 _49" size="64" align="32"/>
  <FundamentalType id="_17" name="__int128" size="128" align="128"/>
  <FundamentalType id="_18" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_19" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_50 _51 _52 _53" size="256" align="64"/>
  <FundamentalType id="_20" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_21" type="_54" size="64" align="64"/>
  <FundamentalType id="_22" name="int" size="32" align="32"/>
  <Field id="_23" name="ignored" type="_55" context="_11" access="public" location="f1:6" file="f1" line="6" offset="0"/>
  <Constructor id="_24" name="Unused" context="_11" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1"/>
  <Constructor id="_25" name="Unused" context="_11" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1">
    <Argument type="_56" location="f1:5" file="f1" line="5"/>
  </Constructor>
  <OperatorMethod id="_26" name="=" returns="_57" context="_11" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1" mangled="??4Unused@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_56" location="f1:5" file="f1" line="5"/>
  </OperatorMethod>
  <Destructor id="_27" name="Unused" context="_11" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1"/>
  <Field id="_28" name="value" type="_10" context="_12" access="public" location="f1:10" file="f1" line="10" offset="0"/>
  <Constructor id="_29" name="Nested" context="_12" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Constructor id="_30" name="Nested" context="_12" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1">
    <Argument type="_58" location="f1:9" file="f1" line="9"/>
  </Constructor>
  <OperatorMethod id="_31" name="=" returns="_59" context="_12" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1" mangled="??4Nested@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_58" location="f1:9" file="f1" line="9"/>
  </OperatorMethod>
  <Destructor id="_32" name="Nested" context="_12" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Field id="_33" name="nested" type="_12" context="_13" access="public" location="f1:14" file="f1" line="14" offset="0"/>
  <Constructor id="_34" name="Wrapper" context="_13" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <Constructor id="_35" name="Wrapper" context="_13" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1">
    <Argument type="_60" location="f1:13" file="f1" line="13"/>
  </Constructor>
  <OperatorMethod id="_36" name="=" returns="_61" context="_13" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1" mangled="??4Wrapper@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_60" location="f1:13" file="f1" line="13"/>
  </OperatorMethod>
  <Destructor id="_37" name="Wrapper" context="_13" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <Field id="_38" name="wrapper" type="_13" context="_14" access="public" location="f1:18" file="f1" line="18" offset="0"/>
  <Field id="_39" name="fallback" type="_62" context="_14" access="public" location="f1:19" file="f1" line="19" offset="0"/>
  <Constructor id="_40" name="Payload" context="_14" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <Constructor id="_41" name="Payload" context="_14" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1">
    <Argument type="_63" location="f1:17" file="f1" line="17"/>
  </Constructor>
  <OperatorMethod id="_42" name="=" returns="_64" context="_14" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1" mangled="??4Payload@@QEAAAEAT0@AEBT0@@Z">
    <Argument type="_63" location="f1:17" file="f1" line="17"/>
  </OperatorMethod>
  <Destructor id="_43" name="Payload" context="_14" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <Field id="_44" name="payload" type="_14" context="_16" access="public" location="f1:28" file="f1" line="28" offset="0"/>
  <Field id="_45" name="status" type="_15" context="_16" access="public" location="f1:29" file="f1" line="29" offset="32"/>
  <Constructor id="_46" name="Main" context="_16" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Constructor id="_47" name="Main" context="_16" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1">
    <Argument type="_65" location="f1:27" file="f1" line="27"/>
  </Constructor>
  <OperatorMethod id="_48" name="=" returns="_66" context="_16" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1" mangled="??4Main@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_65" location="f1:27" file="f1" line="27"/>
  </OperatorMethod>
  <Destructor id="_49" name="Main" context="_16" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Field id="_50" name="isa" type="_67" context="_19" access="public" offset="0"/>
  <Field id="_51" name="flags" type="_22" context="_19" access="public" offset="64"/>
  <Field id="_52" name="str" type="_68" context="_19" access="public" offset="128"/>
  <Field id="_53" name="length" type="_69" context="_19" access="public" offset="192"/>
  <FundamentalType id="_55" name="double" size="64" align="64"/>
  <ReferenceType id="_56" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_57" type="_11" size="64" align="64"/>
  <ReferenceType id="_58" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_59" type="_12" size="64" align="64"/>
  <ReferenceType id="_60" type="_13c" size="64" align="64"/>
  <CvQualifiedType id="_13c" type="_13" const="1"/>
  <ReferenceType id="_61" type="_13" size="64" align="64"/>
  <FundamentalType id="_62" name="float" size="32" align="32"/>
  <ReferenceType id="_63" type="_14c" size="64" align="64"/>
  <CvQualifiedType id="_14c" type="_14" const="1"/>
  <ReferenceType id="_64" type="_14" size="64" align="64"/>
  <ReferenceType id="_65" type="_16c" size="64" align="64"/>
  <CvQualifiedType id="_16c" type="_16" const="1"/>
  <ReferenceType id="_66" type="_16" size="64" align="64"/>
  <PointerType id="_67" type="_22c" size="64" align="64"/>
  <CvQualifiedType id="_22c" type="_22" const="1"/>
  <PointerType id="_68" type="_54c" size="64" align="64"/>
  <CvQualifiedType id="_54c" type="_54" const="1"/>
  <FundamentalType id="_69" name="long int" size="32" align="32"/>
  <FundamentalType id="_54" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\connected_filter.h"/>
</CastXML>
