<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_18" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_18" context="_1" location="f0:0" file="f0" line="0"/>
  <Namespace id="_10" name="TopLevel" context="_1" members="_19"/>
  <Namespace id="_11" name="Outer" context="_1" members="_20"/>
  <Namespace id="_12" context="_1" members="_21"/>
  <Struct id="_13" name="AllNamespaces" context="_1" location="f1:24" file="f1" line="24" members="_22 _23 _24 _25 _26 _27 _28" size="128" align="64"/>
  <FundamentalType id="_14" name="__int128" size="128" align="128"/>
  <FundamentalType id="_15" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_16" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_29 _30 _31 _32" size="256" align="64"/>
  <FundamentalType id="_17" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_18" type="_33" size="64" align="64"/>
  <Struct id="_19" name="A" context="_10" location="f1:4" file="f1" line="4" members="_34 _35 _36 _37 _38" size="32" align="32"/>
  <Namespace id="_20" name="Inner" context="_11" members="_39"/>
  <Struct id="_21" name="C" context="_12" location="f1:18" file="f1" line="18" members="_40 _41 _42 _43 _44" size="64" align="64"/>
  <Field id="_22" name="a" type="_19" context="_13" access="public" location="f1:25" file="f1" line="25" offset="0"/>
  <Field id="_23" name="b" type="_39" context="_13" access="public" location="f1:26" file="f1" line="26" offset="32"/>
  <Field id="_24" name="c" type="_21" context="_13" access="public" location="f1:27" file="f1" line="27" offset="64"/>
  <Constructor id="_25" name="AllNamespaces" context="_13" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1"/>
  <Constructor id="_26" name="AllNamespaces" context="_13" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1">
    <Argument type="_45" location="f1:24" file="f1" line="24"/>
  </Constructor>
  <OperatorMethod id="_27" name="=" returns="_46" context="_13" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1" mangled="??4AllNamespaces@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_45" location="f1:24" file="f1" line="24"/>
  </OperatorMethod>
  <Destructor id="_28" name="AllNamespaces" context="_13" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1"/>
  <Field id="_29" name="isa" type="_47" context="_16" access="public" offset="0"/>
  <Field id="_30" name="flags" type="_48" context="_16" access="public" offset="64"/>
  <Field id="_31" name="str" type="_49" context="_16" access="public" offset="128"/>
  <Field id="_32" name="length" type="_50" context="_16" access="public" offset="192"/>
  <Field id="_34" name="x" type="_48" context="_19" access="public" location="f1:5" file="f1" line="5" offset="0"/>
  <Constructor id="_35" name="A" context="_19" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Constructor id="_36" name="A" context="_19" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1">
    <Argument type="_51" location="f1:4" file="f1" line="4"/>
  </Constructor>
  <OperatorMethod id="_37" name="=" returns="_52" context="_19" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1" mangled="??4A@TopLevel@@QEAAAEAU01@AEBU01@@Z">
    <Argument type="_51" location="f1:4" file="f1" line="4"/>
  </OperatorMethod>
  <Destructor id="_38" name="A" context="_19" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Struct id="_39" name="B" context="_20" location="f1:11" file="f1" line="11" members="_53 _54 _55 _56 _57" size="32" align="32"/>
  <Field id="_40" name="z" type="_58" context="_21" access="public" location="f1:19" file="f1" line="19" offset="0"/>
  <Constructor id="_41" name="C" context="_21" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Constructor id="_42" name="C" context="_21" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1">
    <Argument type="_59" location="f1:18" file="f1" line="18"/>
  </Constructor>
  <OperatorMethod id="_43" name="=" returns="_60" context="_21" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1" mangled="??4C@?A0xC96414C9@@QEAAAEAU0?A0xC96414C9@@AEBU0?A0xC96414C9@@@Z">
    <Argument type="_59" location="f1:18" file="f1" line="18"/>
  </OperatorMethod>
  <Destructor id="_44" name="C" context="_21" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <ReferenceType id="_45" type="_13c" size="64" align="64"/>
  <CvQualifiedType id="_13c" type="_13" const="1"/>
  <ReferenceType id="_46" type="_13" size="64" align="64"/>
  <PointerType id="_47" type="_48c" size="64" align="64"/>
  <FundamentalType id="_48" name="int" size="32" align="32"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <PointerType id="_49" type="_33c" size="64" align="64"/>
  <CvQualifiedType id="_33c" type="_33" const="1"/>
  <FundamentalType id="_50" name="long int" size="32" align="32"/>
  <ReferenceType id="_51" type="_19c" size="64" align="64"/>
  <CvQualifiedType id="_19c" type="_19" const="1"/>
  <ReferenceType id="_52" type="_19" size="64" align="64"/>
  <Field id="_53" name="y" type="_61" context="_39" access="public" location="f1:12" file="f1" line="12" offset="0"/>
  <Constructor id="_54" name="B" context="_39" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Constructor id="_55" name="B" context="_39" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1">
    <Argument type="_62" location="f1:11" file="f1" line="11"/>
  </Constructor>
  <OperatorMethod id="_56" name="=" returns="_63" context="_39" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1" mangled="??4B@Inner@Outer@@QEAAAEAU012@AEBU012@@Z">
    <Argument type="_62" location="f1:11" file="f1" line="11"/>
  </OperatorMethod>
  <Destructor id="_57" name="B" context="_39" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <FundamentalType id="_58" name="double" size="64" align="64"/>
  <ReferenceType id="_59" type="_21c" size="64" align="64"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <ReferenceType id="_60" type="_21" size="64" align="64"/>
  <FundamentalType id="_61" name="float" size="32" align="32"/>
  <ReferenceType id="_62" type="_39c" size="64" align="64"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <ReferenceType id="_63" type="_39" size="64" align="64"/>
  <FundamentalType id="_33" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\namespaces.h"/>
</CastXML>
