<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="A" context="_1" location="f1:1" file="f1" line="1" members="_15 _16 _17 _18 _19" size="32" align="32"/>
  <Struct id="_8" name="B" context="_1" location="f1:6" file="f1" line="6" members="_20 _21 _22 _23 _24 _25 _26 _27 _28 _29" size="55104" align="32"/>
  <Function id="_9" name="__builtin_memcpy" returns="_30" context="_1" location="f1:6" file="f1" line="6" extern="1" artificial="1" mangled="_Z16__builtin_memcpy">
    <Argument type="_30"/>
    <Argument type="_31"/>
    <Argument type="_32"/>
  </Function>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_33 _34 _35 _36" size="256" align="64"/>
  <PointerType id="_13" type="_37" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_38"/>
  <Field id="_15" name="a" type="_39" context="_7" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Constructor id="_16" name="A" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_17" name="A" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_40" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_18" name="=" returns="_41" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN1AaSERKS_">
    <Argument type="_40" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_19" name="A" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_20" name="s" type="_42" context="_8" access="public" location="f1:8" file="f1" line="8" offset="0"/>
  <Field id="_21" name="a" type="_43" context="_8" access="public" location="f1:9" file="f1" line="9" offset="64"/>
  <Field id="_22" name="b" type="_44" context="_8" access="public" location="f1:10" file="f1" line="10" offset="384"/>
  <Field id="_23" name="c" type="_45" context="_8" access="public" location="f1:11" file="f1" line="11" offset="576"/>
  <Field id="_24" name="d" type="_46" context="_8" access="public" location="f1:12" file="f1" line="12" offset="1344"/>
  <Field id="_25" name="e" type="_47" context="_8" access="public" location="f1:13" file="f1" line="13" offset="55104"/>
  <Constructor id="_26" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Constructor id="_27" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1">
    <Argument type="_48" location="f1:6" file="f1" line="6"/>
  </Constructor>
  <OperatorMethod id="_28" name="=" returns="_49" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" mangled="_ZN1BaSERKS_">
    <Argument type="_48" location="f1:6" file="f1" line="6"/>
  </OperatorMethod>
  <Destructor id="_29" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <PointerType id="_30" type="_50" size="64" align="64"/>
  <PointerType id="_31" type="_50c" size="64" align="64"/>
  <FundamentalType id="_32" name="long unsigned int" size="64" align="64"/>
  <Field id="_33" name="isa" type="_51" context="_12" access="public" offset="0"/>
  <Field id="_34" name="flags" type="_39" context="_12" access="public" offset="64"/>
  <Field id="_35" name="str" type="_52" context="_12" access="public" offset="128"/>
  <Field id="_36" name="length" type="_53" context="_12" access="public" offset="192"/>
  <Struct id="_38" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_54 _55 _56 _57" size="192" align="64"/>
  <FundamentalType id="_39" name="int" size="32" align="32"/>
  <ReferenceType id="_40" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_41" type="_7" size="64" align="64"/>
  <ArrayType id="_42" min="0" max="1" type="_7"/>
  <ArrayType id="_43" min="0" max="9" type="_39"/>
  <ArrayType id="_44" min="0" max="1" type="_58"/>
  <ArrayType id="_45" min="0" max="1" type="_59"/>
  <ArrayType id="_46" min="0" max="4" type="_60"/>
  <ArrayType id="_47" min="0" max="-1" type="_39"/>
  <ReferenceType id="_48" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_49" type="_8" size="64" align="64"/>
  <CvQualifiedType id="_50c" type="_50" const="1"/>
  <PointerType id="_51" type="_39c" size="64" align="64"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <PointerType id="_52" type="_37c" size="64" align="64"/>
  <CvQualifiedType id="_37c" type="_37" const="1"/>
  <FundamentalType id="_53" name="long int" size="64" align="64"/>
  <Field id="_54" name="gp_offset" type="_61" context="_38" access="public" offset="0"/>
  <Field id="_55" name="fp_offset" type="_61" context="_38" access="public" offset="32"/>
  <Field id="_56" name="overflow_arg_area" type="_30" context="_38" access="public" offset="64"/>
  <Field id="_57" name="reg_save_area" type="_30" context="_38" access="public" offset="128"/>
  <ArrayType id="_58" min="0" max="2" type="_39"/>
  <ArrayType id="_59" min="0" max="2" type="_62"/>
  <ArrayType id="_60" min="0" max="5" type="_63"/>
  <FundamentalType id="_61" name="unsigned int" size="32" align="32"/>
  <ArrayType id="_62" min="0" max="3" type="_39"/>
  <ArrayType id="_63" min="0" max="6" type="_64"/>
  <ArrayType id="_64" min="0" max="7" type="_39"/>
  <FundamentalType id="_37" name="char" size="8" align="8"/>
  <FundamentalType id="_50" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/user/projects/castxml/headers/arrays.h"/>
</CastXML>
