<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="A" context="_1" location="f1:1" file="f1" line="1" members="_18 _19 _20 _21 _22" size="32" align="32"/>
  <Struct id="_11" name="B" context="_1" location="f1:6" file="f1" line="6" members="_23 _24 _25 _26 _27 _28 _29 _30 _31 _32" size="55104" align="32"/>
  <Function id="_12" name="__builtin_memcpy" returns="_33" context="_1" location="f1:6" file="f1" line="6" extern="1" artificial="1" mangled="?__builtin_memcpy@@9">
    <Argument type="_33"/>
    <Argument type="_34"/>
    <Argument type="_16"/>
  </Function>
  <FundamentalType id="_13" name="__int128" size="128" align="128"/>
  <FundamentalType id="_14" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_15" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_35 _36 _37 _38" size="256" align="64"/>
  <FundamentalType id="_16" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_17" type="_39" size="64" align="64"/>
  <Field id="_18" name="a" type="_40" context="_10" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Constructor id="_19" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_20" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_41" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_21" name="=" returns="_42" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="??4A@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_41" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_22" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_23" name="s" type="_43" context="_11" access="public" location="f1:8" file="f1" line="8" offset="0"/>
  <Field id="_24" name="a" type="_44" context="_11" access="public" location="f1:9" file="f1" line="9" offset="64"/>
  <Field id="_25" name="b" type="_45" context="_11" access="public" location="f1:10" file="f1" line="10" offset="384"/>
  <Field id="_26" name="c" type="_46" context="_11" access="public" location="f1:11" file="f1" line="11" offset="576"/>
  <Field id="_27" name="d" type="_47" context="_11" access="public" location="f1:12" file="f1" line="12" offset="1344"/>
  <Field id="_28" name="e" type="_48" context="_11" access="public" location="f1:13" file="f1" line="13" offset="55104"/>
  <Constructor id="_29" name="B" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Constructor id="_30" name="B" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1">
    <Argument type="_49" location="f1:6" file="f1" line="6"/>
  </Constructor>
  <OperatorMethod id="_31" name="=" returns="_50" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" mangled="??4B@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_49" location="f1:6" file="f1" line="6"/>
  </OperatorMethod>
  <Destructor id="_32" name="B" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <PointerType id="_33" type="_51" size="64" align="64"/>
  <PointerType id="_34" type="_51c" size="64" align="64"/>
  <Field id="_35" name="isa" type="_52" context="_15" access="public" offset="0"/>
  <Field id="_36" name="flags" type="_40" context="_15" access="public" offset="64"/>
  <Field id="_37" name="str" type="_53" context="_15" access="public" offset="128"/>
  <Field id="_38" name="length" type="_54" context="_15" access="public" offset="192"/>
  <FundamentalType id="_40" name="int" size="32" align="32"/>
  <ReferenceType id="_41" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_42" type="_10" size="64" align="64"/>
  <ArrayType id="_43" min="0" max="1" type="_10"/>
  <ArrayType id="_44" min="0" max="9" type="_40"/>
  <ArrayType id="_45" min="0" max="1" type="_55"/>
  <ArrayType id="_46" min="0" max="1" type="_56"/>
  <ArrayType id="_47" min="0" max="4" type="_57"/>
  <ArrayType id="_48" min="0" max="-1" type="_40"/>
  <ReferenceType id="_49" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_50" type="_11" size="64" align="64"/>
  <CvQualifiedType id="_51c" type="_51" const="1"/>
  <PointerType id="_52" type="_40c" size="64" align="64"/>
  <CvQualifiedType id="_40c" type="_40" const="1"/>
  <PointerType id="_53" type="_39c" size="64" align="64"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <FundamentalType id="_54" name="long int" size="32" align="32"/>
  <ArrayType id="_55" min="0" max="2" type="_40"/>
  <ArrayType id="_56" min="0" max="2" type="_58"/>
  <ArrayType id="_57" min="0" max="5" type="_59"/>
  <ArrayType id="_58" min="0" max="3" type="_40"/>
  <ArrayType id="_59" min="0" max="6" type="_60"/>
  <ArrayType id="_60" min="0" max="7" type="_40"/>
  <FundamentalType id="_39" name="char" size="8" align="8"/>
  <FundamentalType id="_51" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\arrays.h"/>
</CastXML>
