<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7"/>
  <Typedef id="_2" name="__int128_t" type="_8" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="AllBasicTypes" context="_1" location="f1:1" file="f1" line="1" members="_13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31" size="640" align="128"/>
  <FundamentalType id="_8" name="__int128" size="128" align="128"/>
  <FundamentalType id="_9" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_10" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_32 _33 _34 _35" size="256" align="64"/>
  <PointerType id="_11" type="_36" size="64" align="64"/>
  <ArrayType id="_12" min="0" max="0" type="_37"/>
  <Field id="_13" name="b" type="_38" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Field id="_14" name="c" type="_36" context="_7" access="public" location="f1:3" file="f1" line="3" offset="8"/>
  <Field id="_15" name="sc" type="_39" context="_7" access="public" location="f1:4" file="f1" line="4" offset="16"/>
  <Field id="_16" name="uc" type="_40" context="_7" access="public" location="f1:5" file="f1" line="5" offset="24"/>
  <Field id="_17" name="s" type="_41" context="_7" access="public" location="f1:6" file="f1" line="6" offset="32"/>
  <Field id="_18" name="us" type="_42" context="_7" access="public" location="f1:7" file="f1" line="7" offset="48"/>
  <Field id="_19" name="i" type="_43" context="_7" access="public" location="f1:8" file="f1" line="8" offset="64"/>
  <Field id="_20" name="ui" type="_44" context="_7" access="public" location="f1:9" file="f1" line="9" offset="96"/>
  <Field id="_21" name="l" type="_45" context="_7" access="public" location="f1:10" file="f1" line="10" offset="128"/>
  <Field id="_22" name="ul" type="_46" context="_7" access="public" location="f1:11" file="f1" line="11" offset="192"/>
  <Field id="_23" name="ll" type="_47" context="_7" access="public" location="f1:12" file="f1" line="12" offset="256"/>
  <Field id="_24" name="ull" type="_48" context="_7" access="public" location="f1:13" file="f1" line="13" offset="320"/>
  <Field id="_25" name="f" type="_49" context="_7" access="public" location="f1:14" file="f1" line="14" offset="384"/>
  <Field id="_26" name="d" type="_50" context="_7" access="public" location="f1:15" file="f1" line="15" offset="448"/>
  <Field id="_27" name="ld" type="_51" context="_7" access="public" location="f1:16" file="f1" line="16" offset="512"/>
  <Constructor id="_28" name="AllBasicTypes" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_29" name="AllBasicTypes" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_52" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_30" name="=" returns="_53" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN13AllBasicTypesaSERKS_">
    <Argument type="_52" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_31" name="AllBasicTypes" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_32" name="isa" type="_54" context="_10" access="public" offset="0"/>
  <Field id="_33" name="flags" type="_43" context="_10" access="public" offset="64"/>
  <Field id="_34" name="str" type="_55" context="_10" access="public" offset="128"/>
  <Field id="_35" name="length" type="_45" context="_10" access="public" offset="192"/>
  <FundamentalType id="_36" name="char" size="8" align="8"/>
  <Struct id="_37" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_56 _57 _58 _59" size="192" align="64"/>
  <FundamentalType id="_38" name="bool" size="8" align="8"/>
  <FundamentalType id="_39" name="signed char" size="8" align="8"/>
  <FundamentalType id="_40" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_41" name="short int" size="16" align="16"/>
  <FundamentalType id="_42" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_43" name="int" size="32" align="32"/>
  <FundamentalType id="_44" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_45" name="long int" size="64" align="64"/>
  <FundamentalType id="_46" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_47" name="long long int" size="64" align="64"/>
  <FundamentalType id="_48" name="long long unsigned int" size="64" align="64"/>
  <FundamentalType id="_49" name="float" size="32" align="32"/>
  <FundamentalType id="_50" name="double" size="64" align="64"/>
  <FundamentalType id="_51" name="long double" size="128" align="128"/>
  <ReferenceType id="_52" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_53" type="_7" size="64" align="64"/>
  <PointerType id="_54" type="_43c" size="64" align="64"/>
  <CvQualifiedType id="_43c" type="_43" const="1"/>
  <PointerType id="_55" type="_36c" size="64" align="64"/>
  <CvQualifiedType id="_36c" type="_36" const="1"/>
  <Field id="_56" name="gp_offset" type="_44" context="_37" access="public" offset="0"/>
  <Field id="_57" name="fp_offset" type="_44" context="_37" access="public" offset="32"/>
  <Field id="_58" name="overflow_arg_area" type="_60" context="_37" access="public" offset="64"/>
  <Field id="_59" name="reg_save_area" type="_60" context="_37" access="public" offset="128"/>
  <PointerType id="_60" type="_61" size="64" align="64"/>
  <FundamentalType id="_61" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/user/projects/castxml/headers/basic_types.h"/>
</CastXML>
