<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="AllBasicTypes" context="_1" location="f1:1" file="f1" line="1" members="_16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34" size="512" align="64"/>
  <FundamentalType id="_11" name="__int128" size="128" align="128"/>
  <FundamentalType id="_12" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_13" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_35 _36 _37 _38" size="256" align="64"/>
  <FundamentalType id="_14" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_15" type="_39" size="64" align="64"/>
  <Field id="_16" name="b" type="_40" context="_10" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Field id="_17" name="c" type="_39" context="_10" access="public" location="f1:3" file="f1" line="3" offset="8"/>
  <Field id="_18" name="sc" type="_41" context="_10" access="public" location="f1:4" file="f1" line="4" offset="16"/>
  <Field id="_19" name="uc" type="_42" context="_10" access="public" location="f1:5" file="f1" line="5" offset="24"/>
  <Field id="_20" name="s" type="_43" context="_10" access="public" location="f1:6" file="f1" line="6" offset="32"/>
  <Field id="_21" name="us" type="_44" context="_10" access="public" location="f1:7" file="f1" line="7" offset="48"/>
  <Field id="_22" name="i" type="_45" context="_10" access="public" location="f1:8" file="f1" line="8" offset="64"/>
  <Field id="_23" name="ui" type="_46" context="_10" access="public" location="f1:9" file="f1" line="9" offset="96"/>
  <Field id="_24" name="l" type="_47" context="_10" access="public" location="f1:10" file="f1" line="10" offset="128"/>
  <Field id="_25" name="ul" type="_48" context="_10" access="public" location="f1:11" file="f1" line="11" offset="160"/>
  <Field id="_26" name="ll" type="_49" context="_10" access="public" location="f1:12" file="f1" line="12" offset="192"/>
  <Field id="_27" name="ull" type="_14" context="_10" access="public" location="f1:13" file="f1" line="13" offset="256"/>
  <Field id="_28" name="f" type="_50" context="_10" access="public" location="f1:14" file="f1" line="14" offset="320"/>
  <Field id="_29" name="d" type="_51" context="_10" access="public" location="f1:15" file="f1" line="15" offset="384"/>
  <Field id="_30" name="ld" type="_52" context="_10" access="public" location="f1:16" file="f1" line="16" offset="448"/>
  <Constructor id="_31" name="AllBasicTypes" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_32" name="AllBasicTypes" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_53" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_33" name="=" returns="_54" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="??4AllBasicTypes@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_53" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_34" name="AllBasicTypes" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_35" name="isa" type="_55" context="_13" access="public" offset="0"/>
  <Field id="_36" name="flags" type="_45" context="_13" access="public" offset="64"/>
  <Field id="_37" name="str" type="_56" context="_13" access="public" offset="128"/>
  <Field id="_38" name="length" type="_47" context="_13" access="public" offset="192"/>
  <FundamentalType id="_39" name="char" size="8" align="8"/>
  <FundamentalType id="_40" name="bool" size="8" align="8"/>
  <FundamentalType id="_41" name="signed char" size="8" align="8"/>
  <FundamentalType id="_42" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_43" name="short int" size="16" align="16"/>
  <FundamentalType id="_44" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_45" name="int" size="32" align="32"/>
  <FundamentalType id="_46" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_47" name="long int" size="32" align="32"/>
  <FundamentalType id="_48" name="long unsigned int" size="32" align="32"/>
  <FundamentalType id="_49" name="long long int" size="64" align="64"/>
  <FundamentalType id="_50" name="float" size="32" align="32"/>
  <FundamentalType id="_51" name="double" size="64" align="64"/>
  <FundamentalType id="_52" name="long double" size="64" align="64"/>
  <ReferenceType id="_53" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_54" type="_10" size="64" align="64"/>
  <PointerType id="_55" type="_45c" size="64" align="64"/>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <PointerType id="_56" type="_39c" size="64" align="64"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\basic_types.h"/>
</CastXML>
