<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11"/>
  <Typedef id="_2" name="__int128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="StatusFlags" context="_1" location="f1:2" file="f1" line="2" members="_17 _18 _19 _20 _21 _22 _23" size="32" align="32"/>
  <Struct id="_8" name="ControlRegister" context="_1" location="f1:9" file="f1" line="9" members="_24 _25 _26 _27 _28 _29 _30 _31" size="32" align="32"/>
  <Struct id="_9" name="Packed32" context="_1" location="f1:17" file="f1" line="17" members="_32 _33 _34 _35 _36 _37 _38 _39" size="32" align="32"/>
  <Struct id="_10" name="Nested" context="_1" location="f1:25" file="f1" line="25" members="_40 _41 _42 _43 _44 _45 _46" size="64" align="32"/>
  <Struct id="_11" name="Flat" context="_1" location="f1:34" file="f1" line="34" members="_47 _48 _49 _50 _51 _52 _53 _54 _55 _56" size="64" align="32"/>
  <FundamentalType id="_12" name="__int128" size="128" align="128"/>
  <FundamentalType id="_13" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_14" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_57 _58 _59 _60" size="256" align="64"/>
  <PointerType id="_15" type="_61" size="64" align="64"/>
  <ArrayType id="_16" min="0" max="0" type="_62"/>
  <Field id="_17" name="ready" type="_63" bits="1" context="_7" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_18" name="error" type="_63" bits="1" context="_7" access="public" location="f1:4" file="f1" line="4" offset="1"/>
  <Field id="_19" name="reserved" type="_63" bits="6" context="_7" access="public" location="f1:5" file="f1" line="5" offset="2"/>
  <Constructor id="_20" name="StatusFlags" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Constructor id="_21" name="StatusFlags" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1">
    <Argument type="_64" location="f1:2" file="f1" line="2"/>
  </Constructor>
  <OperatorMethod id="_22" name="=" returns="_65" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1" mangled="_ZN11StatusFlagsaSERKS_">
    <Argument type="_64" location="f1:2" file="f1" line="2"/>
  </OperatorMethod>
  <Destructor id="_23" name="StatusFlags" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Field id="_24" name="mode" type="_63" bits="3" context="_8" access="public" location="f1:10" file="f1" line="10" offset="0"/>
  <Field id="_25" name="speed" type="_66" bits="5" context="_8" access="public" location="f1:11" file="f1" line="11" offset="3"/>
  <Field id="_26" name="enable" type="_63" bits="1" context="_8" access="public" location="f1:12" file="f1" line="12" offset="8"/>
  <Field id="_27" name="reserved" type="_63" bits="23" context="_8" access="public" location="f1:13" file="f1" line="13" offset="9"/>
  <Constructor id="_28" name="ControlRegister" context="_8" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Constructor id="_29" name="ControlRegister" context="_8" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1">
    <Argument type="_67" location="f1:9" file="f1" line="9"/>
  </Constructor>
  <OperatorMethod id="_30" name="=" returns="_68" context="_8" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1" mangled="_ZN15ControlRegisteraSERKS_">
    <Argument type="_67" location="f1:9" file="f1" line="9"/>
  </OperatorMethod>
  <Destructor id="_31" name="ControlRegister" context="_8" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Field id="_32" name="a" type="_63" bits="8" context="_9" access="public" location="f1:18" file="f1" line="18" offset="0"/>
  <Field id="_33" name="b" type="_63" bits="8" context="_9" access="public" location="f1:19" file="f1" line="19" offset="8"/>
  <Field id="_34" name="c" type="_63" bits="8" context="_9" access="public" location="f1:20" file="f1" line="20" offset="16"/>
  <Field id="_35" name="d" type="_63" bits="8" context="_9" access="public" location="f1:21" file="f1" line="21" offset="24"/>
  <Constructor id="_36" name="Packed32" context="_9" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <Constructor id="_37" name="Packed32" context="_9" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1">
    <Argument type="_69" location="f1:17" file="f1" line="17"/>
  </Constructor>
  <OperatorMethod id="_38" name="=" returns="_70" context="_9" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1" mangled="_ZN8Packed32aSERKS_">
    <Argument type="_69" location="f1:17" file="f1" line="17"/>
  </OperatorMethod>
  <Destructor id="_39" name="Packed32" context="_9" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <Field id="_40" name="outer" type="_63" bits="4" context="_10" access="public" location="f1:26" file="f1" line="26" offset="0"/>
  <Struct id="_41" name="" context="_10" access="public" location="f1:27" file="f1" line="27" members="_71 _72 _73 _74 _75 _76" size="32" align="32"/>
  <Field id="_42" name="inner" type="_77" context="_10" access="public" location="f1:30" file="f1" line="30" offset="32"/>
  <Constructor id="_43" name="Nested" context="_10" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1"/>
  <Constructor id="_44" name="Nested" context="_10" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1">
    <Argument type="_78" location="f1:25" file="f1" line="25"/>
  </Constructor>
  <OperatorMethod id="_45" name="=" returns="_79" context="_10" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1" mangled="_ZN6NestedaSERKS_">
    <Argument type="_78" location="f1:25" file="f1" line="25"/>
  </OperatorMethod>
  <Destructor id="_46" name="Nested" context="_10" access="public" location="f1:25" file="f1" line="25" inline="1" artificial="1"/>
  <Field id="_47" name="top" type="_63" bits="4" context="_11" access="public" location="f1:35" file="f1" line="35" offset="0"/>
  <Union id="_48" context="_11" access="public" location="f1:36" file="f1" line="36" members="_80 _81 _82 _83 _84 _85 _86 _87 _88" size="32" align="32"/>
  <Field id="_49" name="" type="_48" context="_11" access="public" location="f1:36" file="f1" line="36" offset="32"/>
  <Unimplemented id="_50" kind="IndirectField"/>
  <Unimplemented id="_51" kind="IndirectField"/>
  <Unimplemented id="_52" kind="IndirectField"/>
  <Constructor id="_53" name="Flat" context="_11" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1"/>
  <Constructor id="_54" name="Flat" context="_11" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1">
    <Argument type="_89" location="f1:34" file="f1" line="34"/>
  </Constructor>
  <OperatorMethod id="_55" name="=" returns="_90" context="_11" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1" mangled="_ZN4FlataSERKS_">
    <Argument type="_89" location="f1:34" file="f1" line="34"/>
  </OperatorMethod>
  <Destructor id="_56" name="Flat" context="_11" access="public" location="f1:34" file="f1" line="34" inline="1" artificial="1"/>
  <Field id="_57" name="isa" type="_91" context="_14" access="public" offset="0"/>
  <Field id="_58" name="flags" type="_66" context="_14" access="public" offset="64"/>
  <Field id="_59" name="str" type="_92" context="_14" access="public" offset="128"/>
  <Field id="_60" name="length" type="_93" context="_14" access="public" offset="192"/>
  <Struct id="_62" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_94 _95 _96 _97" size="192" align="64"/>
  <FundamentalType id="_63" name="unsigned int" size="32" align="32"/>
  <ReferenceType id="_64" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_65" type="_7" size="64" align="64"/>
  <FundamentalType id="_66" name="int" size="32" align="32"/>
  <ReferenceType id="_67" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_68" type="_8" size="64" align="64"/>
  <ReferenceType id="_69" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_70" type="_9" size="64" align="64"/>
  <Field id="_71" name="inner1" type="_63" bits="2" context="_41" access="public" location="f1:28" file="f1" line="28" offset="0"/>
  <Field id="_72" name="inner2" type="_63" bits="6" context="_41" access="public" location="f1:29" file="f1" line="29" offset="2"/>
  <Constructor id="_73" name="" context="_41" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Constructor id="_74" name="" context="_41" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1">
    <Argument type="_98" location="f1:27" file="f1" line="27"/>
  </Constructor>
  <OperatorMethod id="_75" name="=" returns="_99" context="_41" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1" mangled="_ZN6NestedUt_aSERKS0_">
    <Argument type="_98" location="f1:27" file="f1" line="27"/>
  </OperatorMethod>
  <Destructor id="_76" name="" context="_41" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <ElaboratedType id="_77" type="_41"/>
  <ReferenceType id="_78" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_79" type="_10" size="64" align="64"/>
  <Struct id="_80" context="_48" access="public" location="f1:37" file="f1" line="37" members="_100 _101 _102 _103 _104 _105" size="32" align="32"/>
  <Field id="_81" name="" type="_80" context="_48" access="public" location="f1:37" file="f1" line="37" offset="0"/>
  <Unimplemented id="_82" kind="IndirectField"/>
  <Unimplemented id="_83" kind="IndirectField"/>
  <Field id="_84" name="raw" type="_63" bits="8" context="_48" access="public" location="f1:41" file="f1" line="41" offset="0"/>
  <Constructor id="_85" name="" context="_48" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1"/>
  <Constructor id="_86" name="" context="_48" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1">
    <Argument type="_106" location="f1:36" file="f1" line="36"/>
  </Constructor>
  <OperatorMethod id="_87" name="=" returns="_107" context="_48" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1" mangled="_ZN4FlatUt_aSERKS0_">
    <Argument type="_106" location="f1:36" file="f1" line="36"/>
  </OperatorMethod>
  <Destructor id="_88" name="" context="_48" access="public" location="f1:36" file="f1" line="36" inline="1" artificial="1"/>
  <ReferenceType id="_89" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_90" type="_11" size="64" align="64"/>
  <PointerType id="_91" type="_66c" size="64" align="64"/>
  <CvQualifiedType id="_66c" type="_66" const="1"/>
  <PointerType id="_92" type="_61c" size="64" align="64"/>
  <CvQualifiedType id="_61c" type="_61" const="1"/>
  <FundamentalType id="_93" name="long int" size="64" align="64"/>
  <Field id="_94" name="gp_offset" type="_63" context="_62" access="public" offset="0"/>
  <Field id="_95" name="fp_offset" type="_63" context="_62" access="public" offset="32"/>
  <Field id="_96" name="overflow_arg_area" type="_108" context="_62" access="public" offset="64"/>
  <Field id="_97" name="reg_save_area" type="_108" context="_62" access="public" offset="128"/>
  <ReferenceType id="_98" type="_41c" size="64" align="64"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <ReferenceType id="_99" type="_41" size="64" align="64"/>
  <Field id="_100" name="u1" type="_63" bits="3" context="_80" access="public" location="f1:38" file="f1" line="38" offset="0"/>
  <Field id="_101" name="u2" type="_63" bits="5" context="_80" access="public" location="f1:39" file="f1" line="39" offset="3"/>
  <Constructor id="_102" name="" context="_80" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1"/>
  <Constructor id="_103" name="" context="_80" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1">
    <Argument type="_109" location="f1:37" file="f1" line="37"/>
  </Constructor>
  <OperatorMethod id="_104" name="=" returns="_110" context="_80" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1" mangled="_ZN4FlatUt_Ut_aSERKS1_">
    <Argument type="_109" location="f1:37" file="f1" line="37"/>
  </OperatorMethod>
  <Destructor id="_105" name="" context="_80" access="public" location="f1:37" file="f1" line="37" inline="1" artificial="1"/>
  <ReferenceType id="_106" type="_48c" size="64" align="64"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <ReferenceType id="_107" type="_48" size="64" align="64"/>
  <PointerType id="_108" type="_111" size="64" align="64"/>
  <ReferenceType id="_109" type="_80c" size="64" align="64"/>
  <CvQualifiedType id="_80c" type="_80" const="1"/>
  <ReferenceType id="_110" type="_80" size="64" align="64"/>
  <FundamentalType id="_61" name="char" size="8" align="8"/>
  <FundamentalType id="_111" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/bitfields.h"/>
</CastXML>
