<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8"/>
  <Typedef id="_2" name="__int128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Namespace id="_7" name="Alpha" context="_1" members="_14"/>
  <Namespace id="_8" name="Beta" context="_1" members="_15 _16"/>
  <FundamentalType id="_9" name="__int128" size="128" align="128"/>
  <FundamentalType id="_10" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_11" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_17 _18 _19 _20" size="256" align="64"/>
  <PointerType id="_12" type="_21" size="64" align="64"/>
  <ArrayType id="_13" min="0" max="0" type="_22"/>
  <Struct id="_14" name="Data" context="_7" location="f1:4" file="f1" line="4" members="_23 _24 _25 _26 _27" size="32" align="32"/>
  <Struct id="_15" name="Data" context="_8" location="f1:10" file="f1" line="10" members="_28 _29 _30 _31 _32" size="32" align="32"/>
  <Struct id="_16" name="Extra" context="_8" location="f1:14" file="f1" line="14" members="_33 _34 _35 _36 _37" size="8" align="8"/>
  <Field id="_17" name="isa" type="_38" context="_11" access="public" offset="0"/>
  <Field id="_18" name="flags" type="_39" context="_11" access="public" offset="64"/>
  <Field id="_19" name="str" type="_40" context="_11" access="public" offset="128"/>
  <Field id="_20" name="length" type="_41" context="_11" access="public" offset="192"/>
  <Struct id="_22" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_42 _43 _44 _45" size="192" align="64"/>
  <Field id="_23" name="x" type="_39" context="_14" access="public" location="f1:5" file="f1" line="5" offset="0"/>
  <Constructor id="_24" name="Data" context="_14" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Constructor id="_25" name="Data" context="_14" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1">
    <Argument type="_46" location="f1:4" file="f1" line="4"/>
  </Constructor>
  <OperatorMethod id="_26" name="=" returns="_47" context="_14" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1" mangled="_ZN5Alpha4DataaSERKS0_">
    <Argument type="_46" location="f1:4" file="f1" line="4"/>
  </OperatorMethod>
  <Destructor id="_27" name="Data" context="_14" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Field id="_28" name="y" type="_48" context="_15" access="public" location="f1:11" file="f1" line="11" offset="0"/>
  <Constructor id="_29" name="Data" context="_15" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1"/>
  <Constructor id="_30" name="Data" context="_15" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1">
    <Argument type="_49" location="f1:10" file="f1" line="10"/>
  </Constructor>
  <OperatorMethod id="_31" name="=" returns="_50" context="_15" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1" mangled="_ZN4Beta4DataaSERKS0_">
    <Argument type="_49" location="f1:10" file="f1" line="10"/>
  </OperatorMethod>
  <Destructor id="_32" name="Data" context="_15" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1"/>
  <Field id="_33" name="z" type="_21" context="_16" access="public" location="f1:15" file="f1" line="15" offset="0"/>
  <FundamentalType id="_21" name="char" size="8" align="8"/>
  <Constructor id="_34" name="Extra" context="_16" access="public" location="f1:14" file="f1" line="14" inline="1" artificial="1"/>
  <Constructor id="_35" name="Extra" context="_16" access="public" location="f1:14" file="f1" line="14" inline="1" artificial="1">
    <Argument type="_51" location="f1:14" file="f1" line="14"/>
  </Constructor>
  <OperatorMethod id="_36" name="=" returns="_52" context="_16" access="public" location="f1:14" file="f1" line="14" inline="1" artificial="1" mangled="_ZN4Beta5ExtraaSERKS0_">
    <Argument type="_51" location="f1:14" file="f1" line="14"/>
  </OperatorMethod>
  <Destructor id="_37" name="Extra" context="_16" access="public" location="f1:14" file="f1" line="14" inline="1" artificial="1"/>
  <PointerType id="_38" type="_39c" size="64" align="64"/>
  <FundamentalType id="_39" name="int" size="32" align="32"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <PointerType id="_40" type="_21c" size="64" align="64"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <FundamentalType id="_41" name="long int" size="64" align="64"/>
  <Field id="_42" name="gp_offset" type="_53" context="_22" access="public" offset="0"/>
  <Field id="_43" name="fp_offset" type="_53" context="_22" access="public" offset="32"/>
  <Field id="_44" name="overflow_arg_area" type="_54" context="_22" access="public" offset="64"/>
  <Field id="_45" name="reg_save_area" type="_54" context="_22" access="public" offset="128"/>
  <ReferenceType id="_46" type="_14c" size="64" align="64"/>
  <CvQualifiedType id="_14c" type="_14" const="1"/>
  <ReferenceType id="_47" type="_14" size="64" align="64"/>
  <FundamentalType id="_48" name="float" size="32" align="32"/>
  <ReferenceType id="_49" type="_15c" size="64" align="64"/>
  <CvQualifiedType id="_15c" type="_15" const="1"/>
  <ReferenceType id="_50" type="_15" size="64" align="64"/>
  <ReferenceType id="_51" type="_16c" size="64" align="64"/>
  <CvQualifiedType id="_16c" type="_16" const="1"/>
  <ReferenceType id="_52" type="_16" size="64" align="64"/>
  <FundamentalType id="_53" name="unsigned int" size="32" align="32"/>
  <PointerType id="_54" type="_55" size="64" align="64"/>
  <FundamentalType id="_55" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/namespaced_types.h"/>
</CastXML>
