<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10"/>
  <Typedef id="_2" name="__int128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Namespace id="_7" name="TopLevel" context="_1" members="_16"/>
  <Namespace id="_8" name="Outer" context="_1" members="_17"/>
  <Namespace id="_9" context="_1" members="_18"/>
  <Struct id="_10" name="AllNamespaces" context="_1" location="f1:24" file="f1" line="24" members="_19 _20 _21 _22 _23 _24 _25" size="128" align="64"/>
  <FundamentalType id="_11" name="__int128" size="128" align="128"/>
  <FundamentalType id="_12" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_13" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_26 _27 _28 _29" size="256" align="64"/>
  <PointerType id="_14" type="_30" size="64" align="64"/>
  <ArrayType id="_15" min="0" max="0" type="_31"/>
  <Struct id="_16" name="A" context="_7" location="f1:4" file="f1" line="4" members="_32 _33 _34 _35 _36" size="32" align="32"/>
  <Namespace id="_17" name="Inner" context="_8" members="_37"/>
  <Struct id="_18" name="C" context="_9" location="f1:18" file="f1" line="18" members="_38 _39 _40 _41 _42" size="64" align="64"/>
  <Field id="_19" name="a" type="_16" context="_10" access="public" location="f1:25" file="f1" line="25" offset="0"/>
  <Field id="_20" name="b" type="_37" context="_10" access="public" location="f1:26" file="f1" line="26" offset="32"/>
  <Field id="_21" name="c" type="_18" context="_10" access="public" location="f1:27" file="f1" line="27" offset="64"/>
  <Constructor id="_22" name="AllNamespaces" context="_10" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1"/>
  <Constructor id="_23" name="AllNamespaces" context="_10" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1">
    <Argument type="_43" location="f1:24" file="f1" line="24"/>
  </Constructor>
  <OperatorMethod id="_24" name="=" returns="_44" context="_10" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1" mangled="_ZN13AllNamespacesaSERKS_">
    <Argument type="_43" location="f1:24" file="f1" line="24"/>
  </OperatorMethod>
  <Destructor id="_25" name="AllNamespaces" context="_10" access="public" location="f1:24" file="f1" line="24" inline="1" artificial="1"/>
  <Field id="_26" name="isa" type="_45" context="_13" access="public" offset="0"/>
  <Field id="_27" name="flags" type="_46" context="_13" access="public" offset="64"/>
  <Field id="_28" name="str" type="_47" context="_13" access="public" offset="128"/>
  <Field id="_29" name="length" type="_48" context="_13" access="public" offset="192"/>
  <Struct id="_31" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_49 _50 _51 _52" size="192" align="64"/>
  <Field id="_32" name="x" type="_46" context="_16" access="public" location="f1:5" file="f1" line="5" offset="0"/>
  <Constructor id="_33" name="A" context="_16" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Constructor id="_34" name="A" context="_16" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1">
    <Argument type="_53" location="f1:4" file="f1" line="4"/>
  </Constructor>
  <OperatorMethod id="_35" name="=" returns="_54" context="_16" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1" mangled="_ZN8TopLevel1AaSERKS0_">
    <Argument type="_53" location="f1:4" file="f1" line="4"/>
  </OperatorMethod>
  <Destructor id="_36" name="A" context="_16" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Struct id="_37" name="B" context="_17" location="f1:11" file="f1" line="11" members="_55 _56 _57 _58 _59" size="32" align="32"/>
  <Field id="_38" name="z" type="_60" context="_18" access="public" location="f1:19" file="f1" line="19" offset="0"/>
  <Constructor id="_39" name="C" context="_18" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Constructor id="_40" name="C" context="_18" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1">
    <Argument type="_61" location="f1:18" file="f1" line="18"/>
  </Constructor>
  <OperatorMethod id="_41" name="=" returns="_62" context="_18" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1" mangled="_ZN12_GLOBAL__N_11CaSERKS0_">
    <Argument type="_61" location="f1:18" file="f1" line="18"/>
  </OperatorMethod>
  <Destructor id="_42" name="C" context="_18" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <ReferenceType id="_43" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_44" type="_10" size="64" align="64"/>
  <PointerType id="_45" type="_46c" size="64" align="64"/>
  <FundamentalType id="_46" name="int" size="32" align="32"/>
  <CvQualifiedType id="_46c" type="_46" const="1"/>
  <PointerType id="_47" type="_30c" size="64" align="64"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <FundamentalType id="_48" name="long int" size="64" align="64"/>
  <Field id="_49" name="gp_offset" type="_63" context="_31" access="public" offset="0"/>
  <Field id="_50" name="fp_offset" type="_63" context="_31" access="public" offset="32"/>
  <Field id="_51" name="overflow_arg_area" type="_64" context="_31" access="public" offset="64"/>
  <Field id="_52" name="reg_save_area" type="_64" context="_31" access="public" offset="128"/>
  <ReferenceType id="_53" type="_16c" size="64" align="64"/>
  <CvQualifiedType id="_16c" type="_16" const="1"/>
  <ReferenceType id="_54" type="_16" size="64" align="64"/>
  <Field id="_55" name="y" type="_65" context="_37" access="public" location="f1:12" file="f1" line="12" offset="0"/>
  <Constructor id="_56" name="B" context="_37" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Constructor id="_57" name="B" context="_37" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1">
    <Argument type="_66" location="f1:11" file="f1" line="11"/>
  </Constructor>
  <OperatorMethod id="_58" name="=" returns="_67" context="_37" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1" mangled="_ZN5Outer5Inner1BaSERKS1_">
    <Argument type="_66" location="f1:11" file="f1" line="11"/>
  </OperatorMethod>
  <Destructor id="_59" name="B" context="_37" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <FundamentalType id="_60" name="double" size="64" align="64"/>
  <ReferenceType id="_61" type="_18c" size="64" align="64"/>
  <CvQualifiedType id="_18c" type="_18" const="1"/>
  <ReferenceType id="_62" type="_18" size="64" align="64"/>
  <FundamentalType id="_63" name="unsigned int" size="32" align="32"/>
  <PointerType id="_64" type="_68" size="64" align="64"/>
  <FundamentalType id="_65" name="float" size="32" align="32"/>
  <ReferenceType id="_66" type="_37c" size="64" align="64"/>
  <CvQualifiedType id="_37c" type="_37" const="1"/>
  <ReferenceType id="_67" type="_37" size="64" align="64"/>
  <FundamentalType id="_30" name="char" size="8" align="8"/>
  <FundamentalType id="_68" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/user/projects/castxml/headers/namespaces.h"/>
</CastXML>
