<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="A" context="_1" location="f1:1" file="f1" line="1" members="_18 _19 _20 _21 _22" size="32" align="32"/>
  <Struct id="_11" name="B" context="_1" location="f1:6" file="f1" line="6" members="_23 _24 _25 _26 _27 _28" size="64" align="32"/>
  <Struct id="_12" name="C" context="_1" location="f1:12" file="f1" line="12" members="_29 _30 _31 _32 _33 _34 _35" size="128" align="32"/>
  <FundamentalType id="_13" name="__int128" size="128" align="128"/>
  <FundamentalType id="_14" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_15" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_36 _37 _38 _39" size="256" align="64"/>
  <FundamentalType id="_16" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_17" type="_40" size="64" align="64"/>
  <Field id="_18" name="a" type="_41" context="_10" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Constructor id="_19" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_20" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_42" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_21" name="=" returns="_43" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="??4A@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_42" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_22" name="A" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_23" name="a" type="_10" context="_11" access="public" location="f1:8" file="f1" line="8" offset="0"/>
  <Field id="_24" name="b" type="_41" context="_11" access="public" location="f1:9" file="f1" line="9" offset="32"/>
  <Constructor id="_25" name="B" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Constructor id="_26" name="B" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1">
    <Argument type="_44" location="f1:6" file="f1" line="6"/>
  </Constructor>
  <OperatorMethod id="_27" name="=" returns="_45" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" mangled="??4B@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_44" location="f1:6" file="f1" line="6"/>
  </OperatorMethod>
  <Destructor id="_28" name="B" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Field id="_29" name="a" type="_10" context="_12" access="public" location="f1:14" file="f1" line="14" offset="0"/>
  <Field id="_30" name="b" type="_11" context="_12" access="public" location="f1:15" file="f1" line="15" offset="32"/>
  <Field id="_31" name="c" type="_41" context="_12" access="public" location="f1:16" file="f1" line="16" offset="96"/>
  <Constructor id="_32" name="C" context="_12" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1"/>
  <Constructor id="_33" name="C" context="_12" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1">
    <Argument type="_46" location="f1:12" file="f1" line="12"/>
  </Constructor>
  <OperatorMethod id="_34" name="=" returns="_47" context="_12" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1" mangled="??4C@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_46" location="f1:12" file="f1" line="12"/>
  </OperatorMethod>
  <Destructor id="_35" name="C" context="_12" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1"/>
  <Field id="_36" name="isa" type="_48" context="_15" access="public" offset="0"/>
  <Field id="_37" name="flags" type="_41" context="_15" access="public" offset="64"/>
  <Field id="_38" name="str" type="_49" context="_15" access="public" offset="128"/>
  <Field id="_39" name="length" type="_50" context="_15" access="public" offset="192"/>
  <FundamentalType id="_41" name="int" size="32" align="32"/>
  <ReferenceType id="_42" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_43" type="_10" size="64" align="64"/>
  <ReferenceType id="_44" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_45" type="_11" size="64" align="64"/>
  <ReferenceType id="_46" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_47" type="_12" size="64" align="64"/>
  <PointerType id="_48" type="_41c" size="64" align="64"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <PointerType id="_49" type="_40c" size="64" align="64"/>
  <CvQualifiedType id="_40c" type="_40" const="1"/>
  <FundamentalType id="_50" name="long int" size="32" align="32"/>
  <FundamentalType id="_40" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\nested.h"/>
</CastXML>
