<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="A" context="_1" location="f1:1" file="f1" line="1" members="_15 _16 _17 _18 _19" size="32" align="32"/>
  <Struct id="_8" name="B" context="_1" location="f1:6" file="f1" line="6" members="_20 _21 _22 _23 _24 _25" size="64" align="32"/>
  <Struct id="_9" name="C" context="_1" location="f1:12" file="f1" line="12" members="_26 _27 _28 _29 _30 _31 _32" size="128" align="32"/>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_33 _34 _35 _36" size="256" align="64"/>
  <PointerType id="_13" type="_37" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_38"/>
  <Field id="_15" name="a" type="_39" context="_7" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Constructor id="_16" name="A" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_17" name="A" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_40" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_18" name="=" returns="_41" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN1AaSERKS_">
    <Argument type="_40" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_19" name="A" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_20" name="a" type="_7" context="_8" access="public" location="f1:8" file="f1" line="8" offset="0"/>
  <Field id="_21" name="b" type="_39" context="_8" access="public" location="f1:9" file="f1" line="9" offset="32"/>
  <Constructor id="_22" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Constructor id="_23" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1">
    <Argument type="_42" location="f1:6" file="f1" line="6"/>
  </Constructor>
  <OperatorMethod id="_24" name="=" returns="_43" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" mangled="_ZN1BaSERKS_">
    <Argument type="_42" location="f1:6" file="f1" line="6"/>
  </OperatorMethod>
  <Destructor id="_25" name="B" context="_8" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Field id="_26" name="a" type="_7" context="_9" access="public" location="f1:14" file="f1" line="14" offset="0"/>
  <Field id="_27" name="b" type="_8" context="_9" access="public" location="f1:15" file="f1" line="15" offset="32"/>
  <Field id="_28" name="c" type="_39" context="_9" access="public" location="f1:16" file="f1" line="16" offset="96"/>
  <Constructor id="_29" name="C" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1"/>
  <Constructor id="_30" name="C" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1">
    <Argument type="_44" location="f1:12" file="f1" line="12"/>
  </Constructor>
  <OperatorMethod id="_31" name="=" returns="_45" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1" mangled="_ZN1CaSERKS_">
    <Argument type="_44" location="f1:12" file="f1" line="12"/>
  </OperatorMethod>
  <Destructor id="_32" name="C" context="_9" access="public" location="f1:12" file="f1" line="12" inline="1" artificial="1"/>
  <Field id="_33" name="isa" type="_46" context="_12" access="public" offset="0"/>
  <Field id="_34" name="flags" type="_39" context="_12" access="public" offset="64"/>
  <Field id="_35" name="str" type="_47" context="_12" access="public" offset="128"/>
  <Field id="_36" name="length" type="_48" context="_12" access="public" offset="192"/>
  <Struct id="_38" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_49 _50 _51 _52" size="192" align="64"/>
  <FundamentalType id="_39" name="int" size="32" align="32"/>
  <ReferenceType id="_40" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_41" type="_7" size="64" align="64"/>
  <ReferenceType id="_42" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_43" type="_8" size="64" align="64"/>
  <ReferenceType id="_44" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_45" type="_9" size="64" align="64"/>
  <PointerType id="_46" type="_39c" size="64" align="64"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <PointerType id="_47" type="_37c" size="64" align="64"/>
  <CvQualifiedType id="_37c" type="_37" const="1"/>
  <FundamentalType id="_48" name="long int" size="64" align="64"/>
  <Field id="_49" name="gp_offset" type="_53" context="_38" access="public" offset="0"/>
  <Field id="_50" name="fp_offset" type="_53" context="_38" access="public" offset="32"/>
  <Field id="_51" name="overflow_arg_area" type="_54" context="_38" access="public" offset="64"/>
  <Field id="_52" name="reg_save_area" type="_54" context="_38" access="public" offset="128"/>
  <FundamentalType id="_53" name="unsigned int" size="32" align="32"/>
  <PointerType id="_54" type="_55" size="64" align="64"/>
  <FundamentalType id="_37" name="char" size="8" align="8"/>
  <FundamentalType id="_55" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/nested.h"/>
</CastXML>
