<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11"/>
  <Struct id="_2" name="_GUID" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_3" name="__int128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__uint128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__NSConstantString" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_6" name="type_info" context="_1" location="f0:0" file="f0" line="0" incomplete="1"/>
  <Typedef id="_7" name="size_t" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_8" name="__builtin_ms_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_9" name="__builtin_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_10" name="Pointers" context="_1" location="f1:1" file="f1" line="1" members="_17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28" size="640" align="64"/>
  <Function id="_11" name="__builtin_memcpy" returns="_29" context="_1" location="f1:1" file="f1" line="1" extern="1" artificial="1" mangled="?__builtin_memcpy@@9">
    <Argument type="_29"/>
    <Argument type="_30"/>
    <Argument type="_15"/>
  </Function>
  <FundamentalType id="_12" name="__int128" size="128" align="128"/>
  <FundamentalType id="_13" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_14" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_31 _32 _33 _34" size="256" align="64"/>
  <FundamentalType id="_15" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_16" type="_35" size="64" align="64"/>
  <Field id="_17" name="p_int" type="_36" context="_10" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_18" name="pp_float" type="_37" context="_10" access="public" location="f1:4" file="f1" line="4" offset="64"/>
  <Field id="_19" name="p_void" type="_29" context="_10" access="public" location="f1:5" file="f1" line="5" offset="128"/>
  <Field id="_20" name="p_char" type="_16" context="_10" access="public" location="f1:6" file="f1" line="6" offset="192"/>
  <Field id="_21" name="p_const_double" type="_38" context="_10" access="public" location="f1:7" file="f1" line="7" offset="256"/>
  <Field id="_22" name="func_ptr" type="_39" context="_10" access="public" location="f1:8" file="f1" line="8" offset="320"/>
  <Field id="_23" name="void_func_ptr" type="_40" context="_10" access="public" location="f1:9" file="f1" line="9" offset="384"/>
  <Field id="_24" name="arr_func_ptr" type="_41" context="_10" access="public" location="f1:10" file="f1" line="10" offset="448"/>
  <Constructor id="_25" name="Pointers" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_26" name="Pointers" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_42" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_27" name="=" returns="_43" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="??4Pointers@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_42" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_28" name="Pointers" context="_10" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <PointerType id="_29" type="_44" size="64" align="64"/>
  <PointerType id="_30" type="_44c" size="64" align="64"/>
  <Field id="_31" name="isa" type="_45" context="_14" access="public" offset="0"/>
  <Field id="_32" name="flags" type="_46" context="_14" access="public" offset="64"/>
  <Field id="_33" name="str" type="_47" context="_14" access="public" offset="128"/>
  <Field id="_34" name="length" type="_48" context="_14" access="public" offset="192"/>
  <PointerType id="_36" type="_46" size="64" align="64"/>
  <PointerType id="_37" type="_49" size="64" align="64"/>
  <PointerType id="_38" type="_50c" size="64" align="64"/>
  <PointerType id="_39" type="_51" size="64" align="64"/>
  <PointerType id="_40" type="_52" size="64" align="64"/>
  <ArrayType id="_41" min="0" max="2" type="_53"/>
  <ReferenceType id="_42" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_43" type="_10" size="64" align="64"/>
  <CvQualifiedType id="_44c" type="_44" const="1"/>
  <PointerType id="_45" type="_46c" size="64" align="64"/>
  <FundamentalType id="_46" name="int" size="32" align="32"/>
  <CvQualifiedType id="_46c" type="_46" const="1"/>
  <PointerType id="_47" type="_35c" size="64" align="64"/>
  <CvQualifiedType id="_35c" type="_35" const="1"/>
  <FundamentalType id="_48" name="long int" size="32" align="32"/>
  <CvQualifiedType id="_50c" type="_50" const="1"/>
  <PointerType id="_53" type="_54" size="64" align="64"/>
  <FundamentalType id="_35" name="char" size="8" align="8"/>
  <FundamentalType id="_44" name="void" size="0" align="8"/>
  <PointerType id="_49" type="_55" size="64" align="64"/>
  <FundamentalType id="_50" name="double" size="64" align="64"/>
  <FunctionType id="_51" returns="_46">
    <Argument type="_46"/>
    <Argument type="_55"/>
  </FunctionType>
  <FunctionType id="_52" returns="_44"/>
  <FunctionType id="_54" returns="_46">
    <Argument type="_35"/>
  </FunctionType>
  <FundamentalType id="_55" name="float" size="32" align="32"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="\\VBoxSvr\vbox\castxml\headers\pointers.h"/>
</CastXML>
