<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8"/>
  <Typedef id="_2" name="__int128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Pointers" context="_1" location="f1:1" file="f1" line="1" members="_14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25" size="640" align="64"/>
  <Function id="_8" name="__builtin_memcpy" returns="_26" context="_1" location="f1:1" file="f1" line="1" extern="1" artificial="1" mangled="_Z16__builtin_memcpy">
    <Argument type="_26"/>
    <Argument type="_27"/>
    <Argument type="_28"/>
  </Function>
  <FundamentalType id="_9" name="__int128" size="128" align="128"/>
  <FundamentalType id="_10" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_11" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_29 _30 _31 _32" size="256" align="64"/>
  <PointerType id="_12" type="_33" size="64" align="64"/>
  <ArrayType id="_13" min="0" max="0" type="_34"/>
  <Field id="_14" name="p_int" type="_35" context="_7" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_15" name="pp_float" type="_36" context="_7" access="public" location="f1:4" file="f1" line="4" offset="64"/>
  <Field id="_16" name="p_void" type="_26" context="_7" access="public" location="f1:5" file="f1" line="5" offset="128"/>
  <Field id="_17" name="p_char" type="_12" context="_7" access="public" location="f1:6" file="f1" line="6" offset="192"/>
  <Field id="_18" name="p_const_double" type="_37" context="_7" access="public" location="f1:7" file="f1" line="7" offset="256"/>
  <Field id="_19" name="func_ptr" type="_38" context="_7" access="public" location="f1:8" file="f1" line="8" offset="320"/>
  <Field id="_20" name="void_func_ptr" type="_39" context="_7" access="public" location="f1:9" file="f1" line="9" offset="384"/>
  <Field id="_21" name="arr_func_ptr" type="_40" context="_7" access="public" location="f1:10" file="f1" line="10" offset="448"/>
  <Constructor id="_22" name="Pointers" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_23" name="Pointers" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_41" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_24" name="=" returns="_42" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN8PointersaSERKS_">
    <Argument type="_41" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_25" name="Pointers" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <PointerType id="_26" type="_43" size="64" align="64"/>
  <PointerType id="_27" type="_43c" size="64" align="64"/>
  <FundamentalType id="_28" name="long unsigned int" size="64" align="64"/>
  <Field id="_29" name="isa" type="_44" context="_11" access="public" offset="0"/>
  <Field id="_30" name="flags" type="_45" context="_11" access="public" offset="64"/>
  <Field id="_31" name="str" type="_46" context="_11" access="public" offset="128"/>
  <Field id="_32" name="length" type="_47" context="_11" access="public" offset="192"/>
  <Struct id="_34" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_48 _49 _50 _51" size="192" align="64"/>
  <PointerType id="_35" type="_45" size="64" align="64"/>
  <PointerType id="_36" type="_52" size="64" align="64"/>
  <PointerType id="_37" type="_53c" size="64" align="64"/>
  <PointerType id="_38" type="_54" size="64" align="64"/>
  <PointerType id="_39" type="_55" size="64" align="64"/>
  <ArrayType id="_40" min="0" max="2" type="_56"/>
  <ReferenceType id="_41" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_42" type="_7" size="64" align="64"/>
  <CvQualifiedType id="_43c" type="_43" const="1"/>
  <PointerType id="_44" type="_45c" size="64" align="64"/>
  <FundamentalType id="_45" name="int" size="32" align="32"/>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <PointerType id="_46" type="_33c" size="64" align="64"/>
  <CvQualifiedType id="_33c" type="_33" const="1"/>
  <FundamentalType id="_47" name="long int" size="64" align="64"/>
  <Field id="_48" name="gp_offset" type="_57" context="_34" access="public" offset="0"/>
  <Field id="_49" name="fp_offset" type="_57" context="_34" access="public" offset="32"/>
  <Field id="_50" name="overflow_arg_area" type="_26" context="_34" access="public" offset="64"/>
  <Field id="_51" name="reg_save_area" type="_26" context="_34" access="public" offset="128"/>
  <CvQualifiedType id="_53c" type="_53" const="1"/>
  <PointerType id="_56" type="_58" size="64" align="64"/>
  <FundamentalType id="_57" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_33" name="char" size="8" align="8"/>
  <FundamentalType id="_43" name="void" size="0" align="8"/>
  <PointerType id="_52" type="_59" size="64" align="64"/>
  <FundamentalType id="_53" name="double" size="64" align="64"/>
  <FunctionType id="_54" returns="_45">
    <Argument type="_45"/>
    <Argument type="_59"/>
  </FunctionType>
  <FunctionType id="_55" returns="_43"/>
  <FunctionType id="_58" returns="_45">
    <Argument type="_33"/>
  </FunctionType>
  <FundamentalType id="_59" name="float" size="32" align="32"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/pointers.h"/>
</CastXML>
