<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8"/>
  <Typedef id="_2" name="__int128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="" context="_1" location="f1:1" file="f1" line="1" members="_14 _15 _16 _17 _18" size="32" align="32"/>
  <Typedef id="_8" name="Point" type="_19" context="_1" location="f1:3" file="f1" line="3"/>
  <FundamentalType id="_9" name="__int128" size="128" align="128"/>
  <FundamentalType id="_10" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_11" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_20 _21 _22 _23" size="256" align="64"/>
  <PointerType id="_12" type="_24" size="64" align="64"/>
  <ArrayType id="_13" min="0" max="0" type="_25"/>
  <Field id="_14" name="x" type="_26" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Constructor id="_15" name="" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_16" name="" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_27" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_17" name="=" returns="_28" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN5PointaSERKS_">
    <Argument type="_27" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_18" name="" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <ElaboratedType id="_19" type="_7"/>
  <Field id="_20" name="isa" type="_29" context="_11" access="public" offset="0"/>
  <Field id="_21" name="flags" type="_26" context="_11" access="public" offset="64"/>
  <Field id="_22" name="str" type="_30" context="_11" access="public" offset="128"/>
  <Field id="_23" name="length" type="_31" context="_11" access="public" offset="192"/>
  <Struct id="_25" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_32 _33 _34 _35" size="192" align="64"/>
  <FundamentalType id="_26" name="int" size="32" align="32"/>
  <ReferenceType id="_27" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_28" type="_7" size="64" align="64"/>
  <PointerType id="_29" type="_26c" size="64" align="64"/>
  <CvQualifiedType id="_26c" type="_26" const="1"/>
  <PointerType id="_30" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <FundamentalType id="_31" name="long int" size="64" align="64"/>
  <Field id="_32" name="gp_offset" type="_36" context="_25" access="public" offset="0"/>
  <Field id="_33" name="fp_offset" type="_36" context="_25" access="public" offset="32"/>
  <Field id="_34" name="overflow_arg_area" type="_37" context="_25" access="public" offset="64"/>
  <Field id="_35" name="reg_save_area" type="_37" context="_25" access="public" offset="128"/>
  <FundamentalType id="_36" name="unsigned int" size="32" align="32"/>
  <PointerType id="_37" type="_38" size="64" align="64"/>
  <FundamentalType id="_24" name="char" size="8" align="8"/>
  <FundamentalType id="_38" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/typedef_struct.h"/>
</CastXML>
