<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28"/>
  <Typedef id="_2" name="__int128_t" type="_29" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_30" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_31" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_32" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_33" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_7" name="MyInt" type="_34" context="_1" location="f1:1" file="f1" line="1"/>
  <Typedef id="_8" name="MyULong" type="_35" context="_1" location="f1:2" file="f1" line="2"/>
  <Typedef id="_9" name="FloatPtr" type="_36" context="_1" location="f1:3" file="f1" line="3"/>
  <Typedef id="_10" name="FuncPtr" type="_37" context="_1" location="f1:4" file="f1" line="4"/>
  <Struct id="_11" name="" context="_1" location="f1:6" file="f1" line="6" members="_38 _39 _40 _41 _42 _43" size="64" align="32"/>
  <Typedef id="_12" name="Point" type="_44" context="_1" location="f1:9" file="f1" line="9"/>
  <Typedef id="_13" name="PointPtr" type="_45" context="_1" location="f1:11" file="f1" line="11"/>
  <Struct id="_14" name="" context="_1" location="f1:13" file="f1" line="13" members="_46 _47 _48 _49 _50 _51" size="96" align="32"/>
  <Typedef id="_15" name="Circle" type="_52" context="_1" location="f1:16" file="f1" line="16"/>
  <Typedef id="_16" name="Shapes" type="_53" context="_1" location="f1:18" file="f1" line="18"/>
  <Typedef id="_17" name="ShapesPtr" type="_54" context="_1" location="f1:20" file="f1" line="20"/>
  <Struct id="_18" name="" context="_1" location="f1:22" file="f1" line="22" members="_55 _56 _57 _58 _59 _60" size="128" align="64"/>
  <Typedef id="_19" name="ComplexStruct" type="_61" context="_1" location="f1:25" file="f1" line="25"/>
  <Typedef id="_20" name="Alias1" type="_7" context="_1" location="f1:28" file="f1" line="28"/>
  <Typedef id="_21" name="Alias2" type="_20" context="_1" location="f1:29" file="f1" line="29"/>
  <Typedef id="_22" name="Alias3" type="_21" context="_1" location="f1:30" file="f1" line="30"/>
  <Typedef id="_23" name="IntArray1D" type="_62" context="_1" location="f1:32" file="f1" line="32"/>
  <Typedef id="_24" name="IntArray2D" type="_63" context="_1" location="f1:33" file="f1" line="33"/>
  <Typedef id="_25" name="IntArray3D" type="_64" context="_1" location="f1:34" file="f1" line="34"/>
  <Typedef id="_26" name="Alias1D" type="_23" context="_1" location="f1:37" file="f1" line="37"/>
  <Typedef id="_27" name="Alias2D" type="_24" context="_1" location="f1:38" file="f1" line="38"/>
  <Typedef id="_28" name="Alias3D" type="_25" context="_1" location="f1:39" file="f1" line="39"/>
  <FundamentalType id="_29" name="__int128" size="128" align="128"/>
  <FundamentalType id="_30" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_31" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_65 _66 _67 _68" size="256" align="64"/>
  <PointerType id="_32" type="_69" size="64" align="64"/>
  <ArrayType id="_33" min="0" max="0" type="_70"/>
  <FundamentalType id="_34" name="int" size="32" align="32"/>
  <FundamentalType id="_35" name="long unsigned int" size="64" align="64"/>
  <PointerType id="_36" type="_71" size="64" align="64"/>
  <PointerType id="_37" type="_72" size="64" align="64"/>
  <Field id="_38" name="x" type="_34" context="_11" access="public" location="f1:7" file="f1" line="7" offset="0"/>
  <Field id="_39" name="y" type="_34" context="_11" access="public" location="f1:8" file="f1" line="8" offset="32"/>
  <Constructor id="_40" name="" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Constructor id="_41" name="" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1">
    <Argument type="_73" location="f1:6" file="f1" line="6"/>
  </Constructor>
  <OperatorMethod id="_42" name="=" returns="_74" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" mangled="_ZN5PointaSERKS_">
    <Argument type="_73" location="f1:6" file="f1" line="6"/>
  </OperatorMethod>
  <Destructor id="_43" name="" context="_11" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <ElaboratedType id="_44" type="_11"/>
  <PointerType id="_45" type="_12" size="64" align="64"/>
  <Field id="_46" name="center" type="_12" context="_14" access="public" location="f1:14" file="f1" line="14" offset="0"/>
  <Field id="_47" name="radius" type="_71" context="_14" access="public" location="f1:15" file="f1" line="15" offset="64"/>
  <Constructor id="_48" name="" context="_14" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <Constructor id="_49" name="" context="_14" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1">
    <Argument type="_75" location="f1:13" file="f1" line="13"/>
  </Constructor>
  <OperatorMethod id="_50" name="=" returns="_76" context="_14" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1" mangled="_ZN6CircleaSERKS_">
    <Argument type="_75" location="f1:13" file="f1" line="13"/>
  </OperatorMethod>
  <Destructor id="_51" name="" context="_14" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <ElaboratedType id="_52" type="_14"/>
  <ArrayType id="_53" min="0" max="9" type="_15"/>
  <PointerType id="_54" type="_16" size="64" align="64"/>
  <Field id="_55" name="shape_array" type="_17" context="_18" access="public" location="f1:23" file="f1" line="23" offset="0"/>
  <Field id="_56" name="callback" type="_10" context="_18" access="public" location="f1:24" file="f1" line="24" offset="64"/>
  <Constructor id="_57" name="" context="_18" access="public" location="f1:22" file="f1" line="22" inline="1" artificial="1"/>
  <Constructor id="_58" name="" context="_18" access="public" location="f1:22" file="f1" line="22" inline="1" artificial="1">
    <Argument type="_77" location="f1:22" file="f1" line="22"/>
  </Constructor>
  <OperatorMethod id="_59" name="=" returns="_78" context="_18" access="public" location="f1:22" file="f1" line="22" inline="1" artificial="1" mangled="_ZN13ComplexStructaSERKS_">
    <Argument type="_77" location="f1:22" file="f1" line="22"/>
  </OperatorMethod>
  <Destructor id="_60" name="" context="_18" access="public" location="f1:22" file="f1" line="22" inline="1" artificial="1"/>
  <ElaboratedType id="_61" type="_18"/>
  <ArrayType id="_62" min="0" max="4" type="_34"/>
  <ArrayType id="_63" min="0" max="2" type="_79"/>
  <ArrayType id="_64" min="0" max="1" type="_63"/>
  <Field id="_65" name="isa" type="_80" context="_31" access="public" offset="0"/>
  <Field id="_66" name="flags" type="_34" context="_31" access="public" offset="64"/>
  <Field id="_67" name="str" type="_81" context="_31" access="public" offset="128"/>
  <Field id="_68" name="length" type="_82" context="_31" access="public" offset="192"/>
  <Struct id="_70" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_83 _84 _85 _86" size="192" align="64"/>
  <FundamentalType id="_71" name="float" size="32" align="32"/>
  <ReferenceType id="_73" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_74" type="_11" size="64" align="64"/>
  <ReferenceType id="_75" type="_14c" size="64" align="64"/>
  <CvQualifiedType id="_14c" type="_14" const="1"/>
  <ReferenceType id="_76" type="_14" size="64" align="64"/>
  <ReferenceType id="_77" type="_18c" size="64" align="64"/>
  <CvQualifiedType id="_18c" type="_18" const="1"/>
  <ReferenceType id="_78" type="_18" size="64" align="64"/>
  <ArrayType id="_79" min="0" max="3" type="_34"/>
  <PointerType id="_80" type="_34c" size="64" align="64"/>
  <CvQualifiedType id="_34c" type="_34" const="1"/>
  <PointerType id="_81" type="_69c" size="64" align="64"/>
  <CvQualifiedType id="_69c" type="_69" const="1"/>
  <FundamentalType id="_82" name="long int" size="64" align="64"/>
  <Field id="_83" name="gp_offset" type="_87" context="_70" access="public" offset="0"/>
  <Field id="_84" name="fp_offset" type="_87" context="_70" access="public" offset="32"/>
  <Field id="_85" name="overflow_arg_area" type="_88" context="_70" access="public" offset="64"/>
  <Field id="_86" name="reg_save_area" type="_88" context="_70" access="public" offset="128"/>
  <FundamentalType id="_87" name="unsigned int" size="32" align="32"/>
  <PointerType id="_88" type="_89" size="64" align="64"/>
  <FundamentalType id="_69" name="char" size="8" align="8"/>
  <FunctionType id="_72" returns="_89">
    <Argument type="_34"/>
    <Argument type="_71"/>
  </FunctionType>
  <FundamentalType id="_89" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/user/projects/castxml/headers/typedefs.h"/>
</CastXML>
