<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11"/>
  <Typedef id="_2" name="__int128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Union id="_7" name="IntOrFloat" context="_1" location="f1:2" file="f1" line="2" members="_17 _18 _19 _20 _21 _22" size="32" align="32"/>
  <Struct id="_8" name="Packet" context="_1" location="f1:8" file="f1" line="8" members="_23 _24 _25 _26 _27 _28 _29" size="64" align="32"/>
  <Struct id="_9" name="Mixed" context="_1" location="f1:18" file="f1" line="18" members="_30 _31 _32 _33 _34 _35 _36 _37 _38" size="128" align="64"/>
  <Union id="_10" name="NestedUnion" context="_1" location="f1:27" file="f1" line="27" members="_39 _40 _41 _42 _43 _44 _45" size="64" align="32"/>
  <Union id="_11" name="DeepUnion" context="_1" location="f1:39" file="f1" line="39" members="_46 _47 _48 _49 _50 _51" size="64" align="32"/>
  <FundamentalType id="_12" name="__int128" size="128" align="128"/>
  <FundamentalType id="_13" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_14" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_52 _53 _54 _55" size="256" align="64"/>
  <PointerType id="_15" type="_56" size="64" align="64"/>
  <ArrayType id="_16" min="0" max="0" type="_57"/>
  <Field id="_17" name="i" type="_58" context="_7" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_18" name="f" type="_59" context="_7" access="public" location="f1:4" file="f1" line="4" offset="0"/>
  <Constructor id="_19" name="IntOrFloat" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Constructor id="_20" name="IntOrFloat" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1">
    <Argument type="_60" location="f1:2" file="f1" line="2"/>
  </Constructor>
  <OperatorMethod id="_21" name="=" returns="_61" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1" mangled="_ZN10IntOrFloataSERKS_">
    <Argument type="_60" location="f1:2" file="f1" line="2"/>
  </OperatorMethod>
  <Destructor id="_22" name="IntOrFloat" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Field id="_23" name="type" type="_58" context="_8" access="public" location="f1:9" file="f1" line="9" offset="0"/>
  <Union id="_24" name="Payload" context="_8" access="public" location="f1:10" file="f1" line="10" members="_62 _63 _64 _65 _66 _67 _68" size="32" align="32"/>
  <Field id="_25" name="data" type="_69" context="_8" access="public" location="f1:14" file="f1" line="14" offset="32"/>
  <Constructor id="_26" name="Packet" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1"/>
  <Constructor id="_27" name="Packet" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_70" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <OperatorMethod id="_28" name="=" returns="_71" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="_ZN6PacketaSERKS_">
    <Argument type="_70" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Destructor id="_29" name="Packet" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1"/>
  <Field id="_30" name="tag" type="_58" context="_9" access="public" location="f1:19" file="f1" line="19" offset="0"/>
  <Union id="_31" context="_9" access="public" location="f1:20" file="f1" line="20" members="_72 _73 _74 _75 _76 _77" size="64" align="64"/>
  <Field id="_32" name="" type="_31" context="_9" access="public" location="f1:20" file="f1" line="20" offset="64"/>
  <Unimplemented id="_33" kind="IndirectField"/>
  <Unimplemented id="_34" kind="IndirectField"/>
  <Constructor id="_35" name="Mixed" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Constructor id="_36" name="Mixed" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1">
    <Argument type="_78" location="f1:18" file="f1" line="18"/>
  </Constructor>
  <OperatorMethod id="_37" name="=" returns="_79" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1" mangled="_ZN5MixedaSERKS_">
    <Argument type="_78" location="f1:18" file="f1" line="18"/>
  </OperatorMethod>
  <Destructor id="_38" name="Mixed" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Field id="_39" name="id" type="_58" context="_10" access="public" location="f1:28" file="f1" line="28" offset="0"/>
  <Struct id="_40" name="" context="_10" access="public" location="f1:29" file="f1" line="29" members="_80 _81 _82 _83 _84 _85 _86 _87 _88" size="64" align="32"/>
  <Field id="_41" name="nested" type="_89" context="_10" access="public" location="f1:35" file="f1" line="35" offset="0"/>
  <Constructor id="_42" name="NestedUnion" context="_10" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Constructor id="_43" name="NestedUnion" context="_10" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1">
    <Argument type="_90" location="f1:27" file="f1" line="27"/>
  </Constructor>
  <OperatorMethod id="_44" name="=" returns="_91" context="_10" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1" mangled="_ZN11NestedUnionaSERKS_">
    <Argument type="_90" location="f1:27" file="f1" line="27"/>
  </OperatorMethod>
  <Destructor id="_45" name="NestedUnion" context="_10" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Struct id="_46" name="" context="_11" access="public" location="f1:40" file="f1" line="40" members="_92 _93 _94 _95 _96 _97 _98" size="64" align="32"/>
  <Field id="_47" name="structured" type="_99" context="_11" access="public" location="f1:46" file="f1" line="46" offset="0"/>
  <Constructor id="_48" name="DeepUnion" context="_11" access="public" location="f1:39" file="f1" line="39" inline="1" artificial="1"/>
  <Constructor id="_49" name="DeepUnion" context="_11" access="public" location="f1:39" file="f1" line="39" inline="1" artificial="1">
    <Argument type="_100" location="f1:39" file="f1" line="39"/>
  </Constructor>
  <OperatorMethod id="_50" name="=" returns="_101" context="_11" access="public" location="f1:39" file="f1" line="39" inline="1" artificial="1" mangled="_ZN9DeepUnionaSERKS_">
    <Argument type="_100" location="f1:39" file="f1" line="39"/>
  </OperatorMethod>
  <Destructor id="_51" name="DeepUnion" context="_11" access="public" location="f1:39" file="f1" line="39" inline="1" artificial="1"/>
  <Field id="_52" name="isa" type="_102" context="_14" access="public" offset="0"/>
  <Field id="_53" name="flags" type="_58" context="_14" access="public" offset="64"/>
  <Field id="_54" name="str" type="_103" context="_14" access="public" offset="128"/>
  <Field id="_55" name="length" type="_104" context="_14" access="public" offset="192"/>
  <Struct id="_57" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_105 _106 _107 _108" size="192" align="64"/>
  <FundamentalType id="_58" name="int" size="32" align="32"/>
  <FundamentalType id="_59" name="float" size="32" align="32"/>
  <ReferenceType id="_60" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_61" type="_7" size="64" align="64"/>
  <Field id="_62" name="int_val" type="_58" context="_24" access="public" location="f1:11" file="f1" line="11" offset="0"/>
  <Field id="_63" name="float_val" type="_59" context="_24" access="public" location="f1:12" file="f1" line="12" offset="0"/>
  <Field id="_64" name="bytes" type="_109" context="_24" access="public" location="f1:13" file="f1" line="13" offset="0"/>
  <Constructor id="_65" name="Payload" context="_24" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1"/>
  <Constructor id="_66" name="Payload" context="_24" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1">
    <Argument type="_110" location="f1:10" file="f1" line="10"/>
  </Constructor>
  <OperatorMethod id="_67" name="=" returns="_111" context="_24" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1" mangled="_ZN6Packet7PayloadaSERKS0_">
    <Argument type="_110" location="f1:10" file="f1" line="10"/>
  </OperatorMethod>
  <Destructor id="_68" name="Payload" context="_24" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1"/>
  <ElaboratedType id="_69" type="_24"/>
  <ReferenceType id="_70" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_71" type="_8" size="64" align="64"/>
  <Field id="_72" name="d" type="_112" context="_31" access="public" location="f1:21" file="f1" line="21" offset="0"/>
  <Field id="_73" name="l" type="_104" context="_31" access="public" location="f1:22" file="f1" line="22" offset="0"/>
  <Constructor id="_74" name="" context="_31" access="public" location="f1:20" file="f1" line="20" inline="1" artificial="1"/>
  <Constructor id="_75" name="" context="_31" access="public" location="f1:20" file="f1" line="20" inline="1" artificial="1">
    <Argument type="_113" location="f1:20" file="f1" line="20"/>
  </Constructor>
  <OperatorMethod id="_76" name="=" returns="_114" context="_31" access="public" location="f1:20" file="f1" line="20" inline="1" artificial="1" mangled="_ZN5MixedUt_aSERKS0_">
    <Argument type="_113" location="f1:20" file="f1" line="20"/>
  </OperatorMethod>
  <Destructor id="_77" name="" context="_31" access="public" location="f1:20" file="f1" line="20" inline="1" artificial="1"/>
  <ReferenceType id="_78" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_79" type="_9" size="64" align="64"/>
  <Field id="_80" name="c" type="_56" context="_40" access="public" location="f1:30" file="f1" line="30" offset="0"/>
  <FundamentalType id="_56" name="char" size="8" align="8"/>
  <Union id="_81" context="_40" access="public" location="f1:31" file="f1" line="31" members="_115 _116 _117 _118 _119 _120" size="32" align="32"/>
  <Field id="_82" name="" type="_81" context="_40" access="public" location="f1:31" file="f1" line="31" offset="32"/>
  <Unimplemented id="_83" kind="IndirectField"/>
  <Unimplemented id="_84" kind="IndirectField"/>
  <Constructor id="_85" name="" context="_40" access="public" location="f1:29" file="f1" line="29" inline="1" artificial="1"/>
  <Constructor id="_86" name="" context="_40" access="public" location="f1:29" file="f1" line="29" inline="1" artificial="1">
    <Argument type="_121" location="f1:29" file="f1" line="29"/>
  </Constructor>
  <OperatorMethod id="_87" name="=" returns="_122" context="_40" access="public" location="f1:29" file="f1" line="29" inline="1" artificial="1" mangled="_ZN11NestedUnionUt_aSERKS0_">
    <Argument type="_121" location="f1:29" file="f1" line="29"/>
  </OperatorMethod>
  <Destructor id="_88" name="" context="_40" access="public" location="f1:29" file="f1" line="29" inline="1" artificial="1"/>
  <ElaboratedType id="_89" type="_40"/>
  <ReferenceType id="_90" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_91" type="_10" size="64" align="64"/>
  <Field id="_92" name="header" type="_58" context="_46" access="public" location="f1:41" file="f1" line="41" offset="0"/>
  <Union id="_93" name="" context="_46" access="public" location="f1:42" file="f1" line="42" members="_123 _124 _125 _126 _127 _128" size="32" align="32"/>
  <Field id="_94" name="inner_union" type="_129" context="_46" access="public" location="f1:45" file="f1" line="45" offset="32"/>
  <Constructor id="_95" name="" context="_46" access="public" location="f1:40" file="f1" line="40" inline="1" artificial="1"/>
  <Constructor id="_96" name="" context="_46" access="public" location="f1:40" file="f1" line="40" inline="1" artificial="1">
    <Argument type="_130" location="f1:40" file="f1" line="40"/>
  </Constructor>
  <OperatorMethod id="_97" name="=" returns="_131" context="_46" access="public" location="f1:40" file="f1" line="40" inline="1" artificial="1" mangled="_ZN9DeepUnionUt_aSERKS0_">
    <Argument type="_130" location="f1:40" file="f1" line="40"/>
  </OperatorMethod>
  <Destructor id="_98" name="" context="_46" access="public" location="f1:40" file="f1" line="40" inline="1" artificial="1"/>
  <ElaboratedType id="_99" type="_46"/>
  <ReferenceType id="_100" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_101" type="_11" size="64" align="64"/>
  <PointerType id="_102" type="_58c" size="64" align="64"/>
  <CvQualifiedType id="_58c" type="_58" const="1"/>
  <PointerType id="_103" type="_56c" size="64" align="64"/>
  <CvQualifiedType id="_56c" type="_56" const="1"/>
  <FundamentalType id="_104" name="long int" size="64" align="64"/>
  <Field id="_105" name="gp_offset" type="_132" context="_57" access="public" offset="0"/>
  <Field id="_106" name="fp_offset" type="_132" context="_57" access="public" offset="32"/>
  <Field id="_107" name="overflow_arg_area" type="_133" context="_57" access="public" offset="64"/>
  <Field id="_108" name="reg_save_area" type="_133" context="_57" access="public" offset="128"/>
  <ArrayType id="_109" min="0" max="3" type="_56"/>
  <ReferenceType id="_110" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <ReferenceType id="_111" type="_24" size="64" align="64"/>
  <FundamentalType id="_112" name="double" size="64" align="64"/>
  <ReferenceType id="_113" type="_31c" size="64" align="64"/>
  <CvQualifiedType id="_31c" type="_31" const="1"/>
  <ReferenceType id="_114" type="_31" size="64" align="64"/>
  <Field id="_115" name="inner_i" type="_58" context="_81" access="public" location="f1:32" file="f1" line="32" offset="0"/>
  <Field id="_116" name="inner_f" type="_59" context="_81" access="public" location="f1:33" file="f1" line="33" offset="0"/>
  <Constructor id="_117" name="" context="_81" access="public" location="f1:31" file="f1" line="31" inline="1" artificial="1"/>
  <Constructor id="_118" name="" context="_81" access="public" location="f1:31" file="f1" line="31" inline="1" artificial="1">
    <Argument type="_134" location="f1:31" file="f1" line="31"/>
  </Constructor>
  <OperatorMethod id="_119" name="=" returns="_135" context="_81" access="public" location="f1:31" file="f1" line="31" inline="1" artificial="1" mangled="_ZN11NestedUnionUt_Ut_aSERKS1_">
    <Argument type="_134" location="f1:31" file="f1" line="31"/>
  </OperatorMethod>
  <Destructor id="_120" name="" context="_81" access="public" location="f1:31" file="f1" line="31" inline="1" artificial="1"/>
  <ReferenceType id="_121" type="_40c" size="64" align="64"/>
  <CvQualifiedType id="_40c" type="_40" const="1"/>
  <ReferenceType id="_122" type="_40" size="64" align="64"/>
  <Field id="_123" name="a" type="_58" context="_93" access="public" location="f1:43" file="f1" line="43" offset="0"/>
  <Field id="_124" name="b" type="_59" context="_93" access="public" location="f1:44" file="f1" line="44" offset="0"/>
  <Constructor id="_125" name="" context="_93" access="public" location="f1:42" file="f1" line="42" inline="1" artificial="1"/>
  <Constructor id="_126" name="" context="_93" access="public" location="f1:42" file="f1" line="42" inline="1" artificial="1">
    <Argument type="_136" location="f1:42" file="f1" line="42"/>
  </Constructor>
  <OperatorMethod id="_127" name="=" returns="_137" context="_93" access="public" location="f1:42" file="f1" line="42" inline="1" artificial="1" mangled="_ZN9DeepUnionUt_Ut_aSERKS1_">
    <Argument type="_136" location="f1:42" file="f1" line="42"/>
  </OperatorMethod>
  <Destructor id="_128" name="" context="_93" access="public" location="f1:42" file="f1" line="42" inline="1" artificial="1"/>
  <ElaboratedType id="_129" type="_93"/>
  <ReferenceType id="_130" type="_46c" size="64" align="64"/>
  <CvQualifiedType id="_46c" type="_46" const="1"/>
  <ReferenceType id="_131" type="_46" size="64" align="64"/>
  <FundamentalType id="_132" name="unsigned int" size="32" align="32"/>
  <PointerType id="_133" type="_138" size="64" align="64"/>
  <ReferenceType id="_134" type="_81c" size="64" align="64"/>
  <CvQualifiedType id="_81c" type="_81" const="1"/>
  <ReferenceType id="_135" type="_81" size="64" align="64"/>
  <ReferenceType id="_136" type="_93c" size="64" align="64"/>
  <CvQualifiedType id="_93c" type="_93" const="1"/>
  <ReferenceType id="_137" type="_93" size="64" align="64"/>
  <FundamentalType id="_138" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/user/projects/castxml/headers/unions.h"/>
</CastXML>
