<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7"/>
  <Typedef id="_2" name="__int128_t" type="_8" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="StatusFlags" context="_1" location="f1:1" file="f1" line="1" members="_13 _14 _15 _16 _17 _18 _19" size="32" align="32"/>
  <FundamentalType id="_8" name="__int128" size="128" align="128"/>
  <FundamentalType id="_9" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_10" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_20 _21 _22 _23" size="256" align="64"/>
  <PointerType id="_11" type="_24" size="64" align="64"/>
  <ArrayType id="_12" min="0" max="0" type="_25"/>
  <Field id="_13" name="ready" type="_26" bits="1" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Field id="_14" name="error" type="_26" bits="1" context="_7" access="public" location="f1:3" file="f1" line="3" offset="1"/>
  <Field id="_15" name="reserved" type="_26" bits="6" context="_7" access="public" location="f1:4" file="f1" line="4" offset="2"/>
  <Constructor id="_16" name="StatusFlags" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Constructor id="_17" name="StatusFlags" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1">
    <Argument type="_27" location="f1:1" file="f1" line="1"/>
  </Constructor>
  <OperatorMethod id="_18" name="=" returns="_28" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1" mangled="_ZN11StatusFlagsaSERKS_">
    <Argument type="_27" location="f1:1" file="f1" line="1"/>
  </OperatorMethod>
  <Destructor id="_19" name="StatusFlags" context="_7" access="public" location="f1:1" file="f1" line="1" inline="1" artificial="1"/>
  <Field id="_20" name="isa" type="_29" context="_10" access="public" offset="0"/>
  <Field id="_21" name="flags" type="_30" context="_10" access="public" offset="64"/>
  <Field id="_22" name="str" type="_31" context="_10" access="public" offset="128"/>
  <Field id="_23" name="length" type="_32" context="_10" access="public" offset="192"/>
  <Struct id="_25" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_33 _34 _35 _36" size="192" align="64"/>
  <FundamentalType id="_26" name="unsigned int" size="32" align="32"/>
  <ReferenceType id="_27" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_28" type="_7" size="64" align="64"/>
  <PointerType id="_29" type="_30c" size="64" align="64"/>
  <FundamentalType id="_30" name="int" size="32" align="32"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <PointerType id="_31" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <FundamentalType id="_32" name="long int" size="64" align="64"/>
  <Field id="_33" name="gp_offset" type="_26" context="_25" access="public" offset="0"/>
  <Field id="_34" name="fp_offset" type="_26" context="_25" access="public" offset="32"/>
  <Field id="_35" name="overflow_arg_area" type="_37" context="_25" access="public" offset="64"/>
  <Field id="_36" name="reg_save_area" type="_37" context="_25" access="public" offset="128"/>
  <PointerType id="_37" type="_38" size="64" align="64"/>
  <FundamentalType id="_24" name="char" size="8" align="8"/>
  <FundamentalType id="_38" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/bitfields_basic.h"/>
</CastXML>
