<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13"/>
  <Typedef id="_2" name="__int128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_18" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_7" name="MyInt" type="_19" context="_1" location="f1:3" file="f1" line="3"/>
  <Struct id="_8" name="Unused" context="_1" location="f1:5" file="f1" line="5" members="_20 _21 _22 _23 _24" size="64" align="64"/>
  <Struct id="_9" name="Nested" context="_1" location="f1:9" file="f1" line="9" members="_25 _26 _27 _28 _29" size="32" align="32"/>
  <Struct id="_10" name="Wrapper" context="_1" location="f1:13" file="f1" line="13" members="_30 _31 _32 _33 _34" size="32" align="32"/>
  <Union id="_11" name="Payload" context="_1" location="f1:17" file="f1" line="17" members="_35 _36 _37 _38 _39 _40" size="32" align="32"/>
  <Enumeration id="_12" name="Status" type="_41" context="_1" location="f1:22" file="f1" line="22" size="32" align="32">
    <EnumValue name="OK" init="0"/>
    <EnumValue name="ERROR" init="1"/>
  </Enumeration>
  <Struct id="_13" name="Main" context="_1" location="f1:27" file="f1" line="27" members="_42 _43 _44 _45 _46 _47" size="64" align="32"/>
  <FundamentalType id="_14" name="__int128" size="128" align="128"/>
  <FundamentalType id="_15" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_16" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_48 _49 _50 _51" size="256" align="64"/>
  <PointerType id="_17" type="_52" size="64" align="64"/>
  <ArrayType id="_18" min="0" max="0" type="_53"/>
  <FundamentalType id="_19" name="int" size="32" align="32"/>
  <Field id="_20" name="ignored" type="_54" context="_8" access="public" location="f1:6" file="f1" line="6" offset="0"/>
  <Constructor id="_21" name="Unused" context="_8" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1"/>
  <Constructor id="_22" name="Unused" context="_8" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1">
    <Argument type="_55" location="f1:5" file="f1" line="5"/>
  </Constructor>
  <OperatorMethod id="_23" name="=" returns="_56" context="_8" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1" mangled="_ZN6UnusedaSERKS_">
    <Argument type="_55" location="f1:5" file="f1" line="5"/>
  </OperatorMethod>
  <Destructor id="_24" name="Unused" context="_8" access="public" location="f1:5" file="f1" line="5" inline="1" artificial="1"/>
  <Field id="_25" name="value" type="_7" context="_9" access="public" location="f1:10" file="f1" line="10" offset="0"/>
  <Constructor id="_26" name="Nested" context="_9" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Constructor id="_27" name="Nested" context="_9" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1">
    <Argument type="_57" location="f1:9" file="f1" line="9"/>
  </Constructor>
  <OperatorMethod id="_28" name="=" returns="_58" context="_9" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1" mangled="_ZN6NestedaSERKS_">
    <Argument type="_57" location="f1:9" file="f1" line="9"/>
  </OperatorMethod>
  <Destructor id="_29" name="Nested" context="_9" access="public" location="f1:9" file="f1" line="9" inline="1" artificial="1"/>
  <Field id="_30" name="nested" type="_9" context="_10" access="public" location="f1:14" file="f1" line="14" offset="0"/>
  <Constructor id="_31" name="Wrapper" context="_10" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <Constructor id="_32" name="Wrapper" context="_10" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1">
    <Argument type="_59" location="f1:13" file="f1" line="13"/>
  </Constructor>
  <OperatorMethod id="_33" name="=" returns="_60" context="_10" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1" mangled="_ZN7WrapperaSERKS_">
    <Argument type="_59" location="f1:13" file="f1" line="13"/>
  </OperatorMethod>
  <Destructor id="_34" name="Wrapper" context="_10" access="public" location="f1:13" file="f1" line="13" inline="1" artificial="1"/>
  <Field id="_35" name="wrapper" type="_10" context="_11" access="public" location="f1:18" file="f1" line="18" offset="0"/>
  <Field id="_36" name="fallback" type="_61" context="_11" access="public" location="f1:19" file="f1" line="19" offset="0"/>
  <Constructor id="_37" name="Payload" context="_11" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <Constructor id="_38" name="Payload" context="_11" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1">
    <Argument type="_62" location="f1:17" file="f1" line="17"/>
  </Constructor>
  <OperatorMethod id="_39" name="=" returns="_63" context="_11" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1" mangled="_ZN7PayloadaSERKS_">
    <Argument type="_62" location="f1:17" file="f1" line="17"/>
  </OperatorMethod>
  <Destructor id="_40" name="Payload" context="_11" access="public" location="f1:17" file="f1" line="17" inline="1" artificial="1"/>
  <FundamentalType id="_41" name="unsigned int" size="32" align="32"/>
  <Field id="_42" name="payload" type="_11" context="_13" access="public" location="f1:28" file="f1" line="28" offset="0"/>
  <Field id="_43" name="status" type="_12" context="_13" access="public" location="f1:29" file="f1" line="29" offset="32"/>
  <Constructor id="_44" name="Main" context="_13" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Constructor id="_45" name="Main" context="_13" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1">
    <Argument type="_64" location="f1:27" file="f1" line="27"/>
  </Constructor>
  <OperatorMethod id="_46" name="=" returns="_65" context="_13" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1" mangled="_ZN4MainaSERKS_">
    <Argument type="_64" location="f1:27" file="f1" line="27"/>
  </OperatorMethod>
  <Destructor id="_47" name="Main" context="_13" access="public" location="f1:27" file="f1" line="27" inline="1" artificial="1"/>
  <Field id="_48" name="isa" type="_66" context="_16" access="public" offset="0"/>
  <Field id="_49" name="flags" type="_19" context="_16" access="public" offset="64"/>
  <Field id="_50" name="str" type="_67" context="_16" access="public" offset="128"/>
  <Field id="_51" name="length" type="_68" context="_16" access="public" offset="192"/>
  <Struct id="_53" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_69 _70 _71 _72" size="192" align="64"/>
  <FundamentalType id="_54" name="double" size="64" align="64"/>
  <ReferenceType id="_55" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_56" type="_8" size="64" align="64"/>
  <ReferenceType id="_57" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_58" type="_9" size="64" align="64"/>
  <ReferenceType id="_59" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_60" type="_10" size="64" align="64"/>
  <FundamentalType id="_61" name="float" size="32" align="32"/>
  <ReferenceType id="_62" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_63" type="_11" size="64" align="64"/>
  <ReferenceType id="_64" type="_13c" size="64" align="64"/>
  <CvQualifiedType id="_13c" type="_13" const="1"/>
  <ReferenceType id="_65" type="_13" size="64" align="64"/>
  <PointerType id="_66" type="_19c" size="64" align="64"/>
  <CvQualifiedType id="_19c" type="_19" const="1"/>
  <PointerType id="_67" type="_52c" size="64" align="64"/>
  <CvQualifiedType id="_52c" type="_52" const="1"/>
  <FundamentalType id="_68" name="long int" size="64" align="64"/>
  <Field id="_69" name="gp_offset" type="_41" context="_53" access="public" offset="0"/>
  <Field id="_70" name="fp_offset" type="_41" context="_53" access="public" offset="32"/>
  <Field id="_71" name="overflow_arg_area" type="_73" context="_53" access="public" offset="64"/>
  <Field id="_72" name="reg_save_area" type="_73" context="_53" access="public" offset="128"/>
  <PointerType id="_73" type="_74" size="64" align="64"/>
  <FundamentalType id="_52" name="char" size="8" align="8"/>
  <FundamentalType id="_74" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/connected_filter.h"/>
</CastXML>
