<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Holey" context="_1" location="f1:4" file="f1" line="4" members="_15 _16 _17 _18 _19 _20 _21" size="96" align="32"/>
  <Struct id="_8" name="Packed" context="_1" location="f1:11" file="f1" line="11" members="_22 _23 _24 _25 _26 _27 _28" size="128" align="64"/>
  <Struct id="_9" name="MultiHoles" context="_1" location="f1:18" file="f1" line="18" members="_29 _30 _31 _32 _33 _34 _35 _36" size="96" align="32"/>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_37 _38 _39 _40" size="256" align="64"/>
  <PointerType id="_13" type="_41" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_42"/>
  <Field id="_15" name="a" type="_41" context="_7" access="public" location="f1:5" file="f1" line="5" offset="0"/>
  <Field id="_16" name="b" type="_43" context="_7" access="public" location="f1:6" file="f1" line="6" offset="32"/>
  <Field id="_17" name="c" type="_44" context="_7" access="public" location="f1:7" file="f1" line="7" offset="64"/>
  <Constructor id="_18" name="Holey" context="_7" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Constructor id="_19" name="Holey" context="_7" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1">
    <Argument type="_45" location="f1:4" file="f1" line="4"/>
  </Constructor>
  <OperatorMethod id="_20" name="=" returns="_46" context="_7" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1" mangled="_ZN5HoleyaSERKS_">
    <Argument type="_45" location="f1:4" file="f1" line="4"/>
  </OperatorMethod>
  <Destructor id="_21" name="Holey" context="_7" access="public" location="f1:4" file="f1" line="4" inline="1" artificial="1"/>
  <Field id="_22" name="x" type="_43" context="_8" access="public" location="f1:12" file="f1" line="12" offset="0"/>
  <Field id="_23" name="y" type="_47" context="_8" access="public" location="f1:13" file="f1" line="13" offset="32"/>
  <Field id="_24" name="z" type="_48" context="_8" access="public" location="f1:14" file="f1" line="14" offset="64"/>
  <Constructor id="_25" name="Packed" context="_8" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Constructor id="_26" name="Packed" context="_8" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1">
    <Argument type="_49" location="f1:11" file="f1" line="11"/>
  </Constructor>
  <OperatorMethod id="_27" name="=" returns="_50" context="_8" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1" mangled="_ZN6PackedaSERKS_">
    <Argument type="_49" location="f1:11" file="f1" line="11"/>
  </OperatorMethod>
  <Destructor id="_28" name="Packed" context="_8" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Field id="_29" name="a" type="_41" context="_9" access="public" location="f1:19" file="f1" line="19" offset="0"/>
  <Field id="_30" name="b" type="_44" context="_9" access="public" location="f1:20" file="f1" line="20" offset="16"/>
  <Field id="_31" name="c" type="_41" context="_9" access="public" location="f1:21" file="f1" line="21" offset="32"/>
  <Field id="_32" name="d" type="_43" context="_9" access="public" location="f1:22" file="f1" line="22" offset="64"/>
  <Constructor id="_33" name="MultiHoles" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Constructor id="_34" name="MultiHoles" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1">
    <Argument type="_51" location="f1:18" file="f1" line="18"/>
  </Constructor>
  <OperatorMethod id="_35" name="=" returns="_52" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1" mangled="_ZN10MultiHolesaSERKS_">
    <Argument type="_51" location="f1:18" file="f1" line="18"/>
  </OperatorMethod>
  <Destructor id="_36" name="MultiHoles" context="_9" access="public" location="f1:18" file="f1" line="18" inline="1" artificial="1"/>
  <Field id="_37" name="isa" type="_53" context="_12" access="public" offset="0"/>
  <Field id="_38" name="flags" type="_43" context="_12" access="public" offset="64"/>
  <Field id="_39" name="str" type="_54" context="_12" access="public" offset="128"/>
  <Field id="_40" name="length" type="_55" context="_12" access="public" offset="192"/>
  <FundamentalType id="_41" name="char" size="8" align="8"/>
  <Struct id="_42" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_56 _57 _58 _59" size="192" align="64"/>
  <FundamentalType id="_43" name="int" size="32" align="32"/>
  <FundamentalType id="_44" name="short int" size="16" align="16"/>
  <ReferenceType id="_45" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_46" type="_7" size="64" align="64"/>
  <FundamentalType id="_47" name="float" size="32" align="32"/>
  <FundamentalType id="_48" name="double" size="64" align="64"/>
  <ReferenceType id="_49" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_50" type="_8" size="64" align="64"/>
  <ReferenceType id="_51" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_52" type="_9" size="64" align="64"/>
  <PointerType id="_53" type="_43c" size="64" align="64"/>
  <CvQualifiedType id="_43c" type="_43" const="1"/>
  <PointerType id="_54" type="_41c" size="64" align="64"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <FundamentalType id="_55" name="long int" size="64" align="64"/>
  <Field id="_56" name="gp_offset" type="_60" context="_42" access="public" offset="0"/>
  <Field id="_57" name="fp_offset" type="_60" context="_42" access="public" offset="32"/>
  <Field id="_58" name="overflow_arg_area" type="_61" context="_42" access="public" offset="64"/>
  <Field id="_59" name="reg_save_area" type="_61" context="_42" access="public" offset="128"/>
  <FundamentalType id="_60" name="unsigned int" size="32" align="32"/>
  <PointerType id="_61" type="_62" size="64" align="64"/>
  <FundamentalType id="_62" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/holes_real.h"/>
</CastXML>
