<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102"/>
  <Typedef id="_2" name="__int128_t" type="_103" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_104" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_105" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_106" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_107" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_7" name="__u_char" type="_108" context="_1" location="f1:31" file="f1" line="31"/>
  <Typedef id="_8" name="__u_short" type="_109" context="_1" location="f1:32" file="f1" line="32"/>
  <Typedef id="_9" name="__u_int" type="_110" context="_1" location="f1:33" file="f1" line="33"/>
  <Typedef id="_10" name="__u_long" type="_111" context="_1" location="f1:34" file="f1" line="34"/>
  <Typedef id="_11" name="__int8_t" type="_112" context="_1" location="f1:37" file="f1" line="37"/>
  <Typedef id="_12" name="__uint8_t" type="_108" context="_1" location="f1:38" file="f1" line="38"/>
  <Typedef id="_13" name="__int16_t" type="_113" context="_1" location="f1:39" file="f1" line="39"/>
  <Typedef id="_14" name="__uint16_t" type="_109" context="_1" location="f1:40" file="f1" line="40"/>
  <Typedef id="_15" name="__int32_t" type="_114" context="_1" location="f1:41" file="f1" line="41"/>
  <Typedef id="_16" name="__uint32_t" type="_110" context="_1" location="f1:42" file="f1" line="42"/>
  <Typedef id="_17" name="__int64_t" type="_115" context="_1" location="f1:44" file="f1" line="44"/>
  <Typedef id="_18" name="__uint64_t" type="_111" context="_1" location="f1:45" file="f1" line="45"/>
  <Typedef id="_19" name="__int_least8_t" type="_11" context="_1" location="f1:52" file="f1" line="52"/>
  <Typedef id="_20" name="__uint_least8_t" type="_12" context="_1" location="f1:53" file="f1" line="53"/>
  <Typedef id="_21" name="__int_least16_t" type="_13" context="_1" location="f1:54" file="f1" line="54"/>
  <Typedef id="_22" name="__uint_least16_t" type="_14" context="_1" location="f1:55" file="f1" line="55"/>
  <Typedef id="_23" name="__int_least32_t" type="_15" context="_1" location="f1:56" file="f1" line="56"/>
  <Typedef id="_24" name="__uint_least32_t" type="_16" context="_1" location="f1:57" file="f1" line="57"/>
  <Typedef id="_25" name="__int_least64_t" type="_17" context="_1" location="f1:58" file="f1" line="58"/>
  <Typedef id="_26" name="__uint_least64_t" type="_18" context="_1" location="f1:59" file="f1" line="59"/>
  <Typedef id="_27" name="__quad_t" type="_115" context="_1" location="f1:63" file="f1" line="63"/>
  <Typedef id="_28" name="__u_quad_t" type="_111" context="_1" location="f1:64" file="f1" line="64"/>
  <Typedef id="_29" name="__intmax_t" type="_115" context="_1" location="f1:72" file="f1" line="72"/>
  <Typedef id="_30" name="__uintmax_t" type="_111" context="_1" location="f1:73" file="f1" line="73"/>
  <Typedef id="_31" name="__dev_t" type="_111" context="_1" location="f1:145" file="f1" line="145"/>
  <Typedef id="_32" name="__uid_t" type="_110" context="_1" location="f1:146" file="f1" line="146"/>
  <Typedef id="_33" name="__gid_t" type="_110" context="_1" location="f1:147" file="f1" line="147"/>
  <Typedef id="_34" name="__ino_t" type="_111" context="_1" location="f1:148" file="f1" line="148"/>
  <Typedef id="_35" name="__ino64_t" type="_111" context="_1" location="f1:149" file="f1" line="149"/>
  <Typedef id="_36" name="__mode_t" type="_110" context="_1" location="f1:150" file="f1" line="150"/>
  <Typedef id="_37" name="__nlink_t" type="_111" context="_1" location="f1:151" file="f1" line="151"/>
  <Typedef id="_38" name="__off_t" type="_115" context="_1" location="f1:152" file="f1" line="152"/>
  <Typedef id="_39" name="__off64_t" type="_115" context="_1" location="f1:153" file="f1" line="153"/>
  <Typedef id="_40" name="__pid_t" type="_114" context="_1" location="f1:154" file="f1" line="154"/>
  <Struct id="_41" name="" context="_1" location="f1:155" file="f1" line="155" members="_116 _117 _118 _119 _120" size="64" align="32"/>
  <Typedef id="_42" name="__fsid_t" type="_121" context="_1" location="f1:155" file="f1" line="155"/>
  <Typedef id="_43" name="__clock_t" type="_115" context="_1" location="f1:156" file="f1" line="156"/>
  <Typedef id="_44" name="__rlim_t" type="_111" context="_1" location="f1:157" file="f1" line="157"/>
  <Typedef id="_45" name="__rlim64_t" type="_111" context="_1" location="f1:158" file="f1" line="158"/>
  <Typedef id="_46" name="__id_t" type="_110" context="_1" location="f1:159" file="f1" line="159"/>
  <Typedef id="_47" name="__time_t" type="_115" context="_1" location="f1:160" file="f1" line="160"/>
  <Typedef id="_48" name="__useconds_t" type="_110" context="_1" location="f1:161" file="f1" line="161"/>
  <Typedef id="_49" name="__suseconds_t" type="_115" context="_1" location="f1:162" file="f1" line="162"/>
  <Typedef id="_50" name="__daddr_t" type="_114" context="_1" location="f1:164" file="f1" line="164"/>
  <Typedef id="_51" name="__key_t" type="_114" context="_1" location="f1:165" file="f1" line="165"/>
  <Typedef id="_52" name="__clockid_t" type="_114" context="_1" location="f1:168" file="f1" line="168"/>
  <Typedef id="_53" name="__timer_t" type="_122" context="_1" location="f1:171" file="f1" line="171"/>
  <Typedef id="_54" name="__blksize_t" type="_115" context="_1" location="f1:174" file="f1" line="174"/>
  <Typedef id="_55" name="__blkcnt_t" type="_115" context="_1" location="f1:179" file="f1" line="179"/>
  <Typedef id="_56" name="__blkcnt64_t" type="_115" context="_1" location="f1:180" file="f1" line="180"/>
  <Typedef id="_57" name="__fsblkcnt_t" type="_111" context="_1" location="f1:183" file="f1" line="183"/>
  <Typedef id="_58" name="__fsblkcnt64_t" type="_111" context="_1" location="f1:184" file="f1" line="184"/>
  <Typedef id="_59" name="__fsfilcnt_t" type="_111" context="_1" location="f1:187" file="f1" line="187"/>
  <Typedef id="_60" name="__fsfilcnt64_t" type="_111" context="_1" location="f1:188" file="f1" line="188"/>
  <Typedef id="_61" name="__fsword_t" type="_115" context="_1" location="f1:191" file="f1" line="191"/>
  <Typedef id="_62" name="__ssize_t" type="_115" context="_1" location="f1:193" file="f1" line="193"/>
  <Typedef id="_63" name="__syscall_slong_t" type="_115" context="_1" location="f1:196" file="f1" line="196"/>
  <Typedef id="_64" name="__syscall_ulong_t" type="_111" context="_1" location="f1:198" file="f1" line="198"/>
  <Typedef id="_65" name="__loff_t" type="_39" context="_1" location="f1:202" file="f1" line="202"/>
  <Typedef id="_66" name="__caddr_t" type="_106" context="_1" location="f1:203" file="f1" line="203"/>
  <Typedef id="_67" name="__intptr_t" type="_115" context="_1" location="f1:206" file="f1" line="206"/>
  <Typedef id="_68" name="__socklen_t" type="_110" context="_1" location="f1:209" file="f1" line="209"/>
  <Typedef id="_69" name="__sig_atomic_t" type="_114" context="_1" location="f1:214" file="f1" line="214"/>
  <Typedef id="_70" name="int8_t" type="_11" context="_1" location="f2:24" file="f2" line="24"/>
  <Typedef id="_71" name="int16_t" type="_13" context="_1" location="f2:25" file="f2" line="25"/>
  <Typedef id="_72" name="int32_t" type="_15" context="_1" location="f2:26" file="f2" line="26"/>
  <Typedef id="_73" name="int64_t" type="_17" context="_1" location="f2:27" file="f2" line="27"/>
  <Typedef id="_74" name="uint8_t" type="_12" context="_1" location="f3:24" file="f3" line="24"/>
  <Typedef id="_75" name="uint16_t" type="_14" context="_1" location="f3:25" file="f3" line="25"/>
  <Typedef id="_76" name="uint32_t" type="_16" context="_1" location="f3:26" file="f3" line="26"/>
  <Typedef id="_77" name="uint64_t" type="_18" context="_1" location="f3:27" file="f3" line="27"/>
  <Typedef id="_78" name="int_least8_t" type="_19" context="_1" location="f4:43" file="f4" line="43"/>
  <Typedef id="_79" name="int_least16_t" type="_21" context="_1" location="f4:44" file="f4" line="44"/>
  <Typedef id="_80" name="int_least32_t" type="_23" context="_1" location="f4:45" file="f4" line="45"/>
  <Typedef id="_81" name="int_least64_t" type="_25" context="_1" location="f4:46" file="f4" line="46"/>
  <Typedef id="_82" name="uint_least8_t" type="_20" context="_1" location="f4:49" file="f4" line="49"/>
  <Typedef id="_83" name="uint_least16_t" type="_22" context="_1" location="f4:50" file="f4" line="50"/>
  <Typedef id="_84" name="uint_least32_t" type="_24" context="_1" location="f4:51" file="f4" line="51"/>
  <Typedef id="_85" name="uint_least64_t" type="_26" context="_1" location="f4:52" file="f4" line="52"/>
  <Typedef id="_86" name="int_fast8_t" type="_112" context="_1" location="f4:58" file="f4" line="58"/>
  <Typedef id="_87" name="int_fast16_t" type="_115" context="_1" location="f4:60" file="f4" line="60"/>
  <Typedef id="_88" name="int_fast32_t" type="_115" context="_1" location="f4:61" file="f4" line="61"/>
  <Typedef id="_89" name="int_fast64_t" type="_115" context="_1" location="f4:62" file="f4" line="62"/>
  <Typedef id="_90" name="uint_fast8_t" type="_108" context="_1" location="f4:71" file="f4" line="71"/>
  <Typedef id="_91" name="uint_fast16_t" type="_111" context="_1" location="f4:73" file="f4" line="73"/>
  <Typedef id="_92" name="uint_fast32_t" type="_111" context="_1" location="f4:74" file="f4" line="74"/>
  <Typedef id="_93" name="uint_fast64_t" type="_111" context="_1" location="f4:75" file="f4" line="75"/>
  <Typedef id="_94" name="intptr_t" type="_115" context="_1" location="f4:87" file="f4" line="87"/>
  <Typedef id="_95" name="uintptr_t" type="_111" context="_1" location="f4:90" file="f4" line="90"/>
  <Typedef id="_96" name="intmax_t" type="_29" context="_1" location="f4:101" file="f4" line="101"/>
  <Typedef id="_97" name="uintmax_t" type="_30" context="_1" location="f4:102" file="f4" line="102"/>
  <Struct id="_98" name="DefaultAlign" context="_1" location="f5:6" file="f5" line="6" members="_123 _124 _125 _126 _127 _128" size="64" align="32"/>
  <Struct id="_99" name="Packed1" context="_1" location="f5:13" file="f5" line="13" members="_129 _130 _131 _132 _133 _134" size="40" align="8"/>
  <Struct id="_100" name="Packed2" context="_1" location="f5:21" file="f5" line="21" members="_135 _136 _137 _138 _139 _140" size="48" align="16"/>
  <Struct id="_101" name="Packed4" context="_1" location="f5:29" file="f5" line="29" members="_141 _142 _143 _144 _145 _146" size="64" align="32"/>
  <Function id="_102" name="__builtin_memcpy" returns="_122" context="_1" location="f1:155" file="f1" line="155" extern="1" artificial="1" mangled="_Z16__builtin_memcpy">
    <Argument type="_122"/>
    <Argument type="_147"/>
    <Argument type="_111"/>
  </Function>
  <FundamentalType id="_103" name="__int128" size="128" align="128"/>
  <FundamentalType id="_104" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_105" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_148 _149 _150 _151" size="256" align="64"/>
  <PointerType id="_106" type="_152" size="64" align="64"/>
  <ArrayType id="_107" min="0" max="0" type="_153"/>
  <FundamentalType id="_108" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_109" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_110" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_111" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_112" name="signed char" size="8" align="8"/>
  <FundamentalType id="_113" name="short int" size="16" align="16"/>
  <FundamentalType id="_114" name="int" size="32" align="32"/>
  <FundamentalType id="_115" name="long int" size="64" align="64"/>
  <Field id="_116" name="__val" type="_154" context="_41" access="public" location="f1:155" file="f1" line="155" offset="0"/>
  <Constructor id="_117" name="" context="_41" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1"/>
  <Constructor id="_118" name="" context="_41" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1">
    <Argument type="_155" location="f1:155" file="f1" line="155"/>
  </Constructor>
  <OperatorMethod id="_119" name="=" returns="_156" context="_41" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1" mangled="_ZN8__fsid_taSERKS_">
    <Argument type="_155" location="f1:155" file="f1" line="155"/>
  </OperatorMethod>
  <Destructor id="_120" name="" context="_41" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1"/>
  <ElaboratedType id="_121" type="_41"/>
  <PointerType id="_122" type="_157" size="64" align="64"/>
  <Field id="_123" name="a" type="_74" context="_98" access="public" location="f5:7" file="f5" line="7" offset="0"/>
  <Field id="_124" name="b" type="_76" context="_98" access="public" location="f5:8" file="f5" line="8" offset="32"/>
  <Constructor id="_125" name="DefaultAlign" context="_98" access="public" location="f5:6" file="f5" line="6" inline="1" artificial="1"/>
  <Constructor id="_126" name="DefaultAlign" context="_98" access="public" location="f5:6" file="f5" line="6" inline="1" artificial="1">
    <Argument type="_158" location="f5:6" file="f5" line="6"/>
  </Constructor>
  <OperatorMethod id="_127" name="=" returns="_159" context="_98" access="public" location="f5:6" file="f5" line="6" inline="1" artificial="1" mangled="_ZN12DefaultAlignaSERKS_">
    <Argument type="_158" location="f5:6" file="f5" line="6"/>
  </OperatorMethod>
  <Destructor id="_128" name="DefaultAlign" context="_98" access="public" location="f5:6" file="f5" line="6" inline="1" artificial="1"/>
  <Field id="_129" name="a" type="_74" context="_99" access="public" location="f5:14" file="f5" line="14" offset="0"/>
  <Field id="_130" name="b" type="_76" context="_99" access="public" location="f5:15" file="f5" line="15" offset="8"/>
  <Constructor id="_131" name="Packed1" context="_99" access="public" location="f5:13" file="f5" line="13" inline="1" artificial="1"/>
  <Constructor id="_132" name="Packed1" context="_99" access="public" location="f5:13" file="f5" line="13" inline="1" artificial="1">
    <Argument type="_160" location="f5:13" file="f5" line="13"/>
  </Constructor>
  <OperatorMethod id="_133" name="=" returns="_161" context="_99" access="public" location="f5:13" file="f5" line="13" inline="1" artificial="1" mangled="_ZN7Packed1aSERKS_">
    <Argument type="_160" location="f5:13" file="f5" line="13"/>
  </OperatorMethod>
  <Destructor id="_134" name="Packed1" context="_99" access="public" location="f5:13" file="f5" line="13" inline="1" artificial="1"/>
  <Field id="_135" name="a" type="_74" context="_100" access="public" location="f5:22" file="f5" line="22" offset="0"/>
  <Field id="_136" name="b" type="_76" context="_100" access="public" location="f5:23" file="f5" line="23" offset="16"/>
  <Constructor id="_137" name="Packed2" context="_100" access="public" location="f5:21" file="f5" line="21" inline="1" artificial="1"/>
  <Constructor id="_138" name="Packed2" context="_100" access="public" location="f5:21" file="f5" line="21" inline="1" artificial="1">
    <Argument type="_162" location="f5:21" file="f5" line="21"/>
  </Constructor>
  <OperatorMethod id="_139" name="=" returns="_163" context="_100" access="public" location="f5:21" file="f5" line="21" inline="1" artificial="1" mangled="_ZN7Packed2aSERKS_">
    <Argument type="_162" location="f5:21" file="f5" line="21"/>
  </OperatorMethod>
  <Destructor id="_140" name="Packed2" context="_100" access="public" location="f5:21" file="f5" line="21" inline="1" artificial="1"/>
  <Field id="_141" name="a" type="_74" context="_101" access="public" location="f5:30" file="f5" line="30" offset="0"/>
  <Field id="_142" name="b" type="_76" context="_101" access="public" location="f5:31" file="f5" line="31" offset="32"/>
  <Constructor id="_143" name="Packed4" context="_101" access="public" location="f5:29" file="f5" line="29" inline="1" artificial="1"/>
  <Constructor id="_144" name="Packed4" context="_101" access="public" location="f5:29" file="f5" line="29" inline="1" artificial="1">
    <Argument type="_164" location="f5:29" file="f5" line="29"/>
  </Constructor>
  <OperatorMethod id="_145" name="=" returns="_165" context="_101" access="public" location="f5:29" file="f5" line="29" inline="1" artificial="1" mangled="_ZN7Packed4aSERKS_">
    <Argument type="_164" location="f5:29" file="f5" line="29"/>
  </OperatorMethod>
  <Destructor id="_146" name="Packed4" context="_101" access="public" location="f5:29" file="f5" line="29" inline="1" artificial="1"/>
  <PointerType id="_147" type="_157c" size="64" align="64"/>
  <Field id="_148" name="isa" type="_166" context="_105" access="public" offset="0"/>
  <Field id="_149" name="flags" type="_114" context="_105" access="public" offset="64"/>
  <Field id="_150" name="str" type="_167" context="_105" access="public" offset="128"/>
  <Field id="_151" name="length" type="_115" context="_105" access="public" offset="192"/>
  <Struct id="_153" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_168 _169 _170 _171" size="192" align="64"/>
  <ArrayType id="_154" min="0" max="1" type="_114"/>
  <ReferenceType id="_155" type="_41c" size="64" align="64"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <ReferenceType id="_156" type="_41" size="64" align="64"/>
  <CvQualifiedType id="_157c" type="_157" const="1"/>
  <ReferenceType id="_158" type="_98c" size="64" align="64"/>
  <CvQualifiedType id="_98c" type="_98" const="1"/>
  <ReferenceType id="_159" type="_98" size="64" align="64"/>
  <ReferenceType id="_160" type="_99c" size="64" align="64"/>
  <CvQualifiedType id="_99c" type="_99" const="1"/>
  <ReferenceType id="_161" type="_99" size="64" align="64"/>
  <ReferenceType id="_162" type="_100c" size="64" align="64"/>
  <CvQualifiedType id="_100c" type="_100" const="1"/>
  <ReferenceType id="_163" type="_100" size="64" align="64"/>
  <ReferenceType id="_164" type="_101c" size="64" align="64"/>
  <CvQualifiedType id="_101c" type="_101" const="1"/>
  <ReferenceType id="_165" type="_101" size="64" align="64"/>
  <PointerType id="_166" type="_114c" size="64" align="64"/>
  <CvQualifiedType id="_114c" type="_114" const="1"/>
  <PointerType id="_167" type="_152c" size="64" align="64"/>
  <CvQualifiedType id="_152c" type="_152" const="1"/>
  <Field id="_168" name="gp_offset" type="_110" context="_153" access="public" offset="0"/>
  <Field id="_169" name="fp_offset" type="_110" context="_153" access="public" offset="32"/>
  <Field id="_170" name="overflow_arg_area" type="_122" context="_153" access="public" offset="64"/>
  <Field id="_171" name="reg_save_area" type="_122" context="_153" access="public" offset="128"/>
  <FundamentalType id="_152" name="char" size="8" align="8"/>
  <FundamentalType id="_157" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f2" name="/usr/include/x86_64-linux-gnu/bits/stdint-intn.h"/>
  <File id="f3" name="/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h"/>
  <File id="f4" name="/usr/include/stdint.h"/>
  <File id="f5" name="/home/eranbu/projects/castxml/headers/packing.h"/>
</CastXML>
