<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13"/>
  <Typedef id="_2" name="__int128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_18" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_7" name="MyInt" type="_19" context="_1" location="f1:3" file="f1" line="3"/>
  <Typedef id="_8" name="Alias1" type="_7" context="_1" location="f1:4" file="f1" line="4"/>
  <Typedef id="_9" name="Alias2" type="_8" context="_1" location="f1:5" file="f1" line="5"/>
  <Typedef id="_10" name="MyArray" type="_20" context="_1" location="f1:7" file="f1" line="7"/>
  <Typedef id="_11" name="MyArray2D" type="_21" context="_1" location="f1:8" file="f1" line="8"/>
  <Struct id="_12" name="A" context="_1" location="f1:10" file="f1" line="10" members="_22 _23 _24 _25 _26 _27 _28" size="544" align="32"/>
  <Function id="_13" name="__builtin_memcpy" returns="_29" context="_1" location="f1:10" file="f1" line="10" extern="1" artificial="1" mangled="_Z16__builtin_memcpy">
    <Argument type="_29"/>
    <Argument type="_30"/>
    <Argument type="_31"/>
  </Function>
  <FundamentalType id="_14" name="__int128" size="128" align="128"/>
  <FundamentalType id="_15" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_16" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_32 _33 _34 _35" size="256" align="64"/>
  <PointerType id="_17" type="_36" size="64" align="64"/>
  <ArrayType id="_18" min="0" max="0" type="_37"/>
  <FundamentalType id="_19" name="int" size="32" align="32"/>
  <ArrayType id="_20" min="0" max="3" type="_38"/>
  <ArrayType id="_21" min="0" max="2" type="_10"/>
  <Field id="_22" name="value" type="_9" context="_12" access="public" location="f1:11" file="f1" line="11" offset="0"/>
  <Field id="_23" name="arr1" type="_10" context="_12" access="public" location="f1:12" file="f1" line="12" offset="32"/>
  <Field id="_24" name="arr2" type="_11" context="_12" access="public" location="f1:13" file="f1" line="13" offset="160"/>
  <Constructor id="_25" name="A" context="_12" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1"/>
  <Constructor id="_26" name="A" context="_12" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1">
    <Argument type="_39" location="f1:10" file="f1" line="10"/>
  </Constructor>
  <OperatorMethod id="_27" name="=" returns="_40" context="_12" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1" mangled="_ZN1AaSERKS_">
    <Argument type="_39" location="f1:10" file="f1" line="10"/>
  </OperatorMethod>
  <Destructor id="_28" name="A" context="_12" access="public" location="f1:10" file="f1" line="10" inline="1" artificial="1"/>
  <PointerType id="_29" type="_41" size="64" align="64"/>
  <PointerType id="_30" type="_41c" size="64" align="64"/>
  <FundamentalType id="_31" name="long unsigned int" size="64" align="64"/>
  <Field id="_32" name="isa" type="_42" context="_16" access="public" offset="0"/>
  <Field id="_33" name="flags" type="_19" context="_16" access="public" offset="64"/>
  <Field id="_34" name="str" type="_43" context="_16" access="public" offset="128"/>
  <Field id="_35" name="length" type="_44" context="_16" access="public" offset="192"/>
  <Struct id="_37" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_45 _46 _47 _48" size="192" align="64"/>
  <FundamentalType id="_38" name="float" size="32" align="32"/>
  <ReferenceType id="_39" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_40" type="_12" size="64" align="64"/>
  <CvQualifiedType id="_41c" type="_41" const="1"/>
  <PointerType id="_42" type="_19c" size="64" align="64"/>
  <CvQualifiedType id="_19c" type="_19" const="1"/>
  <PointerType id="_43" type="_36c" size="64" align="64"/>
  <CvQualifiedType id="_36c" type="_36" const="1"/>
  <FundamentalType id="_44" name="long int" size="64" align="64"/>
  <Field id="_45" name="gp_offset" type="_49" context="_37" access="public" offset="0"/>
  <Field id="_46" name="fp_offset" type="_49" context="_37" access="public" offset="32"/>
  <Field id="_47" name="overflow_arg_area" type="_29" context="_37" access="public" offset="64"/>
  <Field id="_48" name="reg_save_area" type="_29" context="_37" access="public" offset="128"/>
  <FundamentalType id="_49" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_36" name="char" size="8" align="8"/>
  <FundamentalType id="_41" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/typedef_remove.h"/>
</CastXML>
