<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8"/>
  <Typedef id="_2" name="__int128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="Holey" context="_1" location="f1:2" file="f1" line="2" members="_14 _15 _16 _17 _18 _19 _20" size="32" align="32"/>
  <Struct id="_8" name="Packed" context="_1" location="f1:8" file="f1" line="8" members="_21 _22 _23 _24 _25 _26" size="32" align="32"/>
  <FundamentalType id="_9" name="__int128" size="128" align="128"/>
  <FundamentalType id="_10" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_11" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_27 _28 _29 _30" size="256" align="64"/>
  <PointerType id="_12" type="_31" size="64" align="64"/>
  <ArrayType id="_13" min="0" max="0" type="_32"/>
  <Field id="_14" name="a" type="_33" bits="3" context="_7" access="public" location="f1:3" file="f1" line="3" offset="0"/>
  <Field id="_15" name="b" type="_33" bits="5" context="_7" access="public" location="f1:4" file="f1" line="4" offset="3"/>
  <Field id="_16" name="c" type="_33" bits="1" context="_7" access="public" location="f1:5" file="f1" line="5" offset="8"/>
  <Constructor id="_17" name="Holey" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Constructor id="_18" name="Holey" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1">
    <Argument type="_34" location="f1:2" file="f1" line="2"/>
  </Constructor>
  <OperatorMethod id="_19" name="=" returns="_35" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1" mangled="_ZN5HoleyaSERKS_">
    <Argument type="_34" location="f1:2" file="f1" line="2"/>
  </OperatorMethod>
  <Destructor id="_20" name="Holey" context="_7" access="public" location="f1:2" file="f1" line="2" inline="1" artificial="1"/>
  <Field id="_21" name="x" type="_33" bits="2" context="_8" access="public" location="f1:9" file="f1" line="9" offset="0"/>
  <Field id="_22" name="y" type="_33" bits="6" context="_8" access="public" location="f1:10" file="f1" line="10" offset="2"/>
  <Constructor id="_23" name="Packed" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1"/>
  <Constructor id="_24" name="Packed" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1">
    <Argument type="_36" location="f1:8" file="f1" line="8"/>
  </Constructor>
  <OperatorMethod id="_25" name="=" returns="_37" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1" mangled="_ZN6PackedaSERKS_">
    <Argument type="_36" location="f1:8" file="f1" line="8"/>
  </OperatorMethod>
  <Destructor id="_26" name="Packed" context="_8" access="public" location="f1:8" file="f1" line="8" inline="1" artificial="1"/>
  <Field id="_27" name="isa" type="_38" context="_11" access="public" offset="0"/>
  <Field id="_28" name="flags" type="_39" context="_11" access="public" offset="64"/>
  <Field id="_29" name="str" type="_40" context="_11" access="public" offset="128"/>
  <Field id="_30" name="length" type="_41" context="_11" access="public" offset="192"/>
  <Struct id="_32" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_42 _43 _44 _45" size="192" align="64"/>
  <FundamentalType id="_33" name="unsigned int" size="32" align="32"/>
  <ReferenceType id="_34" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_35" type="_7" size="64" align="64"/>
  <ReferenceType id="_36" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_37" type="_8" size="64" align="64"/>
  <PointerType id="_38" type="_39c" size="64" align="64"/>
  <FundamentalType id="_39" name="int" size="32" align="32"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <PointerType id="_40" type="_31c" size="64" align="64"/>
  <CvQualifiedType id="_31c" type="_31" const="1"/>
  <FundamentalType id="_41" name="long int" size="64" align="64"/>
  <Field id="_42" name="gp_offset" type="_33" context="_32" access="public" offset="0"/>
  <Field id="_43" name="fp_offset" type="_33" context="_32" access="public" offset="32"/>
  <Field id="_44" name="overflow_arg_area" type="_46" context="_32" access="public" offset="64"/>
  <Field id="_45" name="reg_save_area" type="_46" context="_32" access="public" offset="128"/>
  <PointerType id="_46" type="_47" size="64" align="64"/>
  <FundamentalType id="_31" name="char" size="8" align="8"/>
  <FundamentalType id="_47" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/eranbu/projects/castxml/headers/bitfield_holes.h"/>
</CastXML>
