<?xml version="1.0"?>
<CastXML format="1.2.1">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110"/>
  <Typedef id="_2" name="__int128_t" type="_111" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_112" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_113" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_114" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_115" context="_1" location="f0:0" file="f0" line="0"/>
  <Namespace id="_7" name="std" context="_1" members="_72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _103 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141"/>
  <Namespace id="_8" name="__gnu_cxx" context="_1"/>

  <FundamentalType id="_112" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_113" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_174 _175 _176 _177" size="256" align="64"/>
  <PointerType id="_114" type="_169" size="64" align="64"/>
  <ArrayType id="_115" min="0" max="0" type="_178"/>
  <Typedef id="_116" name="size_t" type="_145" context="_7" location="f8:258" file="f8" line="258"/>
  <Typedef id="_117" name="ptrdiff_t" type="_149" context="_7" location="f8:259" file="f8" line="259"/>
  <Typedef id="_118" name="nullptr_t" type="_179" context="_7" location="f8:262" file="f8" line="262"/>
  <Enumeration id="_119" name="byte" type="_142" context="_7" location="f9:69" file="f9" line="69" scoped="1" size="8" align="8"/>
  <Struct id="_120" name="__byte_operand&lt;bool&gt;" context="_7" location="f9:72" file="f9" line="72" members="_180 _181 _182 _183 _184" size="8" align="8"/>
  <Struct id="_121" name="__byte_operand&lt;char&gt;" context="_7" location="f9:73" file="f9" line="73" members="_185 _186 _187 _188 _189" size="8" align="8"/>
  <Struct id="_122" name="__byte_operand&lt;signed char&gt;" context="_7" location="f9:74" file="f9" line="74" members="_190 _191 _192 _193 _194" size="8" align="8"/>
  <Struct id="_123" name="__byte_operand&lt;unsigned char&gt;" context="_7" location="f9:75" file="f9" line="75" members="_195 _196 _197 _198 _199" size="8" align="8"/>
  <Struct id="_124" name="__byte_operand&lt;wchar_t&gt;" context="_7" location="f9:77" file="f9" line="77" members="_200 _201 _202 _203 _204" size="8" align="8"/>
  <Struct id="_125" name="__byte_operand&lt;char16_t&gt;" context="_7" location="f9:82" file="f9" line="82" members="_205 _206 _207 _208 _209" size="8" align="8"/>
  <Struct id="_126" name="__byte_operand&lt;char32_t&gt;" context="_7" location="f9:83" file="f9" line="83" members="_210 _211 _212 _213 _214" size="8" align="8"/>
  <Struct id="_127" name="__byte_operand&lt;short&gt;" context="_7" location="f9:84" file="f9" line="84" members="_215 _216 _217 _218 _219" size="8" align="8"/>
  <Struct id="_128" name="__byte_operand&lt;unsigned short&gt;" context="_7" location="f9:85" file="f9" line="85" members="_220 _221 _222 _223 _224" size="8" align="8"/>
  <Struct id="_129" name="__byte_operand&lt;int&gt;" context="_7" location="f9:86" file="f9" line="86" members="_225 _226 _227 _228 _229" size="8" align="8"/>
  <Struct id="_130" name="__byte_operand&lt;unsigned int&gt;" context="_7" location="f9:87" file="f9" line="87" members="_230 _231 _232 _233 _234" size="8" align="8"/>
  <Struct id="_131" name="__byte_operand&lt;long&gt;" context="_7" location="f9:88" file="f9" line="88" members="_235 _236 _237 _238 _239" size="8" align="8"/>
  <Struct id="_132" name="__byte_operand&lt;unsigned long&gt;" context="_7" location="f9:89" file="f9" line="89" members="_240 _241 _242 _243 _244" size="8" align="8"/>
  <Struct id="_133" name="__byte_operand&lt;long long&gt;" context="_7" location="f9:90" file="f9" line="90" members="_245 _246 _247 _248 _249" size="8" align="8"/>
  <Struct id="_134" name="__byte_operand&lt;unsigned long long&gt;" context="_7" location="f9:91" file="f9" line="91" members="_250 _251 _252 _253 _254" size="8" align="8"/>
  <OperatorFunction id="_135" name="|=" returns="_255" context="_7" location="f9:144" file="f9" line="144" inline="1" mangled="_ZStoRRSt4byteS_">
    <Argument name="__l" type="_255" location="f9:144" file="f9" line="144"/>
    <Argument name="__r" type="_119" location="f9:144" file="f9" line="144"/>
  </OperatorFunction>
  <OperatorFunction id="_136" name="|" returns="_119" context="_7" location="f9:151" file="f9" line="151" inline="1" mangled="_ZStorSt4byteS_">
    <Argument name="__l" type="_119" location="f9:151" file="f9" line="151"/>
    <Argument name="__r" type="_119" location="f9:151" file="f9" line="151"/>
  </OperatorFunction>
  <OperatorFunction id="_137" name="&amp;=" returns="_255" context="_7" location="f9:158" file="f9" line="158" inline="1" mangled="_ZStaNRSt4byteS_">
    <Argument name="__l" type="_255" location="f9:158" file="f9" line="158"/>
    <Argument name="__r" type="_119" location="f9:158" file="f9" line="158"/>
  </OperatorFunction>
  <OperatorFunction id="_138" name="&amp;" returns="_119" context="_7" location="f9:165" file="f9" line="165" inline="1" mangled="_ZStanSt4byteS_">
    <Argument name="__l" type="_119" location="f9:165" file="f9" line="165"/>
    <Argument name="__r" type="_119" location="f9:165" file="f9" line="165"/>
  </OperatorFunction>
  <OperatorFunction id="_139" name="^=" returns="_255" context="_7" location="f9:172" file="f9" line="172" inline="1" mangled="_ZSteORSt4byteS_">
    <Argument name="__l" type="_255" location="f9:172" file="f9" line="172"/>
    <Argument name="__r" type="_119" location="f9:172" file="f9" line="172"/>
  </OperatorFunction>
  <OperatorFunction id="_140" name="^" returns="_119" context="_7" location="f9:179" file="f9" line="179" inline="1" mangled="_ZSteoSt4byteS_">
    <Argument name="__l" type="_119" location="f9:179" file="f9" line="179"/>
    <Argument name="__r" type="_119" location="f9:179" file="f9" line="179"/>
  </OperatorFunction>
  <OperatorFunction id="_141" name="~" returns="_119" context="_7" location="f9:186" file="f9" line="186" inline="1" mangled="_ZStcoSt4byte">
    <Argument name="__b" type="_119" location="f9:186" file="f9" line="186"/>
  </OperatorFunction>
  <FundamentalType id="_142" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_143" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_144" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_145" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_146" name="signed char" size="8" align="8"/>
  <FundamentalType id="_147" name="short int" size="16" align="16"/>
  <FundamentalType id="_148" name="int" size="32" align="32"/>
  <CvQualifiedType id="_148c" type="_148" const="1"/>
  <FundamentalType id="_149" name="long int" size="64" align="64"/>
  <Field id="_150" name="__val" type="_256" context="_43" access="public" location="f1:155" file="f1" line="155" offset="0"/>
  <Constructor id="_151" name="" context="_43" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1"/>
  <Constructor id="_152" name="" context="_43" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1">
    <Argument type="_257" location="f1:155" file="f1" line="155"/>
  </Constructor>
  <OperatorMethod id="_153" name="=" returns="_258" context="_43" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1" mangled="_ZN8__fsid_taSERKS_">
    <Argument type="_257" location="f1:155" file="f1" line="155"/>
  </OperatorMethod>
  <Destructor id="_154" name="" context="_43" access="public" location="f1:155" file="f1" line="155" inline="1" artificial="1"/>
  <ElaboratedType id="_155" type="_43"/>
  <PointerType id="_156" type="_259" size="64" align="64"/>
  <Field id="_157" name="__clang_max_align_nonce1" type="_260" context="_102" access="public" location="f6:20" file="f6" line="20" offset="0"/>
  <Field id="_158" name="__clang_max_align_nonce2" type="_261" context="_102" access="public" location="f6:22" file="f6" line="22" offset="128"/>
  <Constructor id="_159" name="" context="_102" access="public" location="f6:19" file="f6" line="19" inline="1" artificial="1"/>
  <Constructor id="_160" name="" context="_102" access="public" location="f6:19" file="f6" line="19" inline="1" artificial="1">
    <Argument type="_262" location="f6:19" file="f6" line="19"/>
  </Constructor>
  <OperatorMethod id="_161" name="=" returns="_263" context="_102" access="public" location="f6:19" file="f6" line="19" inline="1" artificial="1" mangled="_ZN11max_align_taSERKS_">
    <Argument type="_262" location="f6:19" file="f6" line="19"/>
  </OperatorMethod>
  <Destructor id="_162" name="" context="_102" access="public" location="f6:19" file="f6" line="19" inline="1" artificial="1"/>
  <ElaboratedType id="_163" type="_102"/>
  <Enumeration id="_164" name="Color" type="_77" context="_104" location="f7:11" file="f7" line="11" scoped="1" size="16" align="16">
    <EnumValue name="Red" init="1"/>
    <EnumValue name="Green" init="2"/>
    <EnumValue name="Blue" init="255"/>
  </Enumeration>
  <Typedef id="_165" name="CustomInt" type="_74" context="_104" location="f7:17" file="f7" line="17"/>
  <Namespace id="_166" name="InnerNamespace" context="_104" members="_264 _265 _266 _267"/>
  <Struct id="_167" name="Container" context="_104" location="f7:91" file="f7" line="91" members="_268 _269 _270 _271 _272 _273 _274 _275 _276 _277 _278" size="8320" align="64"/>
  <Typedef id="_168" name="ContainerAlias" type="_167" context="_104" location="f7:109" file="f7" line="109"/>
  <FundamentalType id="_169" name="char" size="8" align="8"/>
  <CvQualifiedType id="_169c" type="_169" const="1"/>
  <FundamentalType id="_170" name="float" size="32" align="32"/>
  <CvQualifiedType id="_170c" type="_170" const="1"/>
  <FundamentalType id="_171" name="double" size="64" align="64"/>
  <CvQualifiedType id="_171c" type="_171" const="1"/>
  <PointerType id="_172" type="_169c" size="64" align="64"/>
  <PointerType id="_173" type="_259c" size="64" align="64"/>
  <Field id="_174" name="isa" type="_279" context="_113" access="public" offset="0"/>
  <Field id="_175" name="flags" type="_148" context="_113" access="public" offset="64"/>
  <Field id="_176" name="str" type="_172" context="_113" access="public" offset="128"/>
  <Field id="_177" name="length" type="_149" context="_113" access="public" offset="192"/>
  <Struct id="_178" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_280 _281 _282 _283" size="192" align="64"/>
  <FundamentalType id="_179" name="decltype(nullptr)" size="64" align="64"/>
  <Typedef id="_180" name="__type" type="_119" context="_120" access="public" location="f9:72" file="f9" line="72"/>
  <Constructor id="_181" name="__byte_operand" context="_120" access="public" location="f9:72" file="f9" line="72" inline="1" artificial="1"/>
  <Constructor id="_182" name="__byte_operand" context="_120" access="public" location="f9:72" file="f9" line="72" inline="1" artificial="1">
    <Argument type="_284" location="f9:72" file="f9" line="72"/>
  </Constructor>
  <OperatorMethod id="_183" name="=" returns="_285" context="_120" access="public" location="f9:72" file="f9" line="72" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIbEaSERKS0_">
    <Argument type="_284" location="f9:72" file="f9" line="72"/>
  </OperatorMethod>
  <Destructor id="_184" name="__byte_operand" context="_120" access="public" location="f9:72" file="f9" line="72" inline="1" artificial="1"/>
  <Typedef id="_185" name="__type" type="_119" context="_121" access="public" location="f9:73" file="f9" line="73"/>
  <Constructor id="_186" name="__byte_operand" context="_121" access="public" location="f9:73" file="f9" line="73" inline="1" artificial="1"/>
  <Constructor id="_187" name="__byte_operand" context="_121" access="public" location="f9:73" file="f9" line="73" inline="1" artificial="1">
    <Argument type="_286" location="f9:73" file="f9" line="73"/>
  </Constructor>
  <OperatorMethod id="_188" name="=" returns="_287" context="_121" access="public" location="f9:73" file="f9" line="73" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIcEaSERKS0_">
    <Argument type="_286" location="f9:73" file="f9" line="73"/>
  </OperatorMethod>
  <Destructor id="_189" name="__byte_operand" context="_121" access="public" location="f9:73" file="f9" line="73" inline="1" artificial="1"/>
  <Typedef id="_190" name="__type" type="_119" context="_122" access="public" location="f9:74" file="f9" line="74"/>
  <Constructor id="_191" name="__byte_operand" context="_122" access="public" location="f9:74" file="f9" line="74" inline="1" artificial="1"/>
  <Constructor id="_192" name="__byte_operand" context="_122" access="public" location="f9:74" file="f9" line="74" inline="1" artificial="1">
    <Argument type="_288" location="f9:74" file="f9" line="74"/>
  </Constructor>
  <OperatorMethod id="_193" name="=" returns="_289" context="_122" access="public" location="f9:74" file="f9" line="74" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIaEaSERKS0_">
    <Argument type="_288" location="f9:74" file="f9" line="74"/>
  </OperatorMethod>
  <Destructor id="_194" name="__byte_operand" context="_122" access="public" location="f9:74" file="f9" line="74" inline="1" artificial="1"/>
  <Typedef id="_195" name="__type" type="_119" context="_123" access="public" location="f9:75" file="f9" line="75"/>
  <Constructor id="_196" name="__byte_operand" context="_123" access="public" location="f9:75" file="f9" line="75" inline="1" artificial="1"/>
  <Constructor id="_197" name="__byte_operand" context="_123" access="public" location="f9:75" file="f9" line="75" inline="1" artificial="1">
    <Argument type="_290" location="f9:75" file="f9" line="75"/>
  </Constructor>
  <OperatorMethod id="_198" name="=" returns="_291" context="_123" access="public" location="f9:75" file="f9" line="75" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIhEaSERKS0_">
    <Argument type="_290" location="f9:75" file="f9" line="75"/>
  </OperatorMethod>
  <Destructor id="_199" name="__byte_operand" context="_123" access="public" location="f9:75" file="f9" line="75" inline="1" artificial="1"/>
  <Typedef id="_200" name="__type" type="_119" context="_124" access="public" location="f9:77" file="f9" line="77"/>
  <Constructor id="_201" name="__byte_operand" context="_124" access="public" location="f9:77" file="f9" line="77" inline="1" artificial="1"/>
  <Constructor id="_202" name="__byte_operand" context="_124" access="public" location="f9:77" file="f9" line="77" inline="1" artificial="1">
    <Argument type="_292" location="f9:77" file="f9" line="77"/>
  </Constructor>
  <OperatorMethod id="_203" name="=" returns="_293" context="_124" access="public" location="f9:77" file="f9" line="77" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIwEaSERKS0_">
    <Argument type="_292" location="f9:77" file="f9" line="77"/>
  </OperatorMethod>
  <Destructor id="_204" name="__byte_operand" context="_124" access="public" location="f9:77" file="f9" line="77" inline="1" artificial="1"/>
  <Typedef id="_205" name="__type" type="_119" context="_125" access="public" location="f9:82" file="f9" line="82"/>
  <Constructor id="_206" name="__byte_operand" context="_125" access="public" location="f9:82" file="f9" line="82" inline="1" artificial="1"/>
  <Constructor id="_207" name="__byte_operand" context="_125" access="public" location="f9:82" file="f9" line="82" inline="1" artificial="1">
    <Argument type="_294" location="f9:82" file="f9" line="82"/>
  </Constructor>
  <OperatorMethod id="_208" name="=" returns="_295" context="_125" access="public" location="f9:82" file="f9" line="82" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIDsEaSERKS0_">
    <Argument type="_294" location="f9:82" file="f9" line="82"/>
  </OperatorMethod>
  <Destructor id="_209" name="__byte_operand" context="_125" access="public" location="f9:82" file="f9" line="82" inline="1" artificial="1"/>
  <Typedef id="_210" name="__type" type="_119" context="_126" access="public" location="f9:83" file="f9" line="83"/>
  <Constructor id="_211" name="__byte_operand" context="_126" access="public" location="f9:83" file="f9" line="83" inline="1" artificial="1"/>
  <Constructor id="_212" name="__byte_operand" context="_126" access="public" location="f9:83" file="f9" line="83" inline="1" artificial="1">
    <Argument type="_296" location="f9:83" file="f9" line="83"/>
  </Constructor>
  <OperatorMethod id="_213" name="=" returns="_297" context="_126" access="public" location="f9:83" file="f9" line="83" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIDiEaSERKS0_">
    <Argument type="_296" location="f9:83" file="f9" line="83"/>
  </OperatorMethod>
  <Destructor id="_214" name="__byte_operand" context="_126" access="public" location="f9:83" file="f9" line="83" inline="1" artificial="1"/>
  <Typedef id="_215" name="__type" type="_119" context="_127" access="public" location="f9:84" file="f9" line="84"/>
  <Constructor id="_216" name="__byte_operand" context="_127" access="public" location="f9:84" file="f9" line="84" inline="1" artificial="1"/>
  <Constructor id="_217" name="__byte_operand" context="_127" access="public" location="f9:84" file="f9" line="84" inline="1" artificial="1">
    <Argument type="_298" location="f9:84" file="f9" line="84"/>
  </Constructor>
  <OperatorMethod id="_218" name="=" returns="_299" context="_127" access="public" location="f9:84" file="f9" line="84" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIsEaSERKS0_">
    <Argument type="_298" location="f9:84" file="f9" line="84"/>
  </OperatorMethod>
  <Destructor id="_219" name="__byte_operand" context="_127" access="public" location="f9:84" file="f9" line="84" inline="1" artificial="1"/>
  <Typedef id="_220" name="__type" type="_119" context="_128" access="public" location="f9:85" file="f9" line="85"/>
  <Constructor id="_221" name="__byte_operand" context="_128" access="public" location="f9:85" file="f9" line="85" inline="1" artificial="1"/>
  <Constructor id="_222" name="__byte_operand" context="_128" access="public" location="f9:85" file="f9" line="85" inline="1" artificial="1">
    <Argument type="_300" location="f9:85" file="f9" line="85"/>
  </Constructor>
  <OperatorMethod id="_223" name="=" returns="_301" context="_128" access="public" location="f9:85" file="f9" line="85" inline="1" artificial="1" mangled="_ZNSt14__byte_operandItEaSERKS0_">
    <Argument type="_300" location="f9:85" file="f9" line="85"/>
  </OperatorMethod>
  <Destructor id="_224" name="__byte_operand" context="_128" access="public" location="f9:85" file="f9" line="85" inline="1" artificial="1"/>
  <Typedef id="_225" name="__type" type="_119" context="_129" access="public" location="f9:86" file="f9" line="86"/>
  <Constructor id="_226" name="__byte_operand" context="_129" access="public" location="f9:86" file="f9" line="86" inline="1" artificial="1"/>
  <Constructor id="_227" name="__byte_operand" context="_129" access="public" location="f9:86" file="f9" line="86" inline="1" artificial="1">
    <Argument type="_302" location="f9:86" file="f9" line="86"/>
  </Constructor>
  <OperatorMethod id="_228" name="=" returns="_303" context="_129" access="public" location="f9:86" file="f9" line="86" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIiEaSERKS0_">
    <Argument type="_302" location="f9:86" file="f9" line="86"/>
  </OperatorMethod>
  <Destructor id="_229" name="__byte_operand" context="_129" access="public" location="f9:86" file="f9" line="86" inline="1" artificial="1"/>
  <Typedef id="_230" name="__type" type="_119" context="_130" access="public" location="f9:87" file="f9" line="87"/>
  <Constructor id="_231" name="__byte_operand" context="_130" access="public" location="f9:87" file="f9" line="87" inline="1" artificial="1"/>
  <Constructor id="_232" name="__byte_operand" context="_130" access="public" location="f9:87" file="f9" line="87" inline="1" artificial="1">
    <Argument type="_304" location="f9:87" file="f9" line="87"/>
  </Constructor>
  <OperatorMethod id="_233" name="=" returns="_305" context="_130" access="public" location="f9:87" file="f9" line="87" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIjEaSERKS0_">
    <Argument type="_304" location="f9:87" file="f9" line="87"/>
  </OperatorMethod>
  <Destructor id="_234" name="__byte_operand" context="_130" access="public" location="f9:87" file="f9" line="87" inline="1" artificial="1"/>
  <Typedef id="_235" name="__type" type="_119" context="_131" access="public" location="f9:88" file="f9" line="88"/>
  <Constructor id="_236" name="__byte_operand" context="_131" access="public" location="f9:88" file="f9" line="88" inline="1" artificial="1"/>
  <Constructor id="_237" name="__byte_operand" context="_131" access="public" location="f9:88" file="f9" line="88" inline="1" artificial="1">
    <Argument type="_306" location="f9:88" file="f9" line="88"/>
  </Constructor>
  <OperatorMethod id="_238" name="=" returns="_307" context="_131" access="public" location="f9:88" file="f9" line="88" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIlEaSERKS0_">
    <Argument type="_306" location="f9:88" file="f9" line="88"/>
  </OperatorMethod>
  <Destructor id="_239" name="__byte_operand" context="_131" access="public" location="f9:88" file="f9" line="88" inline="1" artificial="1"/>
  <Typedef id="_240" name="__type" type="_119" context="_132" access="public" location="f9:89" file="f9" line="89"/>
  <Constructor id="_241" name="__byte_operand" context="_132" access="public" location="f9:89" file="f9" line="89" inline="1" artificial="1"/>
  <Constructor id="_242" name="__byte_operand" context="_132" access="public" location="f9:89" file="f9" line="89" inline="1" artificial="1">
    <Argument type="_308" location="f9:89" file="f9" line="89"/>
  </Constructor>
  <OperatorMethod id="_243" name="=" returns="_309" context="_132" access="public" location="f9:89" file="f9" line="89" inline="1" artificial="1" mangled="_ZNSt14__byte_operandImEaSERKS0_">
    <Argument type="_308" location="f9:89" file="f9" line="89"/>
  </OperatorMethod>
  <Destructor id="_244" name="__byte_operand" context="_132" access="public" location="f9:89" file="f9" line="89" inline="1" artificial="1"/>
  <Typedef id="_245" name="__type" type="_119" context="_133" access="public" location="f9:90" file="f9" line="90"/>
  <Constructor id="_246" name="__byte_operand" context="_133" access="public" location="f9:90" file="f9" line="90" inline="1" artificial="1"/>
  <Constructor id="_247" name="__byte_operand" context="_133" access="public" location="f9:90" file="f9" line="90" inline="1" artificial="1">
    <Argument type="_310" location="f9:90" file="f9" line="90"/>
  </Constructor>
  <OperatorMethod id="_248" name="=" returns="_311" context="_133" access="public" location="f9:90" file="f9" line="90" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIxEaSERKS0_">
    <Argument type="_310" location="f9:90" file="f9" line="90"/>
  </OperatorMethod>
  <Destructor id="_249" name="__byte_operand" context="_133" access="public" location="f9:90" file="f9" line="90" inline="1" artificial="1"/>
  <Typedef id="_250" name="__type" type="_119" context="_134" access="public" location="f9:91" file="f9" line="91"/>
  <Constructor id="_251" name="__byte_operand" context="_134" access="public" location="f9:91" file="f9" line="91" inline="1" artificial="1"/>
  <Constructor id="_252" name="__byte_operand" context="_134" access="public" location="f9:91" file="f9" line="91" inline="1" artificial="1">
    <Argument type="_312" location="f9:91" file="f9" line="91"/>
  </Constructor>
  <OperatorMethod id="_253" name="=" returns="_313" context="_134" access="public" location="f9:91" file="f9" line="91" inline="1" artificial="1" mangled="_ZNSt14__byte_operandIyEaSERKS0_">
    <Argument type="_312" location="f9:91" file="f9" line="91"/>
  </OperatorMethod>
  <Destructor id="_254" name="__byte_operand" context="_134" access="public" location="f9:91" file="f9" line="91" inline="1" artificial="1"/>
  <ReferenceType id="_255" type="_119" size="64" align="64"/>
  <ArrayType id="_256" min="0" max="1" type="_148"/>
  <ReferenceType id="_257" type="_43c" size="64" align="64"/>
  <CvQualifiedType id="_43c" type="_43" const="1"/>
  <ReferenceType id="_258" type="_43" size="64" align="64"/>
  <CvQualifiedType id="_259c" type="_259" const="1"/>
  <FundamentalType id="_260" name="long long int" size="64" align="64"/>
  <FundamentalType id="_261" name="long double" size="128" align="128"/>
  <ReferenceType id="_262" type="_102c" size="64" align="64"/>
  <CvQualifiedType id="_102c" type="_102" const="1"/>
  <ReferenceType id="_263" type="_102" size="64" align="64"/>
  <Enumeration id="_264" name="SimpleEnum" type="_144" context="_166" location="f7:21" file="f7" line="21" size="32" align="32">
    <EnumValue name="First" init="0"/>
    <EnumValue name="Second" init="100"/>
    <EnumValue name="Third" init="101"/>
  </Enumeration>
  <Struct id="_265" name="PackedStruct" context="_166" location="f7:28" file="f7" line="28" members="_314 _315 _316 _317 _318 _319 _320 _321 _322 _323 _324 _325 _326 _327" size="200" align="8"/>
  <Typedef id="_266" name="PS" type="_265" context="_166" location="f7:46" file="f7" line="46"/>
  <Class id="_267" name="ComplexClass" context="_166" location="f7:48" file="f7" line="48" members="_328 _329 _330 _331 _332 _333 _334 _335 _336 _337 _338 _339 _340 _341 _342 _343 _344 _345" size="8000" align="64"/>
  <Field id="_268" name="complex" type="_267" context="_167" access="public" location="f7:92" file="f7" line="92" offset="0"/>
  <Field id="_269" name="container_color" type="_164" context="_167" access="public" location="f7:93" file="f7" line="93" offset="8000"/>
  <Union id="_270" name="" context="_167" access="public" location="f7:95" file="f7" line="95" members="_346 _347 _348 _349 _350 _351" size="64" align="64"/>
  <Field id="_271" name="id_union" type="_352" context="_167" access="public" location="f7:98" file="f7" line="98" offset="8064"/>
  <Struct id="_272" name="" context="_167" access="public" location="f7:100" file="f7" line="100" members="_353 _354 _355 _356 _357 _358 _359" size="96" align="32"/>
  <Field id="_273" name="position" type="_360" context="_167" access="public" location="f7:104" file="f7" line="104" offset="8128"/>
  <Field id="_274" name="comparator" type="_361" context="_167" access="public" location="f7:106" file="f7" line="106" offset="8256"/>
  <Constructor id="_275" name="Container" context="_167" access="public" location="f7:91" file="f7" line="91" inline="1" artificial="1"/>
  <Constructor id="_276" name="Container" context="_167" access="public" location="f7:91" file="f7" line="91" inline="1" artificial="1">
    <Argument type="_362" location="f7:91" file="f7" line="91"/>
  </Constructor>
  <OperatorMethod id="_277" name="=" returns="_363" context="_167" access="public" location="f7:91" file="f7" line="91" inline="1" artificial="1" mangled="_ZN14OuterNamespace9ContaineraSERKS0_">
    <Argument type="_362" location="f7:91" file="f7" line="91"/>
  </OperatorMethod>
  <Destructor id="_278" name="Container" context="_167" access="public" location="f7:91" file="f7" line="91" inline="1" artificial="1"/>
  <PointerType id="_279" type="_148c" size="64" align="64"/>
  <Field id="_280" name="gp_offset" type="_144" context="_178" access="public" offset="0"/>
  <Field id="_281" name="fp_offset" type="_144" context="_178" access="public" offset="32"/>
  <Field id="_282" name="overflow_arg_area" type="_156" context="_178" access="public" offset="64"/>
  <Field id="_283" name="reg_save_area" type="_156" context="_178" access="public" offset="128"/>
  <ReferenceType id="_284" type="_120c" size="64" align="64"/>
  <CvQualifiedType id="_120c" type="_120" const="1"/>
  <ReferenceType id="_285" type="_120" size="64" align="64"/>
  <ReferenceType id="_286" type="_121c" size="64" align="64"/>
  <CvQualifiedType id="_121c" type="_121" const="1"/>
  <ReferenceType id="_287" type="_121" size="64" align="64"/>
  <ReferenceType id="_288" type="_122c" size="64" align="64"/>
  <CvQualifiedType id="_122c" type="_122" const="1"/>
  <ReferenceType id="_289" type="_122" size="64" align="64"/>
  <ReferenceType id="_290" type="_123c" size="64" align="64"/>
  <CvQualifiedType id="_123c" type="_123" const="1"/>
  <ReferenceType id="_291" type="_123" size="64" align="64"/>
  <ReferenceType id="_292" type="_124c" size="64" align="64"/>
  <CvQualifiedType id="_124c" type="_124" const="1"/>
  <ReferenceType id="_293" type="_124" size="64" align="64"/>
  <ReferenceType id="_294" type="_125c" size="64" align="64"/>
  <CvQualifiedType id="_125c" type="_125" const="1"/>
  <ReferenceType id="_295" type="_125" size="64" align="64"/>
  <ReferenceType id="_296" type="_126c" size="64" align="64"/>
  <CvQualifiedType id="_126c" type="_126" const="1"/>
  <ReferenceType id="_297" type="_126" size="64" align="64"/>
  <ReferenceType id="_298" type="_127c" size="64" align="64"/>
  <CvQualifiedType id="_127c" type="_127" const="1"/>
  <ReferenceType id="_299" type="_127" size="64" align="64"/>
  <ReferenceType id="_300" type="_128c" size="64" align="64"/>
  <CvQualifiedType id="_128c" type="_128" const="1"/>
  <ReferenceType id="_301" type="_128" size="64" align="64"/>
  <ReferenceType id="_302" type="_129c" size="64" align="64"/>
  <CvQualifiedType id="_129c" type="_129" const="1"/>
  <ReferenceType id="_303" type="_129" size="64" align="64"/>
  <ReferenceType id="_304" type="_130c" size="64" align="64"/>
  <CvQualifiedType id="_130c" type="_130" const="1"/>
  <ReferenceType id="_305" type="_130" size="64" align="64"/>
  <ReferenceType id="_306" type="_131c" size="64" align="64"/>
  <CvQualifiedType id="_131c" type="_131" const="1"/>
  <ReferenceType id="_307" type="_131" size="64" align="64"/>
  <ReferenceType id="_308" type="_132c" size="64" align="64"/>
  <CvQualifiedType id="_132c" type="_132" const="1"/>
  <ReferenceType id="_309" type="_132" size="64" align="64"/>
  <ReferenceType id="_310" type="_133c" size="64" align="64"/>
  <CvQualifiedType id="_133c" type="_133" const="1"/>
  <ReferenceType id="_311" type="_133" size="64" align="64"/>
  <ReferenceType id="_312" type="_134c" size="64" align="64"/>
  <CvQualifiedType id="_134c" type="_134" const="1"/>
  <ReferenceType id="_313" type="_134" size="64" align="64"/>
  <Field id="_314" name="id" type="_165" context="_265" access="public" location="f7:29" file="f7" line="29" offset="0"/>
  <Field id="_315" name="flags" type="_169" bits="3" context="_265" access="public" location="f7:30" file="f7" line="30" offset="32"/>
  <Field id="_316" name="is_valid" type="_364" bits="1" context="_265" access="public" location="f7:31" file="f7" line="31" offset="35"/>
  <Field id="_317" name="reserved" type="_76" bits="4" context="_265" access="public" location="f7:32" file="f7" line="32" offset="36"/>
  <Union id="_318" context="_265" access="public" location="f7:34" file="f7" line="34" members="_365 _366 _367 _368 _369 _370" size="32" align="8"/>
  <Field id="_319" name="" type="_318" context="_265" access="public" location="f7:34" file="f7" line="34" offset="40"/>
  <Unimplemented id="_320" kind="IndirectField"/>
  <Unimplemented id="_321" kind="IndirectField"/>
  <Struct id="_322" name="" context="_265" access="public" location="f7:39" file="f7" line="39" members="_371 _372 _373 _374 _375 _376" size="128" align="8"/>
  <Field id="_323" name="coordinates" type="_377" context="_265" access="public" location="f7:42" file="f7" line="42" offset="72"/>
  <Constructor id="_324" name="PackedStruct" context="_265" access="public" location="f7:28" file="f7" line="28" inline="1" artificial="1"/>
  <Constructor id="_325" name="PackedStruct" context="_265" access="public" location="f7:28" file="f7" line="28" inline="1" artificial="1">
    <Argument type="_378" location="f7:28" file="f7" line="28"/>
  </Constructor>
  <OperatorMethod id="_326" name="=" returns="_379" context="_265" access="public" location="f7:28" file="f7" line="28" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12PackedStructaSERKS1_">
    <Argument type="_378" location="f7:28" file="f7" line="28"/>
  </OperatorMethod>
  <Destructor id="_327" name="PackedStruct" context="_265" access="public" location="f7:28" file="f7" line="28" inline="1" artificial="1"/>
  <Enumeration id="_328" name="NestedEnum" type="_76" context="_267" access="public" location="f7:50" file="f7" line="50" size="8" align="8">
    <EnumValue name="Alpha" init="0"/>
    <EnumValue name="Beta" init="1"/>
    <EnumValue name="Gamma" init="2"/>
  </Enumeration>
  <Typedef id="_329" name="Callback" type="_380" context="_267" access="public" location="f7:56" file="f7" line="56"/>
  <Struct id="_330" name="NestedStruct" context="_267" access="public" location="f7:58" file="f7" line="58" members="_381 _382 _383 _384 _385 _386 _387" size="192" align="64"/>
  <Union id="_331" name="DataUnion" context="_267" access="public" location="f7:64" file="f7" line="64" members="_388 _389 _390 _391 _392 _393 _394" size="32" align="32"/>
  <Field id="_332" name="packed_data" type="_266" context="_267" access="public" location="f7:72" file="f7" line="72" offset="0"/>
  <Field id="_333" name="nested" type="_330" context="_267" access="public" location="f7:73" file="f7" line="73" offset="256"/>
  <Field id="_334" name="data_union" type="_331" context="_267" access="public" location="f7:74" file="f7" line="74" offset="448"/>
  <Field id="_335" name="ids" type="_395" context="_267" access="public" location="f7:76" file="f7" line="76" offset="512"/>
  <Field id="_336" name="array2" type="_396" context="_267" access="public" location="f7:77" file="f7" line="77" offset="832"/>
  <Field id="_337" name="array3" type="_397" context="_267" access="public" location="f7:78" file="f7" line="78" offset="1472"/>
  <Field id="_338" name="array4" type="_398" context="_267" access="public" location="f7:79" file="f7" line="79" offset="5952"/>
  <Field id="_339" name="name" type="_172" context="_267" access="public" location="f7:80" file="f7" line="80" offset="7872"/>
  <Struct id="_340" name="" context="_267" access="public" location="f7:82" file="f7" line="82" members="_399 _400 _401 _402 _403 _404 _405" size="16" align="8"/>
  <Field id="_341" name="flags" type="_406" context="_267" access="public" location="f7:86" file="f7" line="86" offset="7936"/>
  <Constructor id="_342" name="ComplexClass" context="_267" access="public" location="f7:48" file="f7" line="48" inline="1" artificial="1"/>
  <Constructor id="_343" name="ComplexClass" context="_267" access="public" location="f7:48" file="f7" line="48" inline="1" artificial="1">
    <Argument type="_407" location="f7:48" file="f7" line="48"/>
  </Constructor>
  <OperatorMethod id="_344" name="=" returns="_408" context="_267" access="public" location="f7:48" file="f7" line="48" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12ComplexClassaSERKS1_">
    <Argument type="_407" location="f7:48" file="f7" line="48"/>
  </OperatorMethod>
  <Destructor id="_345" name="ComplexClass" context="_267" access="public" location="f7:48" file="f7" line="48" inline="1" artificial="1"/>
  <Field id="_346" name="bytes" type="_409" context="_270" access="public" location="f7:96" file="f7" line="96" offset="0"/>
  <Field id="_347" name="value" type="_79" context="_270" access="public" location="f7:97" file="f7" line="97" offset="0"/>
  <Constructor id="_348" name="" context="_270" access="public" location="f7:95" file="f7" line="95" inline="1" artificial="1"/>
  <Constructor id="_349" name="" context="_270" access="public" location="f7:95" file="f7" line="95" inline="1" artificial="1">
    <Argument type="_410" location="f7:95" file="f7" line="95"/>
  </Constructor>
  <OperatorMethod id="_350" name="=" returns="_411" context="_270" access="public" location="f7:95" file="f7" line="95" inline="1" artificial="1" mangled="_ZN14OuterNamespace9ContainerUt_aSERKS1_">
    <Argument type="_410" location="f7:95" file="f7" line="95"/>
  </OperatorMethod>
  <Destructor id="_351" name="" context="_270" access="public" location="f7:95" file="f7" line="95" inline="1" artificial="1"/>
  <ElaboratedType id="_352" type="_270"/>
  <Field id="_353" name="x" type="_148" context="_272" access="public" location="f7:101" file="f7" line="101" offset="0"/>
  <Field id="_354" name="y" type="_148" context="_272" access="public" location="f7:102" file="f7" line="102" offset="32"/>
  <Field id="_355" name="z" type="_148" context="_272" access="public" location="f7:103" file="f7" line="103" offset="64"/>
  <Constructor id="_356" name="" context="_272" access="public" location="f7:100" file="f7" line="100" inline="1" artificial="1"/>
  <Constructor id="_357" name="" context="_272" access="public" location="f7:100" file="f7" line="100" inline="1" artificial="1">
    <Argument type="_412" location="f7:100" file="f7" line="100"/>
  </Constructor>
  <OperatorMethod id="_358" name="=" returns="_413" context="_272" access="public" location="f7:100" file="f7" line="100" inline="1" artificial="1" mangled="_ZN14OuterNamespace9ContainerUt0_aSERKS1_">
    <Argument type="_412" location="f7:100" file="f7" line="100"/>
  </OperatorMethod>
  <Destructor id="_359" name="" context="_272" access="public" location="f7:100" file="f7" line="100" inline="1" artificial="1"/>
  <ElaboratedType id="_360" type="_272"/>
  <PointerType id="_361" type="_414" size="64" align="64"/>
  <ReferenceType id="_362" type="_167c" size="64" align="64"/>
  <CvQualifiedType id="_167c" type="_167" const="1"/>
  <ReferenceType id="_363" type="_167" size="64" align="64"/>
  <FundamentalType id="_364" name="bool" size="8" align="8"/>
  <Field id="_365" name="value" type="_170" context="_318" access="public" location="f7:35" file="f7" line="35" offset="0"/>
  <Field id="_366" name="raw_value" type="_78" context="_318" access="public" location="f7:36" file="f7" line="36" offset="0"/>
  <Constructor id="_367" name="" context="_318" access="public" location="f7:34" file="f7" line="34" inline="1" artificial="1"/>
  <Constructor id="_368" name="" context="_318" access="public" location="f7:34" file="f7" line="34" inline="1" artificial="1">
    <Argument type="_415" location="f7:34" file="f7" line="34"/>
  </Constructor>
  <OperatorMethod id="_369" name="=" returns="_416" context="_318" access="public" location="f7:34" file="f7" line="34" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12PackedStructUt_aSERKS2_">
    <Argument type="_415" location="f7:34" file="f7" line="34"/>
  </OperatorMethod>
  <Destructor id="_370" name="" context="_318" access="public" location="f7:34" file="f7" line="34" inline="1" artificial="1"/>
  <Field id="_371" name="x" type="_171" context="_322" access="public" location="f7:40" file="f7" line="40" offset="0"/>
  <Field id="_372" name="y" type="_171" context="_322" access="public" location="f7:41" file="f7" line="41" offset="64"/>
  <Constructor id="_373" name="" context="_322" access="public" location="f7:39" file="f7" line="39" inline="1" artificial="1"/>
  <Constructor id="_374" name="" context="_322" access="public" location="f7:39" file="f7" line="39" inline="1" artificial="1">
    <Argument type="_417" location="f7:39" file="f7" line="39"/>
  </Constructor>
  <OperatorMethod id="_375" name="=" returns="_418" context="_322" access="public" location="f7:39" file="f7" line="39" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12PackedStructUt0_aSERKS2_">
    <Argument type="_417" location="f7:39" file="f7" line="39"/>
  </OperatorMethod>
  <Destructor id="_376" name="" context="_322" access="public" location="f7:39" file="f7" line="39" inline="1" artificial="1"/>
  <ElaboratedType id="_377" type="_322"/>
  <ReferenceType id="_378" type="_265c" size="64" align="64"/>
  <CvQualifiedType id="_265c" type="_265" const="1"/>
  <ReferenceType id="_379" type="_265" size="64" align="64"/>
  <PointerType id="_380" type="_419" size="64" align="64"/>
  <Field id="_381" name="cb" type="_329" context="_330" access="public" location="f7:59" file="f7" line="59" offset="0"/>
  <Field id="_382" name="status" type="_328" context="_330" access="public" location="f7:60" file="f7" line="60" offset="64"/>
  <Field id="_383" name="context" type="_156" context="_330" access="public" location="f7:61" file="f7" line="61" offset="128"/>
  <Constructor id="_384" name="NestedStruct" context="_330" access="public" location="f7:58" file="f7" line="58" inline="1" artificial="1"/>
  <Constructor id="_385" name="NestedStruct" context="_330" access="public" location="f7:58" file="f7" line="58" inline="1" artificial="1">
    <Argument type="_420" location="f7:58" file="f7" line="58"/>
  </Constructor>
  <OperatorMethod id="_386" name="=" returns="_421" context="_330" access="public" location="f7:58" file="f7" line="58" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12ComplexClass12NestedStructaSERKS2_">
    <Argument type="_420" location="f7:58" file="f7" line="58"/>
  </OperatorMethod>
  <Destructor id="_387" name="NestedStruct" context="_330" access="public" location="f7:58" file="f7" line="58" inline="1" artificial="1"/>
  <Field id="_388" name="int_data" type="_74" context="_331" access="public" location="f7:65" file="f7" line="65" offset="0"/>
  <Struct id="_389" name="" context="_331" access="public" location="f7:66" file="f7" line="66" members="_422 _423 _424 _425 _426 _427" size="32" align="16"/>
  <Field id="_390" name="split_data" type="_428" context="_331" access="public" location="f7:69" file="f7" line="69" offset="0"/>
  <Constructor id="_391" name="DataUnion" context="_331" access="public" location="f7:64" file="f7" line="64" inline="1" artificial="1"/>
  <Constructor id="_392" name="DataUnion" context="_331" access="public" location="f7:64" file="f7" line="64" inline="1" artificial="1">
    <Argument type="_429" location="f7:64" file="f7" line="64"/>
  </Constructor>
  <OperatorMethod id="_393" name="=" returns="_430" context="_331" access="public" location="f7:64" file="f7" line="64" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12ComplexClass9DataUnionaSERKS2_">
    <Argument type="_429" location="f7:64" file="f7" line="64"/>
  </OperatorMethod>
  <Destructor id="_394" name="DataUnion" context="_331" access="public" location="f7:64" file="f7" line="64" inline="1" artificial="1"/>
  <ArrayType id="_395" min="0" max="4" type="_79"/>
  <ArrayType id="_396" min="0" max="4" type="_431"/>
  <ArrayType id="_397" min="0" max="4" type="_432"/>
  <ArrayType id="_398" min="0" max="4" type="_433"/>
  <Field id="_399" name="enabled" type="_364" context="_340" access="public" location="f7:83" file="f7" line="83" offset="0"/>
  <Field id="_400" name="priority" type="_76" bits="4" context="_340" access="public" location="f7:84" file="f7" line="84" offset="8"/>
  <Field id="_401" name="type" type="_76" bits="4" context="_340" access="public" location="f7:85" file="f7" line="85" offset="12"/>
  <Constructor id="_402" name="" context="_340" access="public" location="f7:82" file="f7" line="82" inline="1" artificial="1"/>
  <Constructor id="_403" name="" context="_340" access="public" location="f7:82" file="f7" line="82" inline="1" artificial="1">
    <Argument type="_434" location="f7:82" file="f7" line="82"/>
  </Constructor>
  <OperatorMethod id="_404" name="=" returns="_435" context="_340" access="public" location="f7:82" file="f7" line="82" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12ComplexClassUt_aSERKS2_">
    <Argument type="_434" location="f7:82" file="f7" line="82"/>
  </OperatorMethod>
  <Destructor id="_405" name="" context="_340" access="public" location="f7:82" file="f7" line="82" inline="1" artificial="1"/>
  <ElaboratedType id="_406" type="_340"/>
  <ReferenceType id="_407" type="_267c" size="64" align="64"/>
  <CvQualifiedType id="_267c" type="_267" const="1"/>
  <ReferenceType id="_408" type="_267" size="64" align="64"/>
  <ArrayType id="_409" min="0" max="7" type="_76"/>
  <ReferenceType id="_410" type="_270c" size="64" align="64"/>
  <CvQualifiedType id="_270c" type="_270" const="1"/>
  <ReferenceType id="_411" type="_270" size="64" align="64"/>
  <ReferenceType id="_412" type="_272c" size="64" align="64"/>
  <CvQualifiedType id="_272c" type="_272" const="1"/>
  <ReferenceType id="_413" type="_272" size="64" align="64"/>
  <ReferenceType id="_415" type="_318c" size="64" align="64"/>
  <CvQualifiedType id="_318c" type="_318" const="1"/>
  <ReferenceType id="_416" type="_318" size="64" align="64"/>
  <ReferenceType id="_417" type="_322c" size="64" align="64"/>
  <CvQualifiedType id="_322c" type="_322" const="1"/>
  <ReferenceType id="_418" type="_322" size="64" align="64"/>
  <ReferenceType id="_420" type="_330c" size="64" align="64"/>
  <CvQualifiedType id="_330c" type="_330" const="1"/>
  <ReferenceType id="_421" type="_330" size="64" align="64"/>
  <Field id="_422" name="a" type="_77" context="_389" access="public" location="f7:67" file="f7" line="67" offset="0"/>
  <Field id="_423" name="b" type="_77" context="_389" access="public" location="f7:68" file="f7" line="68" offset="16"/>
  <Constructor id="_424" name="" context="_389" access="public" location="f7:66" file="f7" line="66" inline="1" artificial="1"/>
  <Constructor id="_425" name="" context="_389" access="public" location="f7:66" file="f7" line="66" inline="1" artificial="1">
    <Argument type="_436" location="f7:66" file="f7" line="66"/>
  </Constructor>
  <OperatorMethod id="_426" name="=" returns="_437" context="_389" access="public" location="f7:66" file="f7" line="66" inline="1" artificial="1" mangled="_ZN14OuterNamespace14InnerNamespace12ComplexClass9DataUnionUt_aSERKS3_">
    <Argument type="_436" location="f7:66" file="f7" line="66"/>
  </OperatorMethod>
  <Destructor id="_427" name="" context="_389" access="public" location="f7:66" file="f7" line="66" inline="1" artificial="1"/>
  <ElaboratedType id="_428" type="_389"/>
  <ReferenceType id="_429" type="_331c" size="64" align="64"/>
  <CvQualifiedType id="_331c" type="_331" const="1"/>
  <ReferenceType id="_430" type="_331" size="64" align="64"/>
  <ArrayType id="_431" min="0" max="1" type="_79"/>
  <ArrayType id="_432" min="0" max="1" type="_438"/>
  <ArrayType id="_433" min="0" max="1" type="_439"/>
  <ReferenceType id="_434" type="_340c" size="64" align="64"/>
  <CvQualifiedType id="_340c" type="_340" const="1"/>
  <ReferenceType id="_435" type="_340" size="64" align="64"/>
  <ReferenceType id="_436" type="_389c" size="64" align="64"/>
  <CvQualifiedType id="_389c" type="_389" const="1"/>
  <ReferenceType id="_437" type="_389" size="64" align="64"/>
  <ArrayType id="_438" min="0" max="6" type="_79"/>
  <ArrayType id="_439" min="0" max="0" type="_440"/>
  <ArrayType id="_440" min="0" max="2" type="_79"/>
  <FundamentalType id="_259" name="void" size="0" align="8"/>
  <FunctionType id="_414" returns="_364">
    <Argument type="_362"/>
    <Argument type="_362"/>
  </FunctionType>
  <FunctionType id="_419" returns="_259">
    <Argument type="_148"/>
    <Argument type="_172"/>
  </FunctionType>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f2" name="/usr/include/x86_64-linux-gnu/bits/stdint-intn.h"/>
  <File id="f3" name="/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h"/>
  <File id="f4" name="/usr/include/stdint.h"/>
  <File id="f5" name="/home/eranbu/.pyenv/versions/3.10.4/lib/python3.10/site-packages/castxml/data/share/castxml/clang/include/stddef.h"/>
  <File id="f6" name="/home/eranbu/.pyenv/versions/3.10.4/lib/python3.10/site-packages/castxml/data/share/castxml/clang/include/__stddef_max_align_t.h"/>
  <File id="f7" name="/home/eranbu/projects/castxml/headers/complicated_structs.hpp"/>
  <File id="f8" name="/../lib/gcc/x86_64-linux-gnu/9/../../../../include/x86_64-linux-gnu/c++/9/bits/c++config.h"/>
  <File id="f9" name="/../lib/gcc/x86_64-linux-gnu/9/../../../../include/c++/9/cstddef"/>
</CastXML>
